{
  "source": "cpsc",
  "topic_id": "portable-anxiety-relief",
  "fetched_at": "2026-01-13T06:43:08.899Z",
  "items": [
    {
      "id": 10540,
      "text": "Agrish Adult Portable Bed Rails Recalled Due to Risk of Serious Injury or Death from Entrapment and Asphyxiation; Violate Mandatory Standard for Adult Portable Bed Rails; Sold on Amazon by Agrish Direct — This recall involves Agrish-branded adult portable bed rails, models 2512, 2513, and 2516, for use on adult beds. The model numbers are printed in the owner's manual. The recalled bed rails have white tubing with rounded gray foam rubber handle grips. Some models include a gray fabric pouch, support legs and a motion-sensor light. Recalled Bed Rails: Model Numbers Size zip 2512 About 11 inches wide and 39 inches in height About 12 inches wide and 42 inches in height 2516 About 37 inches wide and 45 inches in height",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Agrish Adult Portable Bed Rails"
    },
    {
      "id": 10541,
      "text": "DR Power Equipment Reannounces and Expands Recall of Leaf Vacuums Due to Laceration Hazard; New Remedy Available — This recall involves DR Power Equipment walk-behind leaf vacuums and tow-behind leaf vacuums with the following model numbers: Unit Type Model Numbers Walk Behind Leaf Vacuum WL33006DMN WL35008DENSD WL33006DMNR WL35008DMN WL35008DEN WL35008DMNR WL35008DENR WL35008DMNSD WL33106DMN WL35108DEN WL33106DMNR WL35108DENR WL35108DENSD Tow Behind LL3 LL31027DMN LL33032DEN LL33032DENR LL33032DENSD LL33032DMN LL35045DEN LL35045DMN LL35045DMNR LL37045DEN LL37045DMN LL37045DMNR LL37045DMNSD LL37060DEN LL37060DENR LL37145DEN LL31127DMN LL33132DMN LL37160DEN LL31127DMNR LL33132DMNR LL33132DEN LL35145DEN LL33132DENSD LL35145DMN Tow Behind LL2 LL21009DMN LL21009DMNR LL21009DMNSD LL23009DEN LL23009DENR LL23009DENSD LL23009DMN LL23009DMNR LL23009DMNT LL25013DEN LL25013DENR LL25013DENSD LL25013DMN LL25013DMNR LL25013DMNSD LL27016DEN LL27016DENR LL27016DENSD LL27016DMN LL27016DMNR LL27016DMNSD Additional LL2 Models *Note: These model numbers may or may not have spaces as printed on the data tags. LLVX13EDTDV3BF1 LLVX13EDTDVBBF1 LLVX13ENTDV3BF3 LLVX13ENTDVBBF3 LLVX13MDTDV3BF0 LLVX13MDTDV3BF1 LLVX13MDTDVBBF1 LLVX13MNTDV3BF3 LLVX13MNTDVBBF3 LLVX16E LLVX16EDTDV3BF1 LLVX16EDTDVBBF1 LLVX16ENTDV2BF3 LLVX16ENTDV3BF3 LLVX16ENTDVBBF3 LLVX16MDTDV2BF1 LLVX16MDTDV3BF1 LLVX16MDTDVBBF1 LLVX16MNTDV2BF3 LLVX16MNTDV3BF3 LLVX16MNTDVBBF3 LLVX9AMDTDVBBF3 LLVX9AMNTDVBBF3 LLVX9GMNTDVBBF3 LLVXX9EDTDV3BF1 LLVXX9EDTDVBBF1 LLVXX9ENTDV3BF3 LLVXX9ENTDVBBF3 LLVXX9MDTDV3BF1 LLVXX9MDTDVBBF1 LLVXX9MNTDV3BF3 LLVXX9MNTDVBBF3 LLVXX9MNTDVBTF3 \"DR\" is printed on the motor housing. The model number on the walk-behind leaf vacuum is located on the front right side of the unit behind the wheel. The model number on the tow-behind leaf vacuum is on the impeller housing beside the engine.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Walk-Behind Leaf Vacuums and Tow-Behind Leaf Vacuums"
    },
    {
      "id": 10542,
      "text": "Infant Innovations Recalls BabyBond Retractable Safety Gates Due to Risk of Serious Injury or Death to Children from Entrapment; Violates Mandatory Standard for Gates and Enclosures — This recall involves BabyBond-branded retractable safety gates. The recalled safety gates were sold in black, gray and white and have a metal frame. They measure about 33 inches high with an adjustable width up to 55 inches. \"Retractable Safety Gate\" and model number \"SH20.006DB\" are printed on a white label stitched to the mesh fabric on the side of the gate.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "BabyBond Retractable Safety Gates"
    },
    {
      "id": 10553,
      "text": "Isla Rae Magnetic Wireless Chargers Recalled Due to Fire and Burn Hazards; Sold by TJX at T.J. Maxx and Marshalls Stores — This recall involves magnetic wireless chargers sold under the Isla Rae brand. The chargers are compatible with magnetic charging systems and attach magnetically to the back of a phone to charge the device. The chargers were sold in the following colors: white, pink, and purple. The model number \"RM5PBM\" can be found on the side of the magnetic wireless charger, below the markings \"5000 mAh 3.7V.\". Note: Do not throw this recalled lithium-ion battery or device in the trash, the general recycling stream (e.g., street-level or curbside recycling bins), or used battery recycling boxes found at various retail and home improvement stores. Recalled lithium-ion batteries must be disposed of differently than other batteries, because they present a greater risk of fire. Your municipal household hazardous waste (HHW) collection center may accept this recalled lithium-ion battery or device for disposal. Before taking your battery or device to a HHW collection center, contact that office ahead of time and ask whether it accepts recalled lithium-ion batteries. If it does not, contact your municipality for further guidance.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Isla Rae Magnetic Wireless Chargers"
    },
    {
      "id": 10555,
      "text": "Joyful Journeys Recalls Baby Loungers Due to Risk of Serious Injury or Death from Entrapment and Fall Hazards; Violates Mandatory Standard for Infant Sleep Products — This recall involves Joyful Journeys baby loungers. The recalled baby loungers are made of a foam sleeping pad and padded bumpers with a cloth cover. The recalled baby loungers zip up into a bag with a strap at the top. The recalled baby loungers were sold in the following styles: green avocado, blue dinosaur, blue lambs, blue zoo animals, green minky, neutral elephants, pink zoo animals, and white minky. \"Joyful Journeys\" can be found on a tag stitched on the outside of the lounger cover and on a label stitched directly onto the back of the lounger.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Joyful Journeys Baby Loungers"
    },
    {
      "id": 10552,
      "text": "Kori Gey Water Toy Kits Recalled Due to Risk of Serious Injury or Death from Battery Ingestion; Violates Mandatory Standard for Toys; Sold on Amazon by Qaniy — This recall involves Kori Gey-branded water elf toy kits. The recalled kits are a children's craft toy that uses colored gel dropped into water to form soft, squishy jelly-like figures. The toy kit consists of 22 bottles of water gel (12 non-sparkly and 10 sparkly), 22 molds in various shapes, a plastic strainer, a plastic jar labeled magic powder, extra magic powder packet, a paint brush, disposable gloves and a LED light with a button cell battery. The toy sets come in a plastic jar with lid. \"Kori Gey\" and \"Water Elf Kit\" are printed on the front of the toy kits.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Kori Gey Water Elf Toy Kits"
    },
    {
      "id": 10544,
      "text": "Marcus Adler Glove Recalls Julie and Judah Pajama Pants and Shorts Due to Burn Hazard; Violates Mandatory Flammability Standards for Children's Sleepwear — This recall involves Julie and Judah pajama and lounge pants and shorts sold separately in various prints, including Fuzzy Heart, Gummy Bear, Star, Star Multi, Teddy Bear, Candy, Graffiti, Sprinkle, Smiley Flower, Shooting Star, Ribbon, Cloud, Boys Varsity Sports (pants only) and Boys Gaming (pants only). The pants were sold in sizes \"S\", \"M\" and \"L\". The shorts were sold in sizes \"S\" and \"M\". \"Julie and Judah\" appear on the main label sewn into the pants and shorts.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Julie and Judah pajama pants and shorts"
    },
    {
      "id": 10545,
      "text": "NFSVLB Baby Bath Seats Recalled Due to Risk of Serious Injury or Death to Children from Drowning and Entrapment; Violate Mandatory Standard for Infant Bath Seats; Sold on Amazon by NFSVLB — This recall involves NFSVLB-branded Baby Bath Seats. They are blue and white and have detachable arms that serve as a restraint. There are four suction cups on the seat's bottom. \"Model No.: ZY2025\" is printed on a label located on the side of the bath seat.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "NFSVLB Baby Bath Seats (blue)"
    },
    {
      "id": 10554,
      "text": "PNW Components Recalls Aluminum Alloy Bicycle Pedals Due to Crash Hazard — This recall involves the PNW Components Loam Pedal Gen 2 aluminum alloy mountain bike pedal. These pedals were sold after market through online retailers and bicycle shops. The pedal is a platform style (non-clip) pedal and can be identified by a \"Tectonic\" logo laser etched onto the pedal body on the left corner, on the same side as the threaded axle. The pedals are available in black, silver, green, orange and purple.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Loam Pedal Gen 2 aluminum alloy bicycle pedals"
    },
    {
      "id": 10550,
      "text": "Pounding Toys Recalled Due to Risk of Serious Injury or Death from Magnet Ingestion Hazard; Violate Mandatory Standard for Toys; Sold on Amazon by Findriver and Weeksome — This recall involves the Lterfear Multifunction Pounding Game, model No. D888. The wooden multifunction pounding game includes four games: whack-a-mole, fishing, xylophone, and carrot cutting. The toy has a xylophone, gears, a clock, holes to insert various fruit shapes, and \"moles\" for pounding. The toy is sold with accessories, including xylophone mallets, a fishing rod, a pounding mallet, four wooden fish, four wooden carrots, wooden fruit and wooden knives. There are no markings on the product.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Lterfear Multifunction Pounding Game"
    },
    {
      "id": 10546,
      "text": "Rattan 6-Drawer Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment; Violate Mandatory Standard for Clothing Storage Units; Sold on Amazon by Rattan — This recall involves Rattan 6-Drawer Dressers, model YD001. The dressers are a natural wood color. They are made of wood, have six drawers with woven rattan drawer fronts, gold handles, and measure 43.3 inches by 15.7 inches by 29.5 inches. The model number \"YD001\" can be found on the product packaging.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Rattan 6-Drawer Dressers"
    },
    {
      "id": 10551,
      "text": "RH Recalls Natural Antler Chandeliers Due to Impact Hazard — This recall involves RH 48\" and 60\" diameter Natural Antler Chandeliers manufactured between September 2021 and October 2024 per customer special order and hung at an angle on a vaulted ceiling or sloped beam. The chandeliers are made from naturally shed elk antlers and were sold in three finishes: natural, sun-bleached and black. The 48\" diameter chandelier measures about 48\" tall and weighs about 40 pounds and was sold with SKU numbers 10036671NAT, 10036671SUNB and 10036671BLK. The 60\" diameter chandelier measures about 36\" tall and weighs about 45 pounds and was sold with SKU numbers 10035099NAT, 10035099SUNB and 10035099BLK. The SKU number is located on the order confirmation and printed on the receipt.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "48\" and 60\" Natural Antler Chandeliers"
    },
    {
      "id": 10547,
      "text": "Sangohe Adult Portable Bed Rails Recalled Due to Risk of Serious Injury or Death from Entrapment and Asphyxiation; Violate Mandatory Standard for Adult Portable Bed Rails — This recall involves Sangohe-branded adult portable bed rails. The black, trapezoidal-shaped bed rails measure about 22.4 inches wide by 32 inches tall and have an extendable handle with gray padding and a storage mesh pocket. Model number \"KDB504A01FT\" is printed on a label located on the frame, either on the bottom foot tube or on the horizontal cross tube. \"Sangohe\" is printed on the product packaging.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Sangohe Bed Rails"
    },
    {
      "id": 10543,
      "text": "The Kalencom Corporation Recalls SARO Braided Crib Bumpers Due to Risk of Serious Injury or Death from Suffocation; Violates Federal Crib Bumper Ban — This recall involves SARO Braided Crib Bumpers, Model 1374. The crib bumpers were sold in salmon, gray and mint colors. \"Ref. 1374\" is printed on a tag sewn into the crib bumpers and on a tag attached to the product packaging.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "SARO Braided Crib Bumpers"
    },
    {
      "id": 10548,
      "text": "Vasicar 18-Drawer Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment; Violates Mandatory Standard for Clothing Storage Units — This recall involves Vasicar 18-Drawer Dressers. The dressers were sold in black, white, gray, and mixed colors. They have a metal frame, wooden top, and 18 collapsable fabric drawers. The dressers are 37.8 inches long by 11.8 inches wide by 57.1 inches tall. Some of the dressers have \"VR-US18D-Black,\" \"VR-US18D-White,\" \"VR-US18D-Gray,\" and \"VR-US18D-Mixed\" printed on the product packaging.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Vasicar 18-Drawer Dressers"
    },
    {
      "id": 10549,
      "text": "YOLAAH Adult Portable Bed Rails Recalled Due to Risk of Serious Injury or Death from Entrapment and Asphyxiation Hazards; Violate Mandatory Standard for Adult Portable Bed Rails — This recall involves YOLAAH Bed Rails, model BR-01. The bed rail has a black rubber hand grip, storage pocket, and white metal base. The bed rails measure 15.8 inches tall by 26.8 inches wide. The bed rail has \"YOLAAH\" printed on the storage pocket.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "YOLAAH Portable Bed Rails"
    },
    {
      "id": 10531,
      "text": "17 Stories Furniture 18-Drawer Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment Hazards; Violates Mandatory Standard for Clothing Storage Units; Imported by Shenzhen Jinhongzhen Technology Co — This recall involves 17 Stories Furniture 18-Drawer Dressers. The recalled dressers were sold in black, brown and gray. They have a metal frame, wooden top and 18 collapsable fabric drawers. HI1382_13, HI1382_01 or HI1382_09 are printed on a label located the outer packaging of the product.",
      "timestamp": "2025-12-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "17 Stories Furniture 18-Drawer Dressers"
    },
    {
      "id": 10525,
      "text": "Amp Fit Recalls AMP Smart Fitness Machines Due to Laceration and Serious Injury Hazard — This recall involves the MP2 model of the AMP Smart Fitness Machine, a wall-mounted strength-training device. It provides full-body, resistance-based workouts utilizing an adjustable arm and integrates with Amp Fit digital app platform for personalized fitness training.",
      "timestamp": "2025-12-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "AMP MP2 Smart Fitness Machine"
    },
    {
      "id": 10536,
      "text": "ANNQUAN Brand Power Strips Recalled Due to Risk of Serious Injury or Death from Fire; Sold on Amazon by Hefei Juyuan Sporting Development — This recall involves ANNQUAN-branded power strips models EX-D112-05 and EX-D106-25. Power strip model EX-D112-05 has a black metal enclosure with 12 receptacles made of yellow plastic. There is one on/off switch located at the end of the housing closest to the power cord. Power strip model EX-D106-25 has a yellow metal enclosure with six receptacles made of black plastic and individual on/off switches for each receptacle. The model numbers are found on the order invoice.",
      "timestamp": "2025-12-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "ANNQUAN Power Strips, Models EX-D112-05 and EX-D106-25"
    },
    {
      "id": 10538,
      "text": "Blue Wave Recalls Above-Ground Pools 48 Inches and Taller Due to Drowning Hazard — This recall involves all Blue Wave brand above-ground pools 48 inches and taller. Model information is printed on the original box and on the instruction manual and the Blue Wave logo is printed on the liner on the outside of the pool. Blue Wave pool models subject to this recall include: Model Description UPC Code NB19790 Blue Wave 15-Ft Rd 48-In Active Frame Pool 672875005895 NB19791 Blue Wave 18-Ft Rd 52-In Active Frame Pool 672875005925 NB19797 Blue Wave 18-Ft Rd 52-In Dark Cocoa Wicker Frame Pool 672875006106 NB19798 Blue Wave 24-Ft Rd 52-In Dark Cocoa Wicker Frame Pool 672875006137 NB19890 Blue Wave Rustic Cedar 15-Ft Round 48-In Deep Frame Swimming Pool Package W/Cover 672875004874 NB19891 Blue Wave Rustic Cedar 18-Ft Round 52-In Deep Frame Swimming Pool Package W/Cover 672875004881 NB19900 Blue Wave 18-Ft Round 52-In Gray Rattan Swimming Pool Package W/Cover 672875009565 NB19902 Blue Wave 18-Ft Round 52-In Espresso Wicker Swimming Pool Package W/Cover 672875009589 NB19904 Blue Wave 15-Ft Round 48-In Navy Blue Frame Swimming Pool Package W/Cover 672875009916 NB19905 Blue Wave 18-Ft Round 52-In Navy Blue Frame Swimming Pool Package W/Cover 672875009923 NB19906 Blue Wave 15-Ft Round 48-In Aspen Swimming Pool Package W/Cover 672875009930 NB19907 Blue Wave Mocha Wicker 18-Ft Round 52-In Deep Swimming Pool Package With Cover 672875009954 NB19908 Blue Wave Mocha Wicker 24-Ft Round 52-In Deep Swimming Pool Package With Cover 672875009961 NB19909 Blue Wave Laguna 15-Ft Round 48-In Deep Swimming Pool Package With Cover 672875009978 NB19910 Blue Wave Laguna 18-Ft Round 52-In Deep Swimming Pool Package With Cover 672875009985 The recalled above-ground pools contain a compression strap (also referred to as a reinforcing belt) that wraps around the pool on the outside of the vertical support poles, and may create a foothold, allowing a child to access the pool and drown. Children can still gain access to the pools using these footholds even if the ladder is removed. CPSC's website www.PoolSafely.gov has free, downloadable educational materials available to the public on pool safety including information on barriers, covers, alarms and other safety information.",
      "timestamp": "2025-12-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Blue Wave brand 48-inch and taller above-ground pools"
    },
    {
      "id": 10530,
      "text": "Currey & Company Recalls Electra Chandeliers Due to Impact Injury Hazard — This recall involves all Currey & Company Electra Chandelier and Electra Three Tier Chandelier light fixtures. The fixtures are made of glass and iron with a brass metal frame. The Electra Chandelier, model number 9000-1234, measures 18 inches by 29 inches and weighs 51 pounds. The Electra Three Tier Chandelier, model number 9000-1235, measures 47 inches by 29 inches and weighs 131 pounds. \"Currey & Company\" and the model number are printed on the fixture's ceiling canopy.",
      "timestamp": "2025-12-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Electra Chandelier and Electra Three Tier Chandelier light fixtures"
    },
    {
      "id": 10533,
      "text": "Feel The Beard Recalls Minoxidil Beard Growth Serum Bottles Due to Risk of Serious Injury or Death from Child Poisoning; Violates Mandatory Standard for Child-Resistant Packaging — This recall involves Feel The Beard-branded Beard Growth Oil bottles. The beard growth oil comes in a one-ounce dark amber bottle with a black dropper cap. The label wrapped around the beard growth oil and the outer packaging read \"Beard Growth Oil,\" \"Feel The Beard,\" and \"5% minoxidil with biotin.\"",
      "timestamp": "2025-12-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Feel The Beard Minoxidil Beard Growth Oil for Men"
    },
    {
      "id": 10528,
      "text": "Furnulem 8-Drawer Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment; Violate Mandatory Standard for Clothing Storage Units; Sold on Amazon by Furnulem — This recall involves Furnulem 8-Drawer Dressers. The dressers were sold in black, brown and white and measure about 13.8 inches long by 45 inches wide by 29.7 inches tall. They have a metal frame, a wooden top with recessed power outlets and eight collapsible fabric drawers. Model \"DS-0148D003\" is printed on the packaging.",
      "timestamp": "2025-12-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Furnulem 8-Drawer Dressers"
    },
    {
      "id": 10535,
      "text": "JOKOSIS Adult Portable Bed Rails Recalled Due to Risk of Serious Injury or Death from Entrapment and Asphyxiation Hazards; Violates Mandatory Standard for Adult Portable Bed Rails; Sold on Amazon by JOKOSIS — This recall involves JOKOSIS Bed Rail, model HC0262. The bed rails are black and include a zippered storage pouch. The product measures 31.5 inches tall by 40.6 inches wide. The bed rail has model \"HC0262\" printed on the packaging.",
      "timestamp": "2025-12-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "JOKOSIS Portable Bed Rails"
    },
    {
      "id": 10534,
      "text": "KKL Fabric 9-Drawer Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment Hazards; Violate Mandatory Standard for Clothing Storage Units; Sold on Amazon by HK Brilliant — This recall involves KKL Fabric 9-Drawer Dressers. The recalled dressers were sold in black, brown and white. They have a metal frame, wooden top with recessed power outlets, and nine collapsable fabric drawers. The dressers are 37.8 inches long by 11.8 inches wide by 53.9 inches tall.",
      "timestamp": "2025-12-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "KKL Fabric 9-Drawer Dressers"
    },
    {
      "id": 10539,
      "text": "Meaicezli Play Purse Sets Recalled Due to Risk of Serious Injury or Death from Battery Ingestion; Violates Mandatory Standard for Toys; Sold on Amazon by Angeer-US — This recall involves Meaicezli Play Purse Sets. The Play Purse Sets come in pink and contain a bag with toy sunglasses, toy camera, toy money, toy make up kit, toy lipstick, wallet, hair bow, eye mask, toy passport, plastic toy credit cards, toy cell phone, and toy writing tablet. Both the toy phone and toy writing tablet come with a button or coin cell battery installed.",
      "timestamp": "2025-12-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Meaicezli Play Purse Sets"
    },
    {
      "id": 10526,
      "text": "Pacific Cycle Recalls Schwinn Ovation Bicycle Child Carriers Due to Fall Hazard — This recall involves the Schwinn Ovation Bicycle Child Carrier, Model SW80356. The product is black with a gray seat cushion, black harness straps, and red buckles. It attaches to a rear bike rack that was sold with the carrier. The impacted date codes are 712A0329BE and 712A0421BE. The model number and date code are located on the underside of the carrier.",
      "timestamp": "2025-12-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Schwinn Ovation Bicycle Child Carriers"
    },
    {
      "id": 10527,
      "text": "Pedego Electric Bikes Recalls Fat Tire Trikes Due to Fall and Laceration Hazards — This recall involves the Fat Tire Trike, an aluminum adult three-wheeled electric tricycle. It has a rectangular label on the downtube near the front of the frame with the word \"Pedego\" printed on it. The product was sold in matte black.",
      "timestamp": "2025-12-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Fat Tire Trikes"
    },
    {
      "id": 10532,
      "text": "Plantimex Recalls Mamisan Lidocaine Ointment Containers Due to Risk of Serious Injury or Death from Child Poisoning; Violates Mandatory Standard for Child-Resistant Packaging — This recall involves Mamisan Pain Relieving Topical Ointment jars. The ointment comes in an orange container with a white continuous thread lid and has the Mamisan trademark printed on top of the lid and on the label. The ointment was sold in a 3.52 ounce plastic jar. The wraparound label includes instructions and drug facts. Only jars with UPC code 860006498115 are included in the recall.",
      "timestamp": "2025-12-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Mamisan Pain Relieving Topical Ointment"
    },
    {
      "id": 10537,
      "text": "SereneLife Home Recalls Above-Ground Pools 48 Inches and Taller Due to Drowning Hazard — This recall involves all SereneLife brand above-ground pools 48 inches and taller. Models SLPORND15 and SLPORND18 are included in this recall. Model information and the SereneLife logo are printed on the liner on the outside of the pool. The recalled above-ground pools contain a compression strap (also referred to as a reinforcing belt) that wraps around the pool on the outside of the vertical support poles, and may create a foothold, allowing a child to access the pool and drown. Children can still gain access to the pools using these footholds even if the ladder is removed. CPSC's website www.PoolSafely.gov has free, downloadable educational materials available to the public on pool safety including information on barriers, covers, alarms and other safety information.",
      "timestamp": "2025-12-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "SereneLife brand 48-inch and taller above-ground pools"
    },
    {
      "id": 10529,
      "text": "TopHomer Pool Drain Covers Recalled Due to Risk of Serious Injury or Death from Entrapment and Drowning Hazards; Violation of the Virginia Graeme Baker Pool and Spa Safety Act; Sold on Amazon by TopHomerUS — This recall involves TopHomer-branded 8-inch pool drain covers that are sold for use in swimming pools. The top grate is 7.2 inches in diameter, and the bottom mounting plate is 8 inches in diameter. They are white and made of ABS plastic. \"Listed suction fitting,\" \"SP-1053-B,\" and \"88D9 148 GPM\" are printed on the center of the grate. \"Use screws to keep grate secured to dram (drain) at all times\" is printed on the outer ring of the grate.",
      "timestamp": "2025-12-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "TopHomer Pool Drain Covers"
    }
  ]
}