{
  "source": "cpsc",
  "topic_id": "portable-anxiety-relief",
  "fetched_at": "2025-11-30T10:25:27.956Z",
  "items": [
    {
      "id": 10498,
      "text": "Alinux Baby Loungers Recalled Due to Risk of Serious Injury or Death from Entrapment and Fall Hazards; Violates Mandatory Standard for Infant Sleep Products; Sold on Amazon by Winkids — This recall involves Alinux baby loungers. The recalled baby loungers are made of a foam sleeping pad and padded bumpers with a cloth cover and a ribbon tie at one end. They were sold in the following colors: pink, grey and purple. Model number \"BP25001\" and batch number \"ZZ-FBA25052305-1\" are printed on an attached label on the outside of the baby lounger's cover.",
      "timestamp": "2025-11-26T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Alinux Baby Loungers"
    },
    {
      "id": 10504,
      "text": "Convertible High Chairs Recalled Due to Risk of Serious Injury or Death from Fall and Entrapment Hazards; Violate Mandatory Standard for High Chairs; Sold on Amazon by Rotinyard — This recall involves baby high chairs sold in beige or pink with a matching removable seat cushion, detachable tray, and footrest. The high chairs convert into an infant swing and are reclinable and collapsible. \"Product No.: HA-028\" is printed on a tracking label on the seatback.",
      "timestamp": "2025-11-26T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Baby High Chairs (convertible)"
    },
    {
      "id": 10496,
      "text": "Ebern Designs Ojaswi 12-Drawer Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment; Violates Mandatory Standard for Clothing Storage Units; Manufactured and Sold by Ebern Designs — This recall involves Ebern Designs Ojaswi 12-Drawer Dressers. The recalled dressers were sold in gray and white. They have a metal frame, wooden top, and 12 collapsable fabric drawers. The dressers measure about 39 inches by 43 inches by 12 inches and weigh about 31.7 pounds. \"HD011BL-SL\" or \"HD011WH-SL\" is printed on the product packaging.",
      "timestamp": "2025-11-26T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Ebern Designs Ojaswi 12-Drawer Dressers"
    },
    {
      "id": 10500,
      "text": "Ikuso Safety Gates Recalled Due to Risk of Serious Injury or Death to Children from Entrapment; Violates Mandatory Standard for Gates and Enclosures; Sold on Amazon by Ikuso — This recall involves Ikuso-branded safety pressure-mounted safety gates. The white steel safety gates were sold in two adjustable size ranges: between 30 inches and 48 inches (model Door-Gen1-123) and between 30 inches and 63 inches (model Door-Gen1-159). \"Ikuso\" is printed on the latch on the top of the gates, and the model numbers are on labels located on the side-post under the latch of the gate.",
      "timestamp": "2025-11-26T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Ikuso Safety Gates"
    },
    {
      "id": 10497,
      "text": "KingPavonini Adult Portable Bed Rails Recalled Due to Risk of Serious Injury or Death from Entrapment and Asphyxiation; Violate Mandatory Standard for Adult Portable Bed Rails; Sold on Amazon by KingPavonini — This recall involves six KingPavonini-branded adult portable bed rails with model numbers: BC-CBJ-X, BC-CBJ, BC-LDFS-X, LDFS-SSK, 04-BC-LDFS, BC-LDFS. The model numbers can be found in the owner's manual. The recalled bed rails have white or black tubing with rounded black foam rubber handle grips with a black fabric pouch. Some models have support legs and motion-sensor lights. The recalled bed rails have \"KingPavonini\" written on the fabric cover. Model Description Size BC-CBJ-X White tubing with rounded black foam rubber handle grips and black fabric pouch About 32 inches wide and 21 inches in height BC-CBJ White tubing with rounded black foam rubber handle grips and black fabric pouch About 35 inches wide and 21 inches in height BC-LDFS-X White tubing with rounded black foam rubber handle grips, black fabric pouch, and support legs About 36 inches wide and 41 inches in height LDFS-SSK Black tubing with rounded black foam rubber handle grips, black fabric pouch, and support legs 04-BC-LDFS White tubing with rounded black foam rubber handle grips, black fabric pouch, and support legs BC-LDFS White tubing with rounded black foam rubber handle grips, black fabric pouch with motion light, and support legs About 45 inches wide and 44 inches in height",
      "timestamp": "2025-11-26T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "KingPavonini Adult Portable Bed Rails"
    },
    {
      "id": 10499,
      "text": "Macardac Baby Loungers Recalled Due to Risk of Serious Injury or Death from Entrapment and Fall Hazards; Violates Mandatory Standard for Infant Sleep Products; Sold on Amazon by Macardac Products — This recall involves Macardac baby loungers. The recalled baby loungers are made of a foam sleeping pad and padded bumpers with a cloth cover and have a buckle at one end. They were sold in the following colors and prints: blue, brown, brown leaves and pink flower. \"Macardac\" is printed on an attached tag on the outside of the baby lounger's cover.",
      "timestamp": "2025-11-26T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Macardac Baby Loungers"
    },
    {
      "id": 10506,
      "text": "McLee Creations Recalls MyOnlyStyler Root Booster Hair Dryers Due to Risk of Serious Injury or Death from Electrocution and Shock Hazards — This recall involves MyOnlyStyler Root Booster Hair Dryers. The hair dryer was sold in white with black bristles and has \"MY ONLY STYLER\" printed on the handle. Model number \"MOS-22\" is printed on the back of the handle. The hair dryer measures 12 inches long by 1.75 inches wide.",
      "timestamp": "2025-11-26T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "MyOnlyStyler Root Booster Hair Dryers"
    },
    {
      "id": 10505,
      "text": "Outdoor Master Children's and Youth Helmets Recalled Due to Risk of Serious Injury or Death from Head Injury; Violates Mandatory Standard for Bicycle Helmets; Sold and Imported by Outdoor Master — This recall involves two models of Outdoor Master-branded children's and youth bicycle/multi-purpose helmets. Helmet model OM-TD BIKE is blue with a dinosaur print, has black padding, black straps, a black buckle and a black plastic knob at the back of the helmet for adjusting the fitting; and was sold in children's size small (S), fitting a head circumference from 48 to 52 cm (18.9 to 20.5 inches). \"OM-TD BIKE\" and \"05/2024\" (the manufacture date) is printed on a label inside the helmet, and the brand is printed on the back of the helmet. Helmet model OM-KSKB is deep green with black padding, yellow straps, a black buckle and a black plastic knob at the back of the helmet for adjusting the fitting; and was sold in youth size small (S), fitting a head circumference from 46 to 52 cm (18.1 to 20.5 inches). \"OM-KSKB\" and \"11/2022\" (the manufacture date) is printed on a label inside the helmet and the brand is printed on the front and back of the helmet.",
      "timestamp": "2025-11-26T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Outdoor Master Children's and Youth Helmets"
    },
    {
      "id": 10503,
      "text": "Ozark Trail Tabletop 1-Burner Butane Camping Stoves Recalled Due to Serious Burn and Fire Hazards; Imported and Sold by Walmart; Manufactured by China Window Industry Co. — This recall involves Ozark Trail Tabletop 1-Burner Butane Camping Stoves with model number BG2247A1. The model number is printed on a gray label on the inside of the fuel compartment. The camping stoves are dark green with an orange \"Ozark Trail\" logo printed on the front.",
      "timestamp": "2025-11-26T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Ozark Trail Tabletop 1-Burner Butane Camping Stoves"
    },
    {
      "id": 10502,
      "text": "Sofoliana and Glotika Baby Loungers Recalled Due to Risk of Serious Injury or Death from Entrapment and Fall Hazards; Violates Mandatory Standard for Infant Sleep Products; Sold on Amazon by Bosen US — This recall involves Sofoliana and Glotika baby loungers. The recalled baby loungers are rectangular in shape and are made of a foam sleeping pad and padded bumpers with a cloth cover. The Sofoliana baby loungers are dark gray with a ribbon tie at the bottom of the lounger. The Glotika baby loungers zip up into a bag with an adjustable strap and came in the following colors: gray-rocket, pink-heart and white-elephant, with the printed design on the inside of the lounger. Neither baby loungers have any markings or labeling.",
      "timestamp": "2025-11-26T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Sofoliana and Glotika Baby Loungers"
    },
    {
      "id": 10501,
      "text": "Vivohome Adult Portable Bed Rails Recalled Due to Risk of Serious Injury or Death from Entrapment and Asphyxiation Hazards; Violates Mandatory Standard for Adult Portable Bed Rails; Imported by Vivohome — This recall involves Vivohome-branded adult portable bed rails sold for use on adult beds. The recalled bed rails measure about 36.6 inches long, 16.1 inches wide and 15.7 inches in height and have four metallic stand bars with padding, a wooden (model VH1316-WC) or metallic (model VH1316-WH) top bar with a red release button that collapses the bed rail. The model number is printed on the product packaging and the product registration card.",
      "timestamp": "2025-11-26T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Vivohome Adult Portable Bed Rails"
    },
    {
      "id": 10487,
      "text": "AliExpress Recalls Convertible Strollers Due to Risk of Serious Injury or Death from Fall Hazard; Violates Mandatory Standard for Strollers — This recall involves a stroller that converts into a hand-held infant carrier. The product was sold in pink, light pink, blue, dark blue, green, red, teal, gray and black and comes with a gray or black infant insert. The two larger wheels feature yellow accents. There are no markings on the product.",
      "timestamp": "2025-11-20T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "4-in-1 Baby Safety Cart Carriage"
    },
    {
      "id": 10488,
      "text": "Bearlala Baby Loungers Recalled Due to Risk of Serious Injury or Death from Entrapment and Fall Hazards; Violates Mandatory Standard for Infant Sleep Products; Sold on Walmart.com by Nuoxuann — This recall involves Bearlala baby loungers, advertised under the brand \"Granlass.\" The recalled baby loungers are made of a foam sleeping pad and padded bumpers with a cloth cover. The cloth covers are light gray with a leaf pattern. \"Bearlala\" is printed on a label stitched to the outside of the baby lounger's cover.",
      "timestamp": "2025-11-20T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Bearlala Baby Loungers"
    },
    {
      "id": 10492,
      "text": "Demlar Recalls MoonSoll and Magic Chems Fuel Bottles Due to Risk of Serious Injury or Death from Flash Fire; Violates Mandatory Standard for Portable Fuel Containers and FHSA Labeling Requirements; Imported by Demlar Online Store — This recall involves Demlar's bottles of MoonSoll-branded ethanol and Magic Chems-branded bioethanol fuel, used for tabletop fire pits, fireplaces, stoves and burners. The clear fuel bottles have a red or green cap. They were sold individually or as a pack of three and in 500mL and 1000mL capacities. The brand name and capacity are printed on the front of the bottle's label.",
      "timestamp": "2025-11-20T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "MoonSoll and Magic Chems Fuel Bottles"
    },
    {
      "id": 10489,
      "text": "Little Partners Recalls Children's Grow 'N Stow Folding Learning Towers Due to Fall Hazard — This recall involves children's Grow 'N Stow Folding Learning Tower with model number LP01711 and date codes, in YYYYMM format, from 202409 to 202501. The model number and date code are located on a label on the underside of the platform. The product is made of wood with a natural finish. \"Learning Tower\" is printed on the top rail of the tower.",
      "timestamp": "2025-11-20T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Grow 'N Stow Folding Learning Tower"
    },
    {
      "id": 10494,
      "text": "Magnet Fidget Spinner Sets Recalled Due to Risk of Serious Injury or Death from Magnet Ingestion; Violates Mandatory Standard for Toys; Sold on Amazon by Anzmtosn — This recall involves Anzmtosn Magnet Fidget Spinner Sets. Each set contains 15 pieces and comes with four iridescent oval-shaped magnets, eight iridescent cuboidal-shaped magnetic stones, one red and yellow disk-shaped metal fidget spinner, one winged metal fidget spinner, and one multicolored infinity fidget cube. The set comes with a black fabric-lined storage case. The batch number, CCA06582, is printed on the back label of the packaging.",
      "timestamp": "2025-11-20T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Anzmtosn Magnet Fidget Spinner Sets"
    },
    {
      "id": 10491,
      "text": "Mallimoda Children's Pajama Sets Recalled Due to Risk of Serious Injury or Death from Burn Hazard; Violates Mandatory Standards for Children's Sleepwear; Sold on Amazon by Mallimoda — This recall involves Mallimoda-branded children's pajama sets. The recalled pajama sets consist of a long-sleeved, button-up shirt with a front pocket and matching pants. The pajamas are trimmed with black piping and have black buttons. The pajama sets were sold in gray/pink, blue, gray/purple, and light green in sizes 3/4T through 13/14 years. \"Cotton 100%\" and care instructions are printed on the sewn-in side-seam label.",
      "timestamp": "2025-11-20T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Mallimoda Children's Pajama Sets"
    },
    {
      "id": 10490,
      "text": "Play Yards Recalled Due to Risk of Serious Injury or Death from Suffocation and Entrapment Hazards; Violate Mandatory Standard for Play Yards; Sold on Amazon by Anna Queen — This recall involves play yards that have black fabric sides and mesh panels bordered in gray. The top rails are covered with white fabric with a multi-colored print with bear faces, paws and the word \"bear\". The play yards include a mattress with the same bear print. \"Model: P700\" and \"Production Date: 202503\" are printed on the packaging and on a removeable tag included with the play yard.",
      "timestamp": "2025-11-20T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Play Yards"
    },
    {
      "id": 10495,
      "text": "Romorgniz Fabric 12- and 13-Drawer Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment; Violates Mandatory Standard for Clothing Storage Units; Sold on Amazon by Romorgniz — This recall involves Romorgniz Fabric 12- and 13-Drawer Dressers. The dressers come in rustic brown, black, pink and white and have a metal frame and wooden top. The 12-drawer dresser has 12 collapsable fabric drawers, and the 13-drawer dresser has 13 collapsable fabric drawers. The 12-drawer dressers measure about 52 inches by 12 inches by 35 inches. The 13-drawer dressers measure about 35 inches by 11 inches by 55 inches. The 12-drawer dressers have \"Model No.: R99MWM12CHMW\" printed on the back and the 13-drawer dressers have \"Model No.: R99M9C4CLHW\" printed on the back.",
      "timestamp": "2025-11-20T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Romorgniz Fabric 12- and 13-Drawer Dressers"
    },
    {
      "id": 10493,
      "text": "Spartan Mowers and UTVs Recalls Riding Mowers Due to Crash Hazard — This recall involves certain Model Year 2025 Spartan SRT-XD and KGZ-XD zero radius turn (\"ZRT\") riding lawn mowers (model numbers RSKXD161994VO, RSKXD172994VO, RSSXD161994VO, RSSXD161999KE, RSSXD172994VO and RSSXD172999KE) within a limited serial range. The mower is gray, black and orange, and has \"Spartan\" printed on the front of it. The model number and serial number are located on a metal serial plate affixed to the frame of the mower immediately in front of, and at the feet of, the seated operator.",
      "timestamp": "2025-11-20T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Model Year 2025 Spartan SRT-XD and KGZ-XD riding lawn mowers"
    },
    {
      "id": 10484,
      "text": "Belkin Recalls Portable Power Banks and Wireless Charging Stands Due to Fire and Burn Hazards — This recall involves charging stands with model number MMA008 and power banks with model numbers BPB002 and PB0003. Model number \"MMA008\" is printed on the bottom of the charging stand. Serial numbers (14 digits) starting with \"57X\" are included in this recall and are also printed on the bottom of the charging stand. Model number \"BPB002\" is printed on the back top of the power bank. Serial numbers (14 digits) starting with \"35S\" are included in this recall and are also printed on the back of the power bank. Model number \"PB0003\" is printed on the back of the power bank. All serial numbers are included in this recall. Both the charging stands and BPB002 power banks were sold in black. The PB0003 power banks were sold in black or white.",
      "timestamp": "2025-11-13T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Portable Power Banks and Wireless Charging Stands"
    },
    {
      "id": 10480,
      "text": "Bettina Doll Sets Recalled Due to Risk of Serious Injury or Death from Battery Ingestion; Violates Mandatory Standard for Toys; Sold on Amazon by Shantou Chenghai Xingzigu Toy Industry — This recall involves Bettina Doll Set with Magic Light Unicorn. The Magic Light Unicorn is white with multi-colored hair and a pink saddle, and the doll has a pink dress. The unicorn is 10 inches long and 9.5 inches tall, and the doll is 12 inches tall. There is a pink toy hairbrush included with the set.",
      "timestamp": "2025-11-13T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Bettina Doll Set with Magic Light Unicorn"
    },
    {
      "id": 10483,
      "text": "Great Lakes Wholesale International Recalls Select Battery Packs Due to Battery Ingestion; Violates Federal Statute for Child-Resistant Packaging of Button Cell and Coin Batteries — This recall involves Great Lakes Select Battery Packs, each of which displays the name \"Great Lakes Select\" on the back of the packaging, and the item number on the front of the packaging Item Number Description Battery Type Item Price Range 263 Pack of six (6) CR2032 $0.65 to $1.10 264 Pack of nine (9) CR2016/ CR2032/ CR2025 $1.10 to $1.50 265 Pack of nine (9) CR2032 $0.89 to $1.50 271 Pack of thirty (30) Mixed $0.96 to $1.50 272 Pack of forty (40) Mixed Super Alkaline $1.65 to $2.25 276 Pack of twenty-four (24) LR44/357 Super Alkaline $1.10 to $1.50",
      "timestamp": "2025-11-13T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Great Lakes Select Button Cell and Coin Batteries"
    },
    {
      "id": 10486,
      "text": "Tesla Recalls Powerwall 2 AC Battery Power Systems Due to Fire and Burn Hazards; Risk of Serious Injury or Death — This recall involves certain Tesla Powerwall 2 units, fully-integrated AC battery systems used for energy storage for self-consumption, time-based control, and backup power. Model number \"Powerwall 2\" is printed on the nameplate label on the side of the unit.",
      "timestamp": "2025-11-13T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Certain Tesla Powerwall 2 AC Battery Power System"
    },
    {
      "id": 10482,
      "text": "Trek Recalls Bicycles with Coaster Brakes and Replacement Rear Wheels Due to Crash Hazard — This recall involves certain Trek and Electra-branded bicycle models with coaster brakes and replacement rear wheels. The bikes were sold in a variety of colors, including red, flamingo pink, dark aquatic, Mulsanne blue, volt yellow, pink frosting, Miami green, lithium gray, viper red, purple abyss, buttercup, pixie blue and blue. To determine if your bicycle or replacement rear wheel is included in this recall, enter your bicycle's serial number in the look-up tool at https://www.trekbikes.com/us/en_US/coasterbrake-recall-inquiry/. The serial number is printed under the bottom bracket between the pedals and starts with the letters, \"WTU.\" Recalled Trek and Electra-Branded Bicycles and Replacement Wheels: Brand Name Model Name Model Year Electra Townie Rental 1 Step Thru 2026 Trek Precaliber 12 2026 Trek Precaliber 16 2024 and 2026 Trek Precaliber 20 2024 and 2026 Electra Sprocket 1 16 2026 Trek Precaliber 12 CB replacement wheel 2026 Trek Precaliber 16 CB replacement wheel 2026 Trek Precaliber 20 CB replacement wheel 2026",
      "timestamp": "2025-11-13T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Trek and Electra-branded Bicycles with Coaster Brakes and Replacement Rear Wheels with Coaster Brakes"
    },
    {
      "id": 10485,
      "text": "Zigjoy Sleep Sacks with Feet Recalled Due to Risk of Serious Injury or Death from Burn Hazard; Violates Mandatory Standard for Children's Sleepwear; Sold by Zigjoy-US — This recall involves Zigjoy-branded children's one-piece sleep sacks with feet, in blue with an excavator print or pink with a bunny print. The sleep sacks were sold in sizes S, M, and L. \"100% cotton\" and the garment size are printed on a sewn-in side seam label.",
      "timestamp": "2025-11-13T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Zigjoy Toddler Sleep Sacks with Feet"
    },
    {
      "id": 10481,
      "text": "Zippee Silicone Activity Toys Recalled Due to Risk of Serious Injury or Death from Choking; Violates Mandatory Standard for Toys; Imported by Mobi Games — This recall involves the Zippee children's activity silicone toy. The body of the toy is a teal flexible silicone cylinder with holes where six different color silicone strings can be pulled. Five of the six silicone strings contain a spherical ball attached to the end of the string. The recalled toy may have the date codes in MMDDYY format ranging from 030620 to 110823 marked inside the toy's silicone cylinder body.",
      "timestamp": "2025-11-13T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Zippee Activity Toys"
    },
    {
      "id": 10476,
      "text": "Adult Portable Bed Rails Recalled Due to Risk of Serious Injury or Death from Entrapment and Asphyxiation; Violate Mandatory Standard for Adult Portable Bed R Adult Portable Bed Rails Recalled Due to Risk of Serious Injury or Death from ails; Sold on Amazon by Neaude — This recall involves Neaude-branded adult portable bed rails model BR0221SL001, sold for use on adult beds. The recalled bed rails were sold in a silver top rail with silver support columns, blue accents, red handle button and a faux wood top rail with silver support columns in a wave design, white accents and a red handle button. The bed rails measure about 37 inches wide and about 14 inches high and can fold or unfold by pressing the red handle button.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Neaude Adult Portable Bed Rails"
    },
    {
      "id": 10478,
      "text": "Astemrey Recalls Y'all Can DIY Liquid Bioethanol Fireplace Fuel Containers Due to Risk of Serious Injury or Death from Flash Fire; Violates Mandatory Standard for Portable Fuel Containers — This recall involves Y'all Can DIY bioethanol fireplace liquid fuel containers. The fireplace fuel comes in a clear bottle with a black top and a white and black label with orange and white lettering. The fireplace fuels have the brand name and product name in white and orange along with \"No Soot\", \"No Ash\", and \"Clean Burning\" printed on a label on the front and hazard warnings printed on the side.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Y'all Can DIY Liquid Bioethanol Fireplace Fuel Containers"
    },
    {
      "id": 10468,
      "text": "F&F Fine Wines Recalls Kirkland Signature Valdobbiadene Prosecco DOCG Bottles sold by Costco Due to Laceration Hazard — This recall involves certain glass bottles of Kirkland Signature Valdobbiadene Prosecco DOCG. The UPC is 196633883742 and the Costco Item Number is 1879870. The product was sold in a green bottle with purple foil on the top and a purple label with the words \"Kirkland Signature Valdobbiadene Prosecco Superiore DOCG\".",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Kirkland Signature Valdobbiadene Prosecco DOCG bottles"
    },
    {
      "id": 10469,
      "text": "F&F Fine Wines Recalls Kirkland Signature Valdobbiadene Prosecco Entrapment or Suffocation; Violates Mandatory Standards for Mattresses; Sold on Amazon by Mengna Criblike Mattresses Recalled Due to Risk of Serious Injury or Death from Entrapment — This recall involves Criblike aftermarket play yard and non-full sized crib mattresses. The Criblike Pack and Play mattresses, models XCD-001 and XCD-002, come in white and are approximately 38 inches by 26 inches. The Criblike Mini-crib mattresses, model MNCL-001, come in white and are approximately 38 inches by 24 inches. \"Criblike\" and the model number are printed on labels located on the end of the product.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Criblike aftermarket play yard and non-full sized crib mattresses"
    },
    {
      "id": 10475,
      "text": "Inkari Plush Alpaca Toys Recalled Due to Risk of Serious Injury or Death from Choking Hazard; Violate Small Parts Ban; Imported by Inkari — This recall involves five collections of Inkari's plush alpaca toys: naturals, baristas, rainbow, monsterfluffs, and limited edition. The recalled wool stuffed toys were sold in white, ivory, light brown, dark brown, black, pink, purple, light blue, and mixed colors, and in four different sizes: mini (about 6 inches tall), small (about 9 inches tall), medium (about 12 inches tall) and large (about 19 inches tall). \"INKARI\" is printed on a label attached to the underside of the toy.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Inkari Plush Alpaca Toys"
    },
    {
      "id": 10477,
      "text": "Lezyne USA Recalls Bicycle Floor Pumps Due to Serious Injury Hazard — This recall involves two models of Lezyne bicycle floor pumps; the Pressure Over Drive (with analog gauge) and the Digital Pressure Over Drive (with digital gauge). The black tubeless floor pumps are made of steel and aluminum with a natural wood-colored handle and have a nylon-reinforced braided hose. The Lezyne logo is printed on the pump's side. Only floor pumps with a bleed valve on the front of the base are included in this recall.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Lezyne Pressure Over Drive Bicycle Floor Pumps"
    },
    {
      "id": 10471,
      "text": "Napei Infant Bath Tubs Recalled Due to Risk of Serious Injury or Death from Ingestion Hazard; Violates Mandatory Standard for Consumer Products with Button Cell Batteries; Sold on Amazon by Sefon Store — This recall involves Napei collapsible infant bath tubs made of plastic with two detachable legs. The infant bath tubs were sold in a white/gray color combination, with a removable star print cushion insert, a built-in thermometer, and a blue rubber star-shaped drain plug. \"Model No: Baby Bathtub - 0823\" can be found on a label on the bottom of the bath tub.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Napei Collapsible Infant Bath Tubs"
    },
    {
      "id": 10467,
      "text": "Peloton Recalls Original Series Bike+ Exercise Bikes Due to Fall and Injury Hazards — This recall involves Peloton Original Series Bike+ units, with model number PL02 and serial numbers beginning with the letter \"T\". The bike measures 4 ft. long by 2 ft. wide and has an adjustable seat and handlebar. The bike's serial number is located inside the front fork, behind the front fork, or behind the flywheel. Additional information to help locate your Bike+ serial number is available at https://www.onepeloton.com/history-summary.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Peloton Original Series Bike+ Model PL02"
    },
    {
      "id": 10474,
      "text": "Sanven Technology Recalls Vevor Baby Swings Due to Risk of Serious Injury from Suffocation Hazard; Violates Mandatory Standard for Infant Sleep Products and Inclined Sleepers Ban — This recall involves Vevor Baby Swings. The recalled swings are white/gray and black/gray and the base structure includes the \"VEVOR\" trademark. The swings are labeled on the bottom or the back of the base with \"Multi-Function Electric Swing\" and the model number. The white/gray swings with a white base have model number BB501K; the white/gray swings with the gray base have model number BB702A; and the black/gray swings with a black base have model number BB005.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Vevor Baby Swings"
    },
    {
      "id": 10472,
      "text": "STIHL Recalls BR 800 Backpack Blowers Due to Laceration Hazard — This recall involves the fan wheel of the STIHL BR 800 Magnum, models X and C-E, a backpack blower powered by a combustion engine. The backpack blower is gray and orange. \"STIHL,\" \"BR 800,\" and \"X\" or \"C-E\" are printed on the rear of the blower. The recalled blower's serial number is located on a label on the blower tube. Only backpack blowers with serial numbers ranging from 546515117 to 547916107 are included in the recall.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "STIHL BR 800 Backpack Blower"
    },
    {
      "id": 10470,
      "text": "Three-Wheeled Children's Scooters Recalled Due to Fall Hazard; Imported by Konges Sløjd — This recall involves a three-wheeled child's scooter with a foot brake. It is beige and has a T-shaped handle. The aluminum frame scooters were sold as two models. Model number KS101544-P00005 features a cherry print and model number KS101544-P00038 features a lemon print. Both models have batch number 062024, which can be found on the information sticker located on the bottom of the scooter.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Three-Wheeled Children's Scooter with Foot Brake"
    },
    {
      "id": 10473,
      "text": "Umeyda Nightgowns Recalled Due to Risk of Serious Injury or Death from Burns; Violate Mandatory Standards for Children's Sleepwear; Sold on Amazon by Umeyda Company — This recall involves Umeyda children's 100% cotton short-sleeve nightgowns. The nightgowns were sold in black, purple, mint green, baby pink, red, baby pink stripe, hot pink, dark pink, dark green and blue grey in children's sizes 4-5T, 5-6 years, 7-8 years, 9-10 years, 11-12 years, and 13-14 years. The recalled nightgowns have a pocket and buttons down the dress front. The batch number, \"Distributor: StreamBytes LLC\" and \"Made in Xing Tai He Bei China\" are printed on a sewn-in side-seam label.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Umeyda Nightgowns"
    },
    {
      "id": 10479,
      "text": "WYBITNY Bed Rails Recalled Due to Risk of Serious Injury or Death from Entrapment; Violates Mandatory Standard for Children's Portable Bed Rails; Sold on Amazon by WYBITNY — This recall involves WYBITNY-branded children's bed rails. The portable bed rails have a white metal frame and dark gray fabric cushions with foam filling. The brand and \"BGRT003\" are printed on a label located on the fabric cushions.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Children's WYBITNY Bed Rails"
    }
  ]
}