{
  "source": "cpsc",
  "topic_id": "hydration-bottles-problems",
  "fetched_at": "2025-10-14T22:23:50.465Z",
  "items": [
    {
      "id": 10427,
      "text": "Bellabu Bear Recalls Children's Robes Due to Burn Hazard; Violates Mandatory Standards for Children's Sleepwear — This recall involves Bellabu Bear's collection of bamboo sherpa children's robes. The recalled robes are long-sleeved and were sold in the following prints: PAW Patrol, Garfield, Minecraft, Minions, Batman, Justice League, Wonder Woman, Blaze and the Monster Machines, Trolls, Dora, Nutcracker, hearts, Santa, stripes, bows and dragons. The robes have sherpa lining, two front pockets and a matching belt and were sold in children's sizes S/M and M/L. \"Bellabu Bear,\" \"BB-NW12109\" and the size are printed on the robe's neck label.",
      "timestamp": "2025-10-09T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Bellabu Bear Children's Robes"
    },
    {
      "id": 10421,
      "text": "Calico Brands Recalls Scripto Premium Torches Due to Risk of Injury or Death from Fires and Burns; Violates Mandatory Standard for Multipurpose Lighters — This recall involves the Scripto® Premium Torch which has a four-position adjustable metal nozzle, adjustable flame, hands free operation lock, black ergonomic non-slip rubber grip, and a metal base with black velvet on the bottom. The UPC number \"0-70257-52226-6\" is printed on the back of the product box.",
      "timestamp": "2025-10-09T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Scripto® Premium Torch"
    },
    {
      "id": 10430,
      "text": "Children's LED Tutu Skirts Recalled Due to Risk of Serious Injury or Death from Battery Ingestion; Violates Mandatory Standard for Consumer Products with Coin Batteries; Sold on Amazon by Bmrwtg — This recall involves Bmrwtg LED Tutu Skirts. The recalled skirts were sold in pink, purple, yellow, red, blue, green, white and black, and have silver circles and stars that light up. The lights' battery compartment has two CR2032 lithium coin batteries. The skirts were marketed for children ages 2 through 8.",
      "timestamp": "2025-10-09T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Bmrwtg LED Tutu Skirts"
    },
    {
      "id": 10424,
      "text": "EcoFlow Technology Recalls Delta Max 2000 Power Stations Due to Risk of Serious Burn Injury and Fire Hazard — This recall involves EcoFlow Delta Max 2000 Model EFD310 Power Stations. The recalled power stations are black and silver, with a rectangular LCD display screen on the front and six electrical outlets on the back. \"ECOFLOW MAX\" is printed on the right side. \"EFD310\" and \"EcoFlow DELTA Max (2000)\" are printed on the nameplate on the underside of the product.",
      "timestamp": "2025-10-09T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "EcoFlow Delta Max 2000 Power Stations"
    },
    {
      "id": 10425,
      "text": "ESR HaloLock Wireless Power Banks Recall Expanded to Include Additional Model Due to Risk of Serious Burn Injury and Fire Hazard Due to Fire and Burn Hazards; Distributed by Waymeet — This recall expansion includes ESR HaloLock wireless power banks with model number 2G505, in addition to models 2G520, 2G505B and 2G512B, which were previously recalled. \"ESR\" is printed on the back and the model numbers are printed on the right side of the pocket-size power banks. Model 2G505 was sold in black and white. Models 2G520, 2G505B and 2G512B were sold in dark blue, light blue, gray, white and black. All recalled models have five circular LED display lights on one side.",
      "timestamp": "2025-10-09T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "ESR HaloLock Wireless Power Banks"
    },
    {
      "id": 10426,
      "text": "Generic Magnetic Ball Sets Recalled Due to Risk of Serious Injury or Death from Magnet Ingestion; Violates Mandatory Standard for Toys; Sold on Amazon by Ritons — This recall involves Generic magnetic ball sets. This recall involves sets of 1,000 multi-colored 3 mm (0.1 inch) magnetic balls that are separable and have a strong magnetic flux. The magnets are encased in clear, plastic packaging and have \"1000 Magnets\" and \"3MM\" printed on the front of the packaging.",
      "timestamp": "2025-10-09T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Generic Magnetic Balls 1000pcs"
    },
    {
      "id": 10423,
      "text": "Living Glow Portable Waist Fans Recalled Due to Fire Hazard; Manufactured by Guangzhou Jiguang Lighting; Sold by HSN — The recall includes the Living Glow five-in-one portable waist fan (model number CP-WFLED01). The model number is found on the label on the back of the fan. The recalled waist fan features five fan speeds, a three-mode flashlight and could be used as a power bank. The recalled fans were sold in gray, white, aqua, coral, red, and sage green. They feature a metal clip for attaching to a belt and a strap for wearing around the neck. The fans measure about 3.6 inches wide by 4 inches tall.",
      "timestamp": "2025-10-09T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Living Glow portable waist fan"
    },
    {
      "id": 10428,
      "text": "Mom Genius Recalls Retractable Safety Gates Due to Risk of Serious Injury or Death from Entrapment; Violates Mandatory Standard for Gates and Enclosures — This recall involves Mom Genius Retractable Safety Gates. The safety gate comes in black and gray and has a retractable mesh screen in between metal frames. The gates measure about 33 inches high, with a retractable width up to 118 inches. \"Retractable Safety Gate\" and model number \"SH.20.006B02\" are printed on a white label located on the side of the gate.",
      "timestamp": "2025-10-09T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Mom Genius Retractable Safety Gates"
    },
    {
      "id": 10422,
      "text": "Tempo USA Recalls Ambiano Electric Pressure Cookers Due to Serious Burn Hazard, Multiple Burn Injuries Reported; Sold at ALDI — This recall involves all Ambiano electric pressure cookers with model numbers 93550 (KY-318B), 96775 (KY-318A), and 98527 (6L-PC). The electric pressure cookers and inner cooker pots are either six-quart or eight-quart capacity. The brand name Ambiano appears on the front of each unit and on its permanent on-product label. The model number of the recalled pressure cookers is also printed on the permanent product label on the bottom of the cooker.",
      "timestamp": "2025-10-09T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Ambiano Electric Pressure Cookers"
    },
    {
      "id": 10429,
      "text": "YGJT Baby Loungers Recalled Due to Risk of Serious Injury or Death from Entrapment and Fall; Violates Mandatory Standard for Infant Sleep Products; Sold on SHEIN by YGJT Local Warehouse — This recall involves YGJT baby loungers. The recalled baby loungers are made of a foam sleeping pad and padded bumpers with a cloth cover. The baby loungers are white and light blue with rainbows and bears on the cover. \"YGJT\" is printed on an attached label on the outside of the baby lounger's cover.",
      "timestamp": "2025-10-09T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "YGJT Baby Loungers"
    },
    {
      "id": 10418,
      "text": "Blossom Recalls Children's Loungewear Due to Serious Risk of Injury or Death from Burns; Violates Mandatory Standard for Children's Sleepwear — This recall involves Blossom-branded children's two-piece loungewear sets. The recalled loungewear sets consist of a short-sleeved or long-sleeved, button-up shirt with a front pocket and matching shorts or pants. The short-sleeved sets were sold in white, navy, light blue, light pink and lilac; and in four designs: fireworks, multi-stripes, tulips, and sailboats. The long-sleeved sets come in two designs, letter to Santa and Santa paws. The loungewear sets were sold in children's sizes 12M through 12Y. \"Blossom\" and the size are printed on the sewn-in neck label.",
      "timestamp": "2025-10-02T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Blossom Children's Loungewear sets"
    },
    {
      "id": 10420,
      "text": "Dissolved Oxygen Test Kits Recalled Due to Risk of Serious Injury or Death from Poisoning to Young Children; Violates Mandatory Standard for Child-Resistant Packaging; Sold on Amazon by Almpal — This recall involves Almpal dissolved oxygen test kits. The test kits come in a cream-colored box bearing a white label with \"Dissolved Oxygen Test Kit\" and the manufacture date, batch number, and expiration date printed on it.",
      "timestamp": "2025-10-02T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Dissolved Oxygen Test Kits"
    },
    {
      "id": 10419,
      "text": "Gunaito 10-Drawer Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment Hazards; Violates Mandatory Standard for Clothing Storage Units; Sold on Walmart.com by Gunaito — This recall involves Gunaito 10-drawer dressers in brown and white. The recalled dressers have a metal frame, a wooden top, 10 collapsing fabric drawers of different sizes with pull knobs, and four side-pockets. The dressers measure about 39 inches by 39 inches by 12 inches and weigh about 30 pounds. \"HD006BN-SLCD\" or \"HD006WH-SLCD\" is printed on the product packaging.",
      "timestamp": "2025-10-02T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Gunaito 10-Drawer Dressers"
    },
    {
      "id": 10416,
      "text": "In Motion Design Recalls Evermore Surprise Eggs Due to Risk of Serious Injury; Violates Federal Lead Content Ban — This recall involves Evermore Surprise Eggs with yellow, pink or green wrap. The Surprise Eggs are gold and contain seven different toys including a toy airplane.",
      "timestamp": "2025-10-02T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Evermore Surprise Eggs"
    },
    {
      "id": 10417,
      "text": "Zyntony Recalls Kogalla Power Banks Due to Fire and Burn Hazards; Sold on Kogalla.com — This recall involves Kogalla-branded power banks, models BP125, BatPak 2F and BatPak 3F. The recalled rechargeable USB power banks have 6,700mAh, 13,400mAh or 20,100mAh lithium-ion batteries and were sold separately and included with Kogalla trail lights. The Kogalla logo is printed on the front of the power banks. The model number appears on the back of the power banks. Power banks model BP125 have a black USB-A jack and models BatPak 2F and 3F have orange USB-A jacks. Note: Do not throw this recalled lithium-ion battery or device in the trash, the general recycling stream (e.g., street-level or curbside recycling bins), or used battery recycling boxes found at various retail and home improvement stores. Recalled lithium-ion batteries must be disposed of differently than other batteries, because they present a greater risk of fire. Your municipal household hazardous waste (HHW) collection center may accept this recalled lithium-ion battery or device for disposal. Before taking your battery or device to a HHW collection center, contact them ahead of time and ask whether it accepts recalled lithium-ion batteries. If they don’t, contact your municipality for further guidance.",
      "timestamp": "2025-10-02T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "BP125, BatPak 2F and BatPak 3F Power Banks"
    },
    {
      "id": 10412,
      "text": "AMTRADING Recalls Hoovy Cooling Gel Insert Pads for Car Seats and Strollers Due to Burn Hazard — This recall involves black Cooling Gel Insert Pads for strollers or car seats and contain an inner cooling layer that is activated by a child's weight. The Hoovy logo appears in white on the bottom right corner of the product. The recalled cooling pads are approximately 16.5 inches long by 14.25 inches wide.",
      "timestamp": "2025-09-25T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Hoovy Cooling Gel Insert Pads for Car Seats and Strollers"
    },
    {
      "id": 10414,
      "text": "Autoez Brand Bamboo Shades Recalled Due to Strangulation and Entanglement Hazards and Risk of Serious Injury or Death; Violates Federal Rule for Window Coverings; Sold on Walmart.com — This recall involves Autoez-branded bamboo shades. The recalled bamboo shades were sold in brown, with sizes ranging from 24 to 72 inches wide and 64 to 72 inches high. \"Autoez\" is printed on the sticker label on the top rail of the shade.",
      "timestamp": "2025-09-25T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Autoez Bamboo Shades"
    },
    {
      "id": 10413,
      "text": "Mad Rabbit Recalls \"RELIEVE\" Lidocaine Numbing Cream Due to Risk of Serious Injury or Death from Poisoning to Young Children; Violates Mandatory Standard for Child-Resistant Packaging — This recall involves \"RELIEVE\" numbing cream. The cream comes in a short wide-mouthed white container. A label is located on the front with black lettering and \"RELIEVE\" in large type and the company's logo and \"Mad Rabbit\", \"Numbing Cream\" and \"Menthol\" in smaller type.",
      "timestamp": "2025-09-25T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "RELIEVE Numbing Cream"
    },
    {
      "id": 10415,
      "text": "Persilux Brand Zebra Blinds Recalled Due to Strangulation and Entanglement Hazards and Risk of Serious Injury or Death; Violates Federal Rule for Window Coverings; Sold on Amazon — This recall involves Persilux-branded zebra blinds. The recalled stock blinds were sold in beige, black, dark gray, light gray and white, with sizes ranging from 22 to 73 inches wide and 64 to 72 inches high. \"Persilux and \"Zebra Blinds\" is printed on the product packaging. \"X003FFPT63\" is printed on the barcode label.",
      "timestamp": "2025-09-25T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Persilux Zebra Blinds"
    },
    {
      "id": 10411,
      "text": "Sunbeam Products Recalls More than One Million Oster French Door Countertop Ovens Due to Burn Hazard — This recall involves Oster French Door Countertop Ovens with model numbers TSSTTVFDXL, TSSTTVFDDG, TSSTTVFDMAF and TSSTTVFDDAF. The recalled ovens have a spring-loaded bilateral door made of glass with metal handles. A label on the backside of the oven identifies the model number. In addition, the original packaging has information identifying the model number. The four models differ in cooking options (e.g., air fryer) and control types (analog dials or digital push-button controls). \"Oster\" is engraved on the front bottom right of the oven.",
      "timestamp": "2025-09-25T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Oster French Door Countertop Ovens"
    },
    {
      "id": 10406,
      "text": "Arizer Solo II Portable Vaporizers Recalled Due to Fire and Burn Hazards; Imported by 7111495 Canada — This recall involves the Arizer Solo II, a portable electronic vaporizer device powered by an internal lithium-ion battery. The unit features a rigid anodized aluminum housing and is available in Carbon Black and Mystic Blue finishes. It includes a front-facing digital display for temperature and device settings, with a stainless steel heating chamber and removable glass components. Only vaporizers with a serial number starting with \"M2\" are included in this recall. The serial number is etched on the bottom of the device. UPC 628078800836 is printed on the product packaging.",
      "timestamp": "2025-09-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Arizer Solo II portable electronic vaporizer devices"
    },
    {
      "id": 10410,
      "text": "EnHomee Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment; Violates Mandatory Standard for Clothing Storage Units; Sold by EnHomee Direct — This recall involves EnHomee Fabric 13-Drawer Dressers. The Fabric 13-Drawer Dressers are 55.12\" W x 35.45\" H x 11.02\" D and come in rustic brown, white, black, and pink.",
      "timestamp": "2025-09-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "EnHomee 13-Drawer Dressers"
    },
    {
      "id": 10403,
      "text": "Five Below Recalls Tabletop Fire Pits Due to Risk of Serious Burn Injury from Flame Jetting and Fire Hazards — This recall involves two models of tabletop fire pits, one with a smooth black base and one with a beveled gray base. Both include a stainless-steel fuel cup, a lid and a flame cover. The smooth black fire pits come in blue, yellow and white box packaging with \"Tabletop Fire Pit\" printed in white lettering on the front of the box, and UPC \"1922343012788\" and tracking number \"FO031124\" printed on the back. The beveled gray fire pits come in green box packaging with \"Outdoor\", \"Easy Modern\" and \"Cement Tabletop Firepit\" printed on the front of the box, and UPC \"1922346316838\" and tracking number \"FO011925\" printed on the back.",
      "timestamp": "2025-09-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Tabletop Fire Pits"
    },
    {
      "id": 10404,
      "text": "IcyBreeze Cooling Recalls Portable Misting Fans Due to Fire Hazard — This recall involves the IcyBreeze Buddy, a portable, battery-operated misting fan. The portable fan is equipped with a 1.5-liter water tank for continuous misting and allows consumers to choose between AC power or the 10,000 mAh rechargeable lithium-ion battery for up to 7 hours of outdoor use. The misting fan displays \"ICYBREEZE\" on both the fan and the base of the product and comes in slate blue, gray, and seafoam. Note: Do not throw this recalled lithium-ion battery or device in the trash, the general recycling stream (e.g., street-level or curbside recycling bins), or used battery recycling boxes found at various retail and home improvement stores. Recalled lithium-ion batteries must be disposed of differently than other batteries, because they present a greater risk of fire. Your municipal household hazardous waste (HHW) collection center may accept this recalled lithium-ion battery or device for disposal. Before taking your battery or device to a HHW collection center, contact that office ahead of time and ask whether it accepts recalled lithium-ion batteries. If it does not, contact your municipality for further guidance.",
      "timestamp": "2025-09-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "IcyBreeze Buddy Portable Misting Fans"
    },
    {
      "id": 10409,
      "text": "LXDHSTRA Baby Loungers and Crib Bumpers Recalled Due to Risk of Serious Injury or Death from Suffocation and Fall Hazards; Violates Federal Standard for Infant Sleep Products and Federal Crib Bumper Ban; Sold on Amazon — This recall involves LXDHSTRA-branded baby loungers. The recalled baby loungers include a foam sleeping pad and padded bumpers with a cloth cover. The baby loungers were sold in the following prints: tan star, big elephant, green elephant, gray feather and gray rainbow; and came with a red and black padded crib bumper that has letters \"A\" through \"F\" on one side and animal characters on the other side.",
      "timestamp": "2025-09-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "LXDHSTRA Baby Loungers"
    },
    {
      "id": 10405,
      "text": "Wuensche USA Recalls Ambiano Cotton Candy Makers Due to Fire Hazard; Sold at ALDI — This recall involves all Ambiano Cotton Candy makers with model number 836098. The Cotton Candy makers have a red or teal base with a clear plastic cover. \"Ambiano\" and the model number are printed on the cotton candy maker's packaging and the bottom of the unit.",
      "timestamp": "2025-09-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Ambiano Cotton Candy Makers"
    },
    {
      "id": 10408,
      "text": "YooxArmor Multi-Purpose Kids' Helmets Recalled Due to Risk of Serious Injury or Death from Head Injury; Violates Mandatory Standard for Bicycle Helmets; Sold on Amazon by YooxArmor — This recall involves YooxArmor multi-purpose kids' helmets. The recalled helmets were sold in size small (S). The helmets were sold in pink with a unicorn, rainbow and star print with black padding, black straps, and a black and red buckle with a black chin pad. The helmets have a black and red plastic knob at the back of the helmet for adjusting the fitting. \"YooxArmor\" is printed on the back of the helmet.",
      "timestamp": "2025-09-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "YooxArmor Multi-Purpose Kids' Helmets"
    },
    {
      "id": 10407,
      "text": "Youbeien Crib Mobiles Recalled Due to Risk of Serious Injury or Death from Battery Ingestion; Violates the Mandatory Toy Standard for Batteries; Sold on Amazon by GKKBSJ — This recall involves Youbeien-branded crib mobiles. The crib mobile with timing function for music and lights comes in pink and purple and has a plastic arm that attaches to the side of a crib, a music box and four arms with dangling plastic animal characters (penguin, pig, lion, unicorn, and others). The mobile measures about 17 inches wide by 20 inches high and comes with a remote to control music and rotation. The product packaging has the brand name \"Youbeien\" printed on the top left corner, \"music rotating bed bell\" printed on the front and back, and model \"RT668-17\" printed on a white label on the back.",
      "timestamp": "2025-09-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Youbeien Crib Mobiles"
    }
  ]
}