{
  "source": "cpsc",
  "topic_id": "portable-anxiety-relief",
  "fetched_at": "2026-01-23T14:32:25.793Z",
  "items": [
    {
      "id": 10568,
      "text": "Academy Sports + Outdoors Recalls Magellan Odyssey Rocker Chairs Due to Injury and Fall Hazards — This recall involves Academy Sports + Outdoors' Magellan-branded Odyssey Rocker Chairs with date codes 07/2025 or 08/2025 sold from September 2025 to October 2025. The recalled folding chairs were sold in charcoal, navy, olive green and teal and measure about 25.2\" long by 5.5\" deep by 37.4\" high when folded or 25.4\" long by 25.2\" deep by 37.4\" high when opened. They have a metal frame with a mesh backrest, a carrying handle and a drink holder on the side. The Magellan Outdoors logo is printed on the front of the backrest. Only chairs manufactured between July 2025 through August 2025 are included in this recall. \"ACADEMY, LTD,\" \"177296\" and the manufacture date in MM/YYYY format are printed on the tracking label sewn onto the seat of the chair.",
      "timestamp": "2026-01-22T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Magellan Odyssey Rocker Chairs"
    },
    {
      "id": 10569,
      "text": "Johnson Health Tech Expands Recall to Include Matrix Retail and Vision Treadmills Due to Fire Hazard — This recall involves Matrix Retail models T30, TF30, T50, TF50, and T75 treadmills, and Vision models T9800, TF20, T40, and T80 treadmills with certain serial numbers. The treadmills have a running platform that measures 60 inches long by 20 inches wide, a 33-inch-wide console, and were sold with a straight power cord with no power cord bracket. \"Matrix\" or \"Vision\" is printed on the treadmill and treadmill belt. The model number and frame serial number are located on the lower front crossbar near the power switch. The serial number includes the letters TM, a three-digit model number, and the manufacture date in YY/MM format followed by a five-digit serial. The recalled treadmills were manufactured from June 2007 through January 2024 and do not come with a power cord bracket. This recall is an expansion of the prior recall of Matrix T1 and T3 Series Commercial Treadmills, which were also recalled because the power cord can become loose from the treadmill's power socket. The remedy in the prior recall of commercial treadmills is a power cord bracket that requires tools for installation. For this recall expansion, the remedy for consumers is a power cord with an automatic locking-style plug that does not require any tools for installation. Model Name/ Number Recalled Serial Number(s) or Range Matrix Retail T30 (TM729) TM7291709CA00001 - TM7292104C00380 TF30 (TM693, TM693B) TM6931606CA00001 - TM6931705CA00178 TM693B1707CA00001 - TM693B2201C00601 T50 (TM695, TM767) TM6951607CA00001 - TM6952009C00840 TM7672009C00001 - TM76722011C00051 TF50 (TM694, TM694B, TM768) TM6941607CA00001 - TM69482009C00514 TM694B1605C00008 - TM694B2009K03263 TM7682009C00001 - TM7682104C00580 T75 (TM703, TM703B, TM703C, TM703E) TM7031607CA00001 - TM70381903C00088 TM70382311C00229 TM703B1609CA00015 - TM703B1908C00050 TM703B2309C00164, TM703B2311C00282 TM703C1810C00001 - TM703C2212C00127 TM703C2305C00049, TM703C2308C00409 TM703E2304C00002 - TM703E2401C00087 Vision T9800 (TM87) TM87D070600070, TM87D080600128, TM87D0940059, TM87D120100125, and TM87D1206000127 TF20 (TM432, TM432C) TM4321108BD00255 - TM4321610CA00033 TM432C1210CA00002 - TM432C1606CA00200 T40 (TM433, TM433C) TM4331201BD00466 - TM4331510BD00004 TM433C1408CJ00001 - TM433C1602CA00631 T80 (TM445) TM4451210BC00001 - TM4451505BC00150 TM4451212BD00002 - TM4451406BD00125",
      "timestamp": "2026-01-22T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Matrix Retail T30, TF30, T50, TF50, and T75 treadmills, Vision T9800, TF20, T40, and T80 treadmills"
    },
    {
      "id": 10567,
      "text": "Thrasio Recalls Angry Orange Enzyme Stain Removers Due to Risk of Exposure to Bacteria — This recall involves Angry Orange Enzyme Stain Removers in Fresh Clean Scent and Orange Twist Scent sold in 24-oz, 32-oz and 1-gallon sizes. The bottles are orange and white and have \"Angry Orange\" and \"Stain & Odor Remover\" written on the front. Some units were sold as a bundle with a UV light that attaches to the spray bottle.",
      "timestamp": "2026-01-22T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Angry Orange Enzyme Stain Removers"
    },
    {
      "id": 10570,
      "text": "Yetonamr Pull String Teething Toys Recalled Due to Risk of Serious Injury or Death from Choking; Violate Mandatory Standard for Toys; Sold on Amazon by Longyanguiheng — This recall involves the Yetonamr Pull String Teething Toy. The teething toy is an off-white disc shape with either a red ball or blue ball in the middle and six long, silicone pull string \"tentacles\" of various colors running through the ball. There are also three free-spinning rings and soft push buttons on the disc. \"Model no. 688-59\" is printed on the product packaging.",
      "timestamp": "2026-01-22T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Yetonamr Pull String Teething Toys"
    },
    {
      "id": 10561,
      "text": "Adams Manufacturing Recalls Adirondack Patio Chairs Due to Injury and Fall Hazards — This recall involves Adirondack-style patio chairs sold under two different brands: Adams RealComfort and StyleWell. The resin chairs with slat backs and seats were sold in blue, dark gray, navy blue, taupe, light blue, lime green and teal. \"ML837-15\" and the manufacture date of August 2025 are molded on the underside of the recalled chairs. The manufacture date is indicated by a dot on a grid, located at the intersection of column \"A\" and row \"25\".",
      "timestamp": "2026-01-15T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Adams RealComfort and StyleWell Adirondack Patio Chairs"
    },
    {
      "id": 10558,
      "text": "BBWOO Baby Loungers Recalled Due to Risk of Serious Injury or Death from Head Injury; Violates Mandatory Standard for Bicycle Helmets — This recall involves BBWOO baby loungers. The recalled baby loungers are made of a foam sleeping pad and padded bumpers with a cloth cover and have a ribbon tie at one end. The model number is located on a tracking label stitched on the outside cover. The baby loungers were sold in the following styles and models: Style Model Number Gray Dinosaur BLG26BE Blue Car BLG23BD Green Line BLG04BD Gray Feather BLG01BE Pink Deer BLG17BI Pink Elephant BLG32BI Gray Line BLG04BE Blue CZC44 Gray CZC41 Khaki-Cotton & Velvet CZC43 Red CZC42",
      "timestamp": "2026-01-15T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "BBWOO Baby Loungers"
    },
    {
      "id": 10566,
      "text": "Curtis International Expands Recall of Frigidaire-brand Minifridges Due to Fire and Burn Hazards — This recall expansion involves Curtis International 6-can minifridge model EFMIS121. This is in addition to certain minifridges with model numbers EFMIS129, EFMIS137, EFMIS149 and EFMIS175 that were previously recalled. \"Frigidaire\" is printed on the front of the units. The model and serial numbers are on a label on the back of the minifridge. This recall includes only the serial numbers identified below. The minifridges were sold in red at Target stores. Model Number Serial Number EFMIS121 Between A2001 and A2310",
      "timestamp": "2026-01-15T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Frigidaire-brand Minifridges, model EFMIS121, with limited serial numbers"
    },
    {
      "id": 10557,
      "text": "Energizer Recalls Rechargeable Lanterns Due to Overheating — This recall involves the Energizer® Large Power Indicator Lantern. The lantern is a cone-shaped portable light with an opaque lens and \"Energizer\" displayed on the side. The top portion of the lantern is gray with a large power button on top and a red handle. The model number of the lantern is BGAAL9 and the SKU number is 039800143341 or 039800143334. The model is located on the bottom of the light, on the removable cover that provides access to the charging cord storage area. The SKU is located on the packaging. Only lanterns with a date code of June 2024 located on the base of the unit, are part of this recall. The date code is shown using two circles, one circle has an arrow pointing to the year (\"24\"), and the other has an arrow pointing to the month (\"6\").",
      "timestamp": "2026-01-15T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Energizer® Large Power Indicator Lanterns"
    },
    {
      "id": 10564,
      "text": "Greatale Recalls Self-Feeding Pillows Due to Risk of Serious Injury or Death from Aspiration and Suffocation — This recall involves Greatale self-feeding pillows. The recalled self-feeding pillows are made of stuffed fabric and have an elastic sleeve to hold a bottle in front of an infant's face. They were sold in white with angel wing shaped decorations. \"Greatale\" is on a label sewn into the seam of the pillow.",
      "timestamp": "2026-01-15T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Self-Feeding Pillows"
    },
    {
      "id": 10563,
      "text": "HEZI Brand Power Strips Recalled Due to Risk of Serious Injury or Death from Electrocution; Sold by HEZI HOME — This recall involves HEZI brand power strips. The HEZI power strip has either a gray or yellow metal enclosure with eight receptacles made of black plastic. There are a power and a circuit breaker switch located at the end of the metal enclosure closest to the power cord.",
      "timestamp": "2026-01-15T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "HEZI Branded Power Strips"
    },
    {
      "id": 10562,
      "text": "Morgan Lane Recalls Children's Pajama Sets Due to Risk of Serious Injury or Death from Burn Hazard; Violate Mandatory Flammability Standards for Children's Sleepwear — This recall involves Morgan Lane Asher Pajama Sets, Style 816TR in Petal. The recalled children's pajama sets are printed with tiny roses and have blue cotton piping and imitation mother-of-pearl buttons. The pajamas were sold in sizes 2T to 14. \"MORGAN LANE\" and \"PURE COTTON\" are printed on labels located in the neck and waistband, and \"100% Cotton Made in India\" is printed on the side seam label.",
      "timestamp": "2026-01-15T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Asher Pajama Sets"
    },
    {
      "id": 10559,
      "text": "R.X.Y Bicycle Helmets Recalled Due to Risk of Serious Injury or Death from Head Injury; Violates Mandatory Standard for Bicycle Helmets — This recall involves R.X.Y-branded adult bike helmets. The recalled helmets were sold in one size fitting a head circumference of about 22.44 to 24.41 inches. The helmets are blue with black and have gray padding, black straps with a silver reflective pattern in the center and a black and red buckle with a gray chin strap. The helmets have a black plastic knob at the back of the helmet for adjusting the fitting. Item number \"Kx012\" is printed on the helmet's instruction manual.",
      "timestamp": "2026-01-15T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "R.X.Y Bicycle Helmets"
    },
    {
      "id": 10565,
      "text": "RootStim Recalls Beard Growth Serum Spray Bottles Due to Risk of Serious Injury or Death from Child Poisoning; Violate Mandatory Standard for Child-Resistant Packaging — This recall involves RootStim Beard Growth Serums spray bottles. The serums come in black boxes with orange and white lettering and have an orange mustache icon on its front panel. The boxes have \"Beard Growth Treatment\" and \"5% Minoxidil - Biotin & Rice Water\" printed on its front, directions and warnings printed on its sides, and \"Distributed By RootStim LLC\" on the bottom. The bottles are black with black spray cap, transparent top cap, and an orange and black wraparound label bearing the same information as the box.",
      "timestamp": "2026-01-15T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "RootStim Beard Growth Serum, 5% Minoxidil"
    },
    {
      "id": 10556,
      "text": "Ruahouine Hair Growth Serum Bottles Recalled Due to Risk of Serious Injury or Death from Child Poisoning; Violates Mandatory Standard for Child-Resistant Packaging; Sold on Amazon by Ruahouine — This recall involves Ruahouine Hair Growth Serum. The serum comes in 60ml (2.11 fl. oz.) transparent amber dropper bottles. \"Ruahouine\", \"Minoxidil Hair Growth Serum\", and \"5% Minoxidil With Biotin\" are printed on labels wrapped around the bottles.",
      "timestamp": "2026-01-15T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Ruahouine Hair Growth Serum Bottles"
    },
    {
      "id": 10560,
      "text": "Yixing Trading Recalls KEAWIS Crib Mattresses Due to Risk of Serious Injury or Death from Entrapment and Suffocation; Violates Mandatory Standard for Crib Mattresses — This recall involves KEAWIS crib mattresses. KEAWIS crib mattresses were sold in white and measure about 38 inches by 24 inches. Model number \"XX-BM-01\" is printed on a label sewn on the side of the mattress.",
      "timestamp": "2026-01-15T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "KEAWIS Crib Mattress"
    },
    {
      "id": 10540,
      "text": "Agrish Adult Portable Bed Rails Recalled Due to Risk of Serious Injury or Death from Entrapment and Asphyxiation; Violate Mandatory Standard for Adult Portable Bed Rails; Sold on Amazon by Agrish Direct — This recall involves Agrish-branded adult portable bed rails, models 2512, 2513, and 2516, for use on adult beds. The model numbers are printed in the owner's manual. The recalled bed rails have white tubing with rounded gray foam rubber handle grips. Some models include a gray fabric pouch, support legs and a motion-sensor light. Recalled Bed Rails: Model Numbers Size zip 2512 About 11 inches wide and 39 inches in height About 12 inches wide and 42 inches in height 2516 About 37 inches wide and 45 inches in height",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Agrish Adult Portable Bed Rails"
    },
    {
      "id": 10541,
      "text": "DR Power Equipment Reannounces and Expands Recall of Leaf Vacuums Due to Laceration Hazard; New Remedy Available — This recall involves DR Power Equipment walk-behind leaf vacuums and tow-behind leaf vacuums with the following model numbers: Unit Type Model Numbers Walk Behind Leaf Vacuum WL33006DMN WL35008DENSD WL33006DMNR WL35008DMN WL35008DEN WL35008DMNR WL35008DENR WL35008DMNSD WL33106DMN WL35108DEN WL33106DMNR WL35108DENR WL35108DENSD Tow Behind LL3 LL31027DMN LL33032DEN LL33032DENR LL33032DENSD LL33032DMN LL35045DEN LL35045DMN LL35045DMNR LL37045DEN LL37045DMN LL37045DMNR LL37045DMNSD LL37060DEN LL37060DENR LL37145DEN LL31127DMN LL33132DMN LL37160DEN LL31127DMNR LL33132DMNR LL33132DEN LL35145DEN LL33132DENSD LL35145DMN Tow Behind LL2 LL21009DMN LL21009DMNR LL21009DMNSD LL23009DEN LL23009DENR LL23009DENSD LL23009DMN LL23009DMNR LL23009DMNT LL25013DEN LL25013DENR LL25013DENSD LL25013DMN LL25013DMNR LL25013DMNSD LL27016DEN LL27016DENR LL27016DENSD LL27016DMN LL27016DMNR LL27016DMNSD Additional LL2 Models *Note: These model numbers may or may not have spaces as printed on the data tags. LLVX13EDTDV3BF1 LLVX13EDTDVBBF1 LLVX13ENTDV3BF3 LLVX13ENTDVBBF3 LLVX13MDTDV3BF0 LLVX13MDTDV3BF1 LLVX13MDTDVBBF1 LLVX13MNTDV3BF3 LLVX13MNTDVBBF3 LLVX16E LLVX16EDTDV3BF1 LLVX16EDTDVBBF1 LLVX16ENTDV2BF3 LLVX16ENTDV3BF3 LLVX16ENTDVBBF3 LLVX16MDTDV2BF1 LLVX16MDTDV3BF1 LLVX16MDTDVBBF1 LLVX16MNTDV2BF3 LLVX16MNTDV3BF3 LLVX16MNTDVBBF3 LLVX9AMDTDVBBF3 LLVX9AMNTDVBBF3 LLVX9GMNTDVBBF3 LLVXX9EDTDV3BF1 LLVXX9EDTDVBBF1 LLVXX9ENTDV3BF3 LLVXX9ENTDVBBF3 LLVXX9MDTDV3BF1 LLVXX9MDTDVBBF1 LLVXX9MNTDV3BF3 LLVXX9MNTDVBBF3 LLVXX9MNTDVBTF3 \"DR\" is printed on the motor housing. The model number on the walk-behind leaf vacuum is located on the front right side of the unit behind the wheel. The model number on the tow-behind leaf vacuum is on the impeller housing beside the engine.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Walk-Behind Leaf Vacuums and Tow-Behind Leaf Vacuums"
    },
    {
      "id": 10542,
      "text": "Infant Innovations Recalls BabyBond Retractable Safety Gates Due to Risk of Serious Injury or Death to Children from Entrapment; Violates Mandatory Standard for Gates and Enclosures — This recall involves BabyBond-branded retractable safety gates. The recalled safety gates were sold in black, gray and white and have a metal frame. They measure about 33 inches high with an adjustable width up to 55 inches. \"Retractable Safety Gate\" and model number \"SH20.006DB\" are printed on a white label stitched to the mesh fabric on the side of the gate.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "BabyBond Retractable Safety Gates"
    },
    {
      "id": 10553,
      "text": "Isla Rae Magnetic Wireless Chargers Recalled Due to Fire and Burn Hazards; Sold by TJX at T.J. Maxx and Marshalls Stores — This recall involves magnetic wireless chargers sold under the Isla Rae brand. The chargers are compatible with magnetic charging systems and attach magnetically to the back of a phone to charge the device. The chargers were sold in the following colors: white, pink, and purple. The model number \"RM5PBM\" can be found on the side of the magnetic wireless charger, below the markings \"5000 mAh 3.7V.\". Note: Do not throw this recalled lithium-ion battery or device in the trash, the general recycling stream (e.g., street-level or curbside recycling bins), or used battery recycling boxes found at various retail and home improvement stores. Recalled lithium-ion batteries must be disposed of differently than other batteries, because they present a greater risk of fire. Your municipal household hazardous waste (HHW) collection center may accept this recalled lithium-ion battery or device for disposal. Before taking your battery or device to a HHW collection center, contact that office ahead of time and ask whether it accepts recalled lithium-ion batteries. If it does not, contact your municipality for further guidance.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Isla Rae Magnetic Wireless Chargers"
    },
    {
      "id": 10555,
      "text": "Joyful Journeys Recalls Baby Loungers Due to Risk of Serious Injury or Death from Entrapment and Fall Hazards; Violates Mandatory Standard for Infant Sleep Products — This recall involves Joyful Journeys baby loungers. The recalled baby loungers are made of a foam sleeping pad and padded bumpers with a cloth cover. The recalled baby loungers zip up into a bag with a strap at the top. The recalled baby loungers were sold in the following styles: green avocado, blue dinosaur, blue lambs, blue zoo animals, green minky, neutral elephants, pink zoo animals, and white minky. \"Joyful Journeys\" can be found on a tag stitched on the outside of the lounger cover and on a label stitched directly onto the back of the lounger.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Joyful Journeys Baby Loungers"
    },
    {
      "id": 10552,
      "text": "Kori Gey Water Toy Kits Recalled Due to Risk of Serious Injury or Death from Battery Ingestion; Violates Mandatory Standard for Toys; Sold on Amazon by Qaniy — This recall involves Kori Gey-branded water elf toy kits. The recalled kits are a children's craft toy that uses colored gel dropped into water to form soft, squishy jelly-like figures. The toy kit consists of 22 bottles of water gel (12 non-sparkly and 10 sparkly), 22 molds in various shapes, a plastic strainer, a plastic jar labeled magic powder, extra magic powder packet, a paint brush, disposable gloves and a LED light with a button cell battery. The toy sets come in a plastic jar with lid. \"Kori Gey\" and \"Water Elf Kit\" are printed on the front of the toy kits.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Kori Gey Water Elf Toy Kits"
    },
    {
      "id": 10544,
      "text": "Marcus Adler Glove Recalls Julie and Judah Pajama Pants and Shorts Due to Burn Hazard; Violates Mandatory Flammability Standards for Children's Sleepwear — This recall involves Julie and Judah pajama and lounge pants and shorts sold separately in various prints, including Fuzzy Heart, Gummy Bear, Star, Star Multi, Teddy Bear, Candy, Graffiti, Sprinkle, Smiley Flower, Shooting Star, Ribbon, Cloud, Boys Varsity Sports (pants only) and Boys Gaming (pants only). The pants were sold in sizes \"S\", \"M\" and \"L\". The shorts were sold in sizes \"S\" and \"M\". \"Julie and Judah\" appear on the main label sewn into the pants and shorts.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Julie and Judah pajama pants and shorts"
    },
    {
      "id": 10545,
      "text": "NFSVLB Baby Bath Seats Recalled Due to Risk of Serious Injury or Death to Children from Drowning and Entrapment; Violate Mandatory Standard for Infant Bath Seats; Sold on Amazon by NFSVLB — This recall involves NFSVLB-branded Baby Bath Seats. They are blue and white and have detachable arms that serve as a restraint. There are four suction cups on the seat's bottom. \"Model No.: ZY2025\" is printed on a label located on the side of the bath seat.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "NFSVLB Baby Bath Seats (blue)"
    },
    {
      "id": 10554,
      "text": "PNW Components Recalls Aluminum Alloy Bicycle Pedals Due to Crash Hazard — This recall involves the PNW Components Loam Pedal Gen 2 aluminum alloy mountain bike pedal. These pedals were sold after market through online retailers and bicycle shops. The pedal is a platform style (non-clip) pedal and can be identified by a \"Tectonic\" logo laser etched onto the pedal body on the left corner, on the same side as the threaded axle. The pedals are available in black, silver, green, orange and purple.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Loam Pedal Gen 2 aluminum alloy bicycle pedals"
    },
    {
      "id": 10550,
      "text": "Pounding Toys Recalled Due to Risk of Serious Injury or Death from Magnet Ingestion Hazard; Violate Mandatory Standard for Toys; Sold on Amazon by Findriver and Weeksome — This recall involves the Lterfear Multifunction Pounding Game, model No. D888. The wooden multifunction pounding game includes four games: whack-a-mole, fishing, xylophone, and carrot cutting. The toy has a xylophone, gears, a clock, holes to insert various fruit shapes, and \"moles\" for pounding. The toy is sold with accessories, including xylophone mallets, a fishing rod, a pounding mallet, four wooden fish, four wooden carrots, wooden fruit and wooden knives. There are no markings on the product.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Lterfear Multifunction Pounding Game"
    },
    {
      "id": 10546,
      "text": "Rattan 6-Drawer Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment; Violate Mandatory Standard for Clothing Storage Units; Sold on Amazon by Rattan — This recall involves Rattan 6-Drawer Dressers, model YD001. The dressers are a natural wood color. They are made of wood, have six drawers with woven rattan drawer fronts, gold handles, and measure 43.3 inches by 15.7 inches by 29.5 inches. The model number \"YD001\" can be found on the product packaging.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Rattan 6-Drawer Dressers"
    },
    {
      "id": 10551,
      "text": "RH Recalls Natural Antler Chandeliers Due to Impact Hazard — This recall involves RH 48\" and 60\" diameter Natural Antler Chandeliers manufactured between September 2021 and October 2024 per customer special order and hung at an angle on a vaulted ceiling or sloped beam. The chandeliers are made from naturally shed elk antlers and were sold in three finishes: natural, sun-bleached and black. The 48\" diameter chandelier measures about 48\" tall and weighs about 40 pounds and was sold with SKU numbers 10036671NAT, 10036671SUNB and 10036671BLK. The 60\" diameter chandelier measures about 36\" tall and weighs about 45 pounds and was sold with SKU numbers 10035099NAT, 10035099SUNB and 10035099BLK. The SKU number is located on the order confirmation and printed on the receipt.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "48\" and 60\" Natural Antler Chandeliers"
    },
    {
      "id": 10547,
      "text": "Sangohe Adult Portable Bed Rails Recalled Due to Risk of Serious Injury or Death from Entrapment and Asphyxiation; Violate Mandatory Standard for Adult Portable Bed Rails — This recall involves Sangohe-branded adult portable bed rails. The black, trapezoidal-shaped bed rails measure about 22.4 inches wide by 32 inches tall and have an extendable handle with gray padding and a storage mesh pocket. Model number \"KDB504A01FT\" is printed on a label located on the frame, either on the bottom foot tube or on the horizontal cross tube. \"Sangohe\" is printed on the product packaging.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Sangohe Bed Rails"
    },
    {
      "id": 10543,
      "text": "The Kalencom Corporation Recalls SARO Braided Crib Bumpers Due to Risk of Serious Injury or Death from Suffocation; Violates Federal Crib Bumper Ban — This recall involves SARO Braided Crib Bumpers, Model 1374. The crib bumpers were sold in salmon, gray and mint colors. \"Ref. 1374\" is printed on a tag sewn into the crib bumpers and on a tag attached to the product packaging.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "SARO Braided Crib Bumpers"
    },
    {
      "id": 10548,
      "text": "Vasicar 18-Drawer Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment; Violates Mandatory Standard for Clothing Storage Units — This recall involves Vasicar 18-Drawer Dressers. The dressers were sold in black, white, gray, and mixed colors. They have a metal frame, wooden top, and 18 collapsable fabric drawers. The dressers are 37.8 inches long by 11.8 inches wide by 57.1 inches tall. Some of the dressers have \"VR-US18D-Black,\" \"VR-US18D-White,\" \"VR-US18D-Gray,\" and \"VR-US18D-Mixed\" printed on the product packaging.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Vasicar 18-Drawer Dressers"
    },
    {
      "id": 10549,
      "text": "YOLAAH Adult Portable Bed Rails Recalled Due to Risk of Serious Injury or Death from Entrapment and Asphyxiation Hazards; Violate Mandatory Standard for Adult Portable Bed Rails — This recall involves YOLAAH Bed Rails, model BR-01. The bed rail has a black rubber hand grip, storage pocket, and white metal base. The bed rails measure 15.8 inches tall by 26.8 inches wide. The bed rail has \"YOLAAH\" printed on the storage pocket.",
      "timestamp": "2026-01-08T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "YOLAAH Portable Bed Rails"
    }
  ]
}