{
  "source": "cpsc",
  "topic_id": "hydration-bottles-problems",
  "fetched_at": "2025-09-28T14:20:19.633Z",
  "items": [
    {
      "id": 10412,
      "text": "AMTRADING Recalls Hoovy Cooling Gel Insert Pads for Car Seats and Strollers Due to Burn Hazard — This recall involves black Cooling Gel Insert Pads for strollers or car seats and contain an inner cooling layer that is activated by a child's weight. The Hoovy logo appears in white on the bottom right corner of the product. The recalled cooling pads are approximately 16.5 inches long by 14.25 inches wide.",
      "timestamp": "2025-09-25T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Hoovy Cooling Gel Insert Pads for Car Seats and Strollers"
    },
    {
      "id": 10414,
      "text": "Autoez Brand Bamboo Shades Recalled Due to Strangulation and Entanglement Hazards and Risk of Serious Injury or Death; Violates Federal Rule for Window Coverings; Sold on Walmart.com — This recall involves Autoez-branded bamboo shades. The recalled bamboo shades were sold in brown, with sizes ranging from 24 to 72 inches wide and 64 to 72 inches high. \"Autoez\" is printed on the sticker label on the top rail of the shade.",
      "timestamp": "2025-09-25T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Autoez Bamboo Shades"
    },
    {
      "id": 10413,
      "text": "Mad Rabbit Recalls \"RELIEVE\" Lidocaine Numbing Cream Due to Risk of Serious Injury or Death from Poisoning to Young Children; Violates Mandatory Standard for Child-Resistant Packaging — This recall involves \"RELIEVE\" numbing cream. The cream comes in a short wide-mouthed white container. A label is located on the front with black lettering and \"RELIEVE\" in large type and the company's logo and \"Mad Rabbit\", \"Numbing Cream\" and \"Menthol\" in smaller type.",
      "timestamp": "2025-09-25T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "RELIEVE Numbing Cream"
    },
    {
      "id": 10415,
      "text": "Persilux Brand Zebra Blinds Recalled Due to Strangulation and Entanglement Hazards and Risk of Serious Injury or Death; Violates Federal Rule for Window Coverings; Sold on Amazon — This recall involves Persilux-branded zebra blinds. The recalled stock blinds were sold in beige, black, dark gray, light gray and white, with sizes ranging from 22 to 73 inches wide and 64 to 72 inches high. \"Persilux and \"Zebra Blinds\" is printed on the product packaging. \"X003FFPT63\" is printed on the barcode label.",
      "timestamp": "2025-09-25T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Persilux Zebra Blinds"
    },
    {
      "id": 10411,
      "text": "Sunbeam Products Recalls More than One Million Oster French Door Countertop Ovens Due to Burn Hazard — This recall involves Oster French Door Countertop Ovens with model numbers TSSTTVFDXL, TSSTTVFDDG, TSSTTVFDMAF and TSSTTVFDDAF. The recalled ovens have a spring-loaded bilateral door made of glass with metal handles. A label on the backside of the oven identifies the model number. In addition, the original packaging has information identifying the model number. The four models differ in cooking options (e.g., air fryer) and control types (analog dials or digital push-button controls). \"Oster\" is engraved on the front bottom right of the oven.",
      "timestamp": "2025-09-25T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Oster French Door Countertop Ovens"
    },
    {
      "id": 10406,
      "text": "Arizer Solo II Portable Vaporizers Recalled Due to Fire and Burn Hazards; Imported by 7111495 Canada — This recall involves the Arizer Solo II, a portable electronic vaporizer device powered by an internal lithium-ion battery. The unit features a rigid anodized aluminum housing and is available in Carbon Black and Mystic Blue finishes. It includes a front-facing digital display for temperature and device settings, with a stainless steel heating chamber and removable glass components. Only vaporizers with a serial number starting with \"M2\" are included in this recall. The serial number is etched on the bottom of the device. UPC 628078800836 is printed on the product packaging.",
      "timestamp": "2025-09-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Arizer Solo II portable electronic vaporizer devices"
    },
    {
      "id": 10410,
      "text": "EnHomee Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment; Violates Mandatory Standard for Clothing Storage Units; Sold by EnHomee Direct — This recall involves EnHomee Fabric 13-Drawer Dressers. The Fabric 13-Drawer Dressers are 55.12\" W x 35.45\" H x 11.02\" D and come in rustic brown, white, black, and pink.",
      "timestamp": "2025-09-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "EnHomee 13-Drawer Dressers"
    },
    {
      "id": 10403,
      "text": "Five Below Recalls Tabletop Fire Pits Due to Risk of Serious Burn Injury from Flame Jetting and Fire Hazards — This recall involves two models of tabletop fire pits, one with a smooth black base and one with a beveled gray base. Both include a stainless-steel fuel cup, a lid and a flame cover. The smooth black fire pits come in blue, yellow and white box packaging with \"Tabletop Fire Pit\" printed in white lettering on the front of the box, and UPC \"1922343012788\" and tracking number \"FO031124\" printed on the back. The beveled gray fire pits come in green box packaging with \"Outdoor\", \"Easy Modern\" and \"Cement Tabletop Firepit\" printed on the front of the box, and UPC \"1922346316838\" and tracking number \"FO011925\" printed on the back.",
      "timestamp": "2025-09-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Tabletop Fire Pits"
    },
    {
      "id": 10404,
      "text": "IcyBreeze Cooling Recalls Portable Misting Fans Due to Fire Hazard — This recall involves the IcyBreeze Buddy, a portable, battery-operated misting fan. The portable fan is equipped with a 1.5-liter water tank for continuous misting and allows consumers to choose between AC power or the 10,000 mAh rechargeable lithium-ion battery for up to 7 hours of outdoor use. The misting fan displays \"ICYBREEZE\" on both the fan and the base of the product and comes in slate blue, gray, and seafoam. Note: Do not throw this recalled lithium-ion battery or device in the trash, the general recycling stream (e.g., street-level or curbside recycling bins), or used battery recycling boxes found at various retail and home improvement stores. Recalled lithium-ion batteries must be disposed of differently than other batteries, because they present a greater risk of fire. Your municipal household hazardous waste (HHW) collection center may accept this recalled lithium-ion battery or device for disposal. Before taking your battery or device to a HHW collection center, contact that office ahead of time and ask whether it accepts recalled lithium-ion batteries. If it does not, contact your municipality for further guidance.",
      "timestamp": "2025-09-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "IcyBreeze Buddy Portable Misting Fans"
    },
    {
      "id": 10409,
      "text": "LXDHSTRA Baby Loungers and Crib Bumpers Recalled Due to Risk of Serious Injury or Death from Suffocation and Fall Hazards; Violates Federal Standard for Infant Sleep Products and Federal Crib Bumper Ban; Sold on Amazon — This recall involves LXDHSTRA-branded baby loungers. The recalled baby loungers include a foam sleeping pad and padded bumpers with a cloth cover. The baby loungers were sold in the following prints: tan star, big elephant, green elephant, gray feather and gray rainbow; and came with a red and black padded crib bumper that has letters \"A\" through \"F\" on one side and animal characters on the other side.",
      "timestamp": "2025-09-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "LXDHSTRA Baby Loungers"
    },
    {
      "id": 10405,
      "text": "Wuensche USA Recalls Ambiano Cotton Candy Makers Due to Fire Hazard; Sold at ALDI — This recall involves all Ambiano Cotton Candy makers with model number 836098. The Cotton Candy makers have a red or teal base with a clear plastic cover. \"Ambiano\" and the model number are printed on the cotton candy maker's packaging and the bottom of the unit.",
      "timestamp": "2025-09-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Ambiano Cotton Candy Makers"
    },
    {
      "id": 10408,
      "text": "YooxArmor Multi-Purpose Kids' Helmets Recalled Due to Risk of Serious Injury or Death from Head Injury; Violates Mandatory Standard for Bicycle Helmets; Sold on Amazon by YooxArmor — This recall involves YooxArmor multi-purpose kids' helmets. The recalled helmets were sold in size small (S). The helmets were sold in pink with a unicorn, rainbow and star print with black padding, black straps, and a black and red buckle with a black chin pad. The helmets have a black and red plastic knob at the back of the helmet for adjusting the fitting. \"YooxArmor\" is printed on the back of the helmet.",
      "timestamp": "2025-09-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "YooxArmor Multi-Purpose Kids' Helmets"
    },
    {
      "id": 10407,
      "text": "Youbeien Crib Mobiles Recalled Due to Risk of Serious Injury or Death from Battery Ingestion; Violates the Mandatory Toy Standard for Batteries; Sold on Amazon by GKKBSJ — This recall involves Youbeien-branded crib mobiles. The crib mobile with timing function for music and lights comes in pink and purple and has a plastic arm that attaches to the side of a crib, a music box and four arms with dangling plastic animal characters (penguin, pig, lion, unicorn, and others). The mobile measures about 17 inches wide by 20 inches high and comes with a remote to control music and rotation. The product packaging has the brand name \"Youbeien\" printed on the top left corner, \"music rotating bed bell\" printed on the front and back, and model \"RT668-17\" printed on a white label on the back.",
      "timestamp": "2025-09-18T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Youbeien Crib Mobiles"
    },
    {
      "id": 10400,
      "text": "Blueroot Health Recalls Bottles of Bariatric Fusion Iron Multivitamins Due to Risk of Serious Injury or Death from Child Poisoning; Violates Mandatory Standard for Child-Resistant Packaging; Manufactured by VitaQuest International — This recall involves two types of Bariatric Fusion dietary supplement bottles: high ADEK multivitamin capsules (90 and 270-count bottles) and One Per Day bariatric multivitamin capsules (90-count bottle), both with 45mg of iron. The recalled bottles are white and orange. Only bottles with smooth cap tops that lack the \"push down & turn\" embossed lettering are included in this recall. The Bariatric Fusion logo is printed on the front of the bottles. Lot number 0066J4, 0065J4, 0453B5 or 0370B5 is printed on the bottom of the bottles.",
      "timestamp": "2025-09-11T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Bariatric Fusion Iron Multivitamin Bottles"
    },
    {
      "id": 10399,
      "text": "Epoca International Recalls Paris Hilton Mini Beauty Fridges Due to Fire and Burn Hazards — This recall involves the Paris Hilton Mini Beauty Fridge sold in a 4-liter model in pink, white, aqua and hot pink and in a 10-liter model in pink and white. A label with the model number and serial number is located on the back of the unit for the 4-liter model and on the bottom of the unit for the 10-liter model. Paris Hilton branding is on the door in the right lower corner for most units, and in the top middle for some units. Only units manufactured prior to August 2024 with the serial numbers and ranges shown below are included in this recall. Size Color Model Number Serial Number Begins With 10 L Pink PH11887 2024 White PH11887-1 2024 Aqua PZB02-E001 202206 - 202406 Hot Pink PZ12540 2024 Pink PZP01-E001 202206 - 20240704020 White PZW01-E001 202206 - 202406",
      "timestamp": "2025-09-11T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Paris Hilton Mini Beauty Fridges"
    },
    {
      "id": 10402,
      "text": "In My Jammers Recalls Button Flare Pajama Sets Due to Burn Hazard; Violates Mandatory Flammability Standards — This recall involves In My Jammers-branded children's button up flare sets. The recalled pajama sets consist of a 95% viscose and 5% spandex short-sleeved shirt with buttons and matching flared pants. The pajama sets were sold in the following patterns: bows, swans, cherry, croissant and coffee, kiss, and floral prints in sizes 2T through 6T, 7/8, and 9/10. \"In My Jammers\" and the size are printed on the neck label of the pajama top.",
      "timestamp": "2025-09-11T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "In My Jammers Button Up Flare Pajama Sets"
    },
    {
      "id": 10401,
      "text": "Shierdu Children's Toys Recalled Due to Risk of Serious Injury or Death from Choking Hazard; Violates the Small Parts Ban; Sold on Amazon by Yiwu Shiyi Trading — This recall involves Shierdu's children's wooden building block cactus toys. The toys consist of 28 pieces: a natural wood color base with holes and wooden, bulbous segments with pegs that are painted yellow, light green, dark green, blue, red and gray and attach to each other to form a cactus. \"SHIERDU\" and model number \"SY-016\" are printed on the label located on the product's packaging.",
      "timestamp": "2025-09-11T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Children's Wooden Cactus Toys"
    },
    {
      "id": 10396,
      "text": "Makita U.S.A., Inc. Recalls Cordless Grease Guns and Grease Gun Hoses Due to Laceration Hazard — This recall involves Makita Professional Cordless Grease Guns with model numbers XPG01S1, XPG01SR1 and XPG01Z, and Makita Grease Gun Hoses with model numbers 191A79-9, 191A80-4, 191W59-7 and 191W58-9. All affected models have spring ends. The model number is located on the manufacturer label on the right side of the grease guns. The following ranges of serial numbers are included in this recall. The serial number is located on the battery mounting port on the grease guns. Product Model No. Serial No. (From) Serial No. (To) Grease Gun XPG01Z 1624 2163 3030 5088 20459 22582 51237 23713 58316 59555 60012 69623 72766 73595 80926 86281 86612 89078 91449 94928 94999 106439 112804 115923 Grease Gun XPG01SR1 02164 02813 22583 23113 50618 51236 69984 71983 86282 86461 86752 87751 106440 108946 109507 109919 Grease Gun XPG01S1 0137895 0143614 163962 164761 172741 175458 Hose 191A79-9 Hose 191A80-4 Hose 191W58-9 Hose 191W59-7",
      "timestamp": "2025-09-04T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Makita Professional Cordless Grease Guns and Makita Grease Gun Hoses"
    },
    {
      "id": 10398,
      "text": "StopBox USA Recalls AR-15 Chamber Lock Pros Due to Risk of Serious Injury and Death — This recall involves certain AR-15 Chamber Lock Pro firearm locks shipped between June 2 and July 15, 2025. Consumers can find their shipping date by contacting StopBox by phone, email, or online at https://stopboxusa.com/pages/stopbox-ar-15-chamber-lock-recall. This is a device designed to lock into the chamber of an AR-15 style rifle and prevent it from firing. The product is made of anodized aluminum machined parts, was sold in red and black, and has five buttons that correspond to each finger. It has the StopBox \"S\" logo and \"CHAMBER LOCK PRO AR-15\" laser etched on the back of the product.",
      "timestamp": "2025-09-04T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "AR-15 Chamber Lock Pro Firearm Locks"
    },
    {
      "id": 10397,
      "text": "URMYWO Baby Loungers Recalled Due to Risk of Serious Injury or Death from Suffocation and Fall Hazard; Violates Mandatory Standard for Infant Sleep Products; Sold on Amazon by Pomona — This recall involves URMYWO baby loungers in the style \"grey feather.\" The baby loungers are made of a gray cloth cover printed with feathers with a foam sleeping pad and padded bumpers. \"URMYWO\" and \"Model No: UMCZC01AE\" are printed on labels located on the side of the lounger.",
      "timestamp": "2025-09-04T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "URMYWO Baby Loungers"
    }
  ]
}