{
  "source": "cpsc",
  "topic_id": "hydration-bottles-problems",
  "fetched_at": "2025-10-20T14:24:48.671Z",
  "items": [
    {
      "id": 10434,
      "text": "AOWOS Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment Hazards; Violates Mandatory Standard for Clothing Storage Units; Sold on Walmart.com by AOWOS — This recall involves AOWOS 12-drawer dressers. The recalled dressers were sold in black, brown, gray, oak, pink and white. They have a metal frame, wooden top, 12 collapsing fabric drawers of different sizes with handles, four side pockets and two hooks. The dressers measure about 39 inches by 12 inches by 44.5 inches, and weigh about 42 pounds. Model number 12DRW01, 12DRW02, 12DRW11, 12DRW13, 12DRW19, 12DRW20 or 12DRW27 is printed on the product packaging.",
      "timestamp": "2025-10-16T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "AOWOS Dressers"
    },
    {
      "id": 10440,
      "text": "Belivium Baby Loungers Recalled Due to Risk of Serious Injury or Death from Suffocation and Entrapment Hazards; Violates Mandatory Standard for Infant Sleep Products; Sold on Amazon by Belivium — This recall involves Belivium baby loungers. The baby loungers are made of a foam sleeping pad and padded bumpers with a cloth cover. They were sold in the following styles: yellow zoo animal, blue dinosaur, blue rainbow, blue and grey star, colorful elephant, grey and blue palm leaf, light brown farm theme, pink butterfly and plant, pink deer, white and grey cloud, and white and grey elephant. \"BABY NEST\" is printed on an attached label inside the baby lounger's cover.",
      "timestamp": "2025-10-16T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Belivium Baby Loungers"
    },
    {
      "id": 10435,
      "text": "iFIT Recalls NordicTrack Rowing Machines Due to Fire Hazard — This recall involves iFIT NordicTrack Rowing Machines with model numbers NTRW19147.0, NTRW19147.1, NTRW19147.2 or NTRW19147.3. The model number is printed on a decal attached to the rower base. The recalled rowing machines are black, gray and white and have \"NordicTrack\" printed in black letters on the front legs of the machine. The back legs of the machine have \"RW900\" printed in white letters.",
      "timestamp": "2025-10-16T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "NordicTrack Model NTRW19147 Rowing Machine"
    },
    {
      "id": 10433,
      "text": "RH Recalls Byron Tables and Desks Due to Risk of Injury — This recall involves three different models of RH's Byron furniture. -The Byron Reeded Stone travertine or marble dining tables were sold in Italian Classico (natural) Travertine, Brown Emperador (brown) Marble and Spanish Nero Marquina (black) Marble and in five lengths: 72 inches, 84 inches, 96 inches, 108 inches and 120 inches-The Byron Reeded Stone travertine or marble desks were sold in Italian Classico (natural) Travertine, Brown Emperador (brown) Marble and Spanish Nero Marquina (black) Marble and in two lengths: 60 inches and 72 inches. -The Byron Emperador dining tables have a gold Emperador marble top and reeded whitewashed, greige, light, natural, brown and black oak and white, grey, crema (cream), gold or brown wooden legs; and were sold in four lengths: 72inches, 84 inches, 96 inches and 108 inches. The recalled furniture has the following SKU numbers printed on a label located on the underside of the table or desk and on the product's order receipt: Style Description SKU Byron Reeded Stone Dining Table 72\" Dining Table, Spanish Nero Marquina Marble 10138977BLMB 72\" Dining Table, Brown Emperador Marble 10138977EMPR 72\" Dining Table, Italian Classico Travertine 10138977NATT 84\" Dining Table, Spanish Nero Marquina Marble 10138969BLMB 84\" Dining Table, Brown Emperador Marble 10138969EMPR 84\" Dining Table, Italian Classico Travertine 10138969NATT 96\" Dining Table, Spanish Nero Marquina Marble 10138970BLMB 96\" Dining Table, Brown Emperador Marble 10138970EMPR 96\" Dining Table, Italian Classico Travertine 10138970NATT 96\" Dining Table, Brown Emperador Marble 10215310EMPR 108\" Dining Table, Spanish Nero Marquina Marble 10138968BLMB 108\" Dining Table, Brown Emperador Marble 10138968EMPR 108\" Dining Table, Italian Classico Travertine 10138968NATT 120\" Dining Table, Spanish Nero Marquina Marble 10138978BLMB 120\" Dining Table, Brown Emperador Marble 10138978EMPR 120\" Dining Table, Italian Classico Travertine 10138978NATT Style Description SKU Byron Reeded Stone Desk 60\" Desk, Spanish Nero Marquina Marble 10155834BLMB 60\" Desk, Brown Emperador Marble 10155834EMPR 60\" Desk, Italian Classico Travertine 10155834NATT 72\" Desk, Spanish Nero Marquina Marble 10155831BLMB 72\" Desk, Brown Emperador Marble 10155831EMPR 72\" Desk, Italian Classico Travertine 10155831NATT Style Description SKU Byron Emperador Dining Table 72\" Dining Table, Greige Oak/Gold Emperador Marble 10201126GREM 72\" Dining Table, Natural Oak/Gold Emperador Marble 10201126NTEM 84\" Dining Table, Greige Oak/Gold Emperador Marble 10201128GREM 84\" Dining Table, Whitewashed Oak/Gold Emperador Marble 10201128WTEM 96\" Dining Table, Greige Oak/Gold Emperador Marble 10201129GREM 96\" Dining Table, Light Oak/Gold Emperador Marble 10201129LTEM 108\" Dining Table, Black Oak/Black Emperador Marble 10201130BLEM 108\" Dining Table, Greige Oak/Gold Emperador Marble 10201130GREM 108\" Dining Table, Natural Oak/Gold Emperador Marble 10201130NTEM",
      "timestamp": "2025-10-16T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Byron Emperador Tables and Byron Reeded Stone Tables and Desks"
    },
    {
      "id": 10441,
      "text": "Super Wheels (Formerly Allite) Recalls Vaast A/1 Bicycles and Frames Due to Fall Hazard — This recall involves Vaast A/1 bicycles and framesets. There are 35 bicycle models and 15 different frameset models. The bikes were sold in Berry Red, Sea Blue, Matte Black, and Black Forest Green paint colors. The frames have the \"VAAST\" logo on both sides of the upper section of the down tube. Serial numbers can be found underneath the bike frame on the bottom bracket. The phrase \"Model A/1\" is on the bike frame - left side rear seat. Serial numbers for the affected bicycles or frames: WAWAK0001 through WAWAK0062 WAWAL0001 through WAWAL0600 WAWAA0001 through WAWAA0474 WAWAB0001 through WAWAB0020 WAWBH0001 through WAWBH0999 WAWBD0001 through WAWBD0170 WAWCF0001 through WAWCF0280 WAWCK0001 through WAWCK0450 WAWCA0001 through WAWCA0999 VFA1M0011 through VFA1M0015",
      "timestamp": "2025-10-16T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Vaast A/1 bicycles and frames"
    },
    {
      "id": 10431,
      "text": "Textron E-Z-GO Recalls Personal Transportation Vehicles Due to Risk of Serious Injury and Fire Hazard — This recall involves E-Z-GO's model year 2020 through 2025 RXV Freedom and 2023 through 2025 Valor PTVs with serial numbers ranging from 5538278 through 5920722; and model year 2020 through 2022 TXT Freedom and Valor PTVs with serial numbers ranging from 3455024 through 3582057. The vehicle's serial number is printed near the base of the steering column for RXV and model year 2023, 2024 and 2025 Valor vehicles. The serial number is printed below the operator seat position for TXT and model year 2020, 2021 and 2022 Valor vehicles. These vehicles are commonly referred to as golf carts or golf cars and are used primarily to transport people.",
      "timestamp": "2025-10-16T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "E-Z-GO Personal Transportation Vehicles (PTVs)"
    },
    {
      "id": 10436,
      "text": "VESTA.DS Recalls VST Brand Tankless Water Heaters Due to Carbon Monoxide (CO) Poisoning Hazard and Risk of Serious Injury and Death — This recall involves VST-brand residential wall-mounted gas boilers, Series VT, VR, and VR Plus, with model numbers VRS-150, VRS-199, VRP-150, VRP-199, VRS Plus-150, VRS Plus-199, VRP Plus-150, VRP Plus-199, VTS-150, VTS-199, VTP-150, and VTP-199. The white label on the side of the boiler has the model number bolded, near the top of the label. The boilers are metal, rectangular units and have either VST printed in white on the control panel near the bottom, or VESTA.DS.Inc. printed in gray near the top of the panel.",
      "timestamp": "2025-10-16T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "VST gas-fired tankless water heaters"
    },
    {
      "id": 10439,
      "text": "Wilteexs Bioethanol Fuel Bottles Recalled Due to Risk of Serious Injury or Death from Flash Fire; Violates Mandatory Standards for Portable Fuel Containers and Hazardous Substances; Imported by Wilteexs — This recall involves Wilteexs-branded bottles of bioethanol used for tabletop fire pits, fireplaces, stoves and burners. The 1.06 quarts/1liter clear bottles come pre-filled with fuel. \"WILTEEXS,\" \"BIO ETHANOL\" and an image of a burning flame are printed in blue and white on the front of the bottles. \"X004IQ9ZCH\" is printed below the barcode on the back of the bottles. Note: Recalled ethanol should be disposed of in accordance with any local and state regulations, contact your local hazardous waste treatment center or inquire about professional recycling points through the environmental protection agency. Do not dispose of ethanol in sewers, rainwater pipes or ordinary garbage cans to avoid causing fires or environmental pollution.",
      "timestamp": "2025-10-16T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Wilteexs Bioethanol Fuel Bottles"
    },
    {
      "id": 10432,
      "text": "WLIVE Fabric 12-Drawer Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment; Violates Mandatory Standard for Clothing Storage Units; Sold on Amazon by WLIVE — This recall involves WLIVE Fabric 12-drawer dressers. The recalled dressers were sold in charcoal black, charcoal black wood grain, black rustic brown, dark grey, light grey, rustic brown wood grain print, and white and have a metal frame and wooden top and 12 collapsable fabric drawers. The dressers measure about 39 inches by 12 inches by 48 inches and weigh 35 pounds. \"ASNG092\" is printed on the product packaging.",
      "timestamp": "2025-10-16T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "WLIVE Fabric 12-Drawer Dressers"
    },
    {
      "id": 10437,
      "text": "Yamaha Recalls Model Year 2017-2024 Golf Car Vehicles Due to Risk of Serious Injury or Death from Crash Hazard — This recall includes model year 2017-2024 DR2A and DR2E Personal Transportation Vehicles (PTVs) with serial numbers that begin with J0D, J0E, and J2D. The recalled golf car vehicles were sold in a variety of colors. The serial number is located on the handlebars on the left side of the rear row of seats of the vehicle.",
      "timestamp": "2025-10-16T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Model Year 2017-2024 Yamaha Golf Car Vehicles"
    },
    {
      "id": 10438,
      "text": "Yamaha Recalls Model Year 2021-2025 Golf Car Vehicles Due to Risk of Serious Injury or Death from Crash Hazard — This recall includes model year 2021-2025 Drive 2 Personal Transportation Vehicles (PTVs) Gas/Electric golf car vehicles. The recalled golf car vehicles were sold in a variety of colors. The following models and serial number ranges are included in this recall. The model name/number is located on the left and right side of the vehicle. Serial numbers are in various locations depending on the vehicle model. If you are unable to locate your serial number, contact Yamaha for assistance. Serial Number Range Model Year Prefix Min Max 2021 J2D 0000625 0000880 2022 J0D 0513701 0514498 J0E 0502001 0502134 J2D 0000601 0000870 J5C 0001010 0001400 2023 J0D 0600116 0607700 J0E 0600111 0601578 J2D 0000621 0000900 J5C 0100104 0101695 2024 J0D 0700101 0706200 J0E 601049 0701289 J2D 200101 0200199 J5C 200102 0201000 2025 J0D 0800101 0806600 J0E 0800101 0800328 J2D 0200162 0200183 J5C 0200166 0300281",
      "timestamp": "2025-10-16T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Model Year 2021-2025 Yamaha Golf Car Vehicles"
    },
    {
      "id": 10427,
      "text": "Bellabu Bear Recalls Children's Robes Due to Burn Hazard; Violates Mandatory Standards for Children's Sleepwear — This recall involves Bellabu Bear's collection of bamboo sherpa children's robes. The recalled robes are long-sleeved and were sold in the following prints: PAW Patrol, Garfield, Minecraft, Minions, Batman, Justice League, Wonder Woman, Blaze and the Monster Machines, Trolls, Dora, Nutcracker, hearts, Santa, stripes, bows and dragons. The robes have sherpa lining, two front pockets and a matching belt and were sold in children's sizes S/M and M/L. \"Bellabu Bear,\" \"BB-NW12109\" and the size are printed on the robe's neck label.",
      "timestamp": "2025-10-09T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Bellabu Bear Children's Robes"
    },
    {
      "id": 10421,
      "text": "Calico Brands Recalls Scripto Premium Torches Due to Risk of Injury or Death from Fires and Burns; Violates Mandatory Standard for Multipurpose Lighters — This recall involves the Scripto® Premium Torch which has a four-position adjustable metal nozzle, adjustable flame, hands free operation lock, black ergonomic non-slip rubber grip, and a metal base with black velvet on the bottom. The UPC number \"0-70257-52226-6\" is printed on the back of the product box.",
      "timestamp": "2025-10-09T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Scripto® Premium Torch"
    },
    {
      "id": 10430,
      "text": "Children's LED Tutu Skirts Recalled Due to Risk of Serious Injury or Death from Battery Ingestion; Violates Mandatory Standard for Consumer Products with Coin Batteries; Sold on Amazon by Bmrwtg — This recall involves Bmrwtg LED Tutu Skirts. The recalled skirts were sold in pink, purple, yellow, red, blue, green, white and black, and have silver circles and stars that light up. The lights' battery compartment has two CR2032 lithium coin batteries. The skirts were marketed for children ages 2 through 8.",
      "timestamp": "2025-10-09T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Bmrwtg LED Tutu Skirts"
    },
    {
      "id": 10424,
      "text": "EcoFlow Technology Recalls Delta Max 2000 Power Stations Due to Risk of Serious Burn Injury and Fire Hazard — This recall involves EcoFlow Delta Max 2000 Model EFD310 Power Stations. The recalled power stations are black and silver, with a rectangular LCD display screen on the front and six electrical outlets on the back. \"ECOFLOW MAX\" is printed on the right side. \"EFD310\" and \"EcoFlow DELTA Max (2000)\" are printed on the nameplate on the underside of the product.",
      "timestamp": "2025-10-09T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "EcoFlow Delta Max 2000 Power Stations"
    },
    {
      "id": 10425,
      "text": "ESR HaloLock Wireless Power Banks Recall Expanded to Include Additional Model Due to Risk of Serious Burn Injury and Fire Hazard Due to Fire and Burn Hazards; Distributed by Waymeet — This recall expansion includes ESR HaloLock wireless power banks with model number 2G505, in addition to models 2G520, 2G505B and 2G512B, which were previously recalled. \"ESR\" is printed on the back and the model numbers are printed on the right side of the pocket-size power banks. Model 2G505 was sold in black and white. Models 2G520, 2G505B and 2G512B were sold in dark blue, light blue, gray, white and black. All recalled models have five circular LED display lights on one side.",
      "timestamp": "2025-10-09T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "ESR HaloLock Wireless Power Banks"
    },
    {
      "id": 10426,
      "text": "Generic Magnetic Ball Sets Recalled Due to Risk of Serious Injury or Death from Magnet Ingestion; Violates Mandatory Standard for Toys; Sold on Amazon by Ritons — This recall involves Generic magnetic ball sets. This recall involves sets of 1,000 multi-colored 3 mm (0.1 inch) magnetic balls that are separable and have a strong magnetic flux. The magnets are encased in clear, plastic packaging and have \"1000 Magnets\" and \"3MM\" printed on the front of the packaging.",
      "timestamp": "2025-10-09T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Generic Magnetic Balls 1000pcs"
    },
    {
      "id": 10423,
      "text": "Living Glow Portable Waist Fans Recalled Due to Fire Hazard; Manufactured by Guangzhou Jiguang Lighting; Sold by HSN — The recall includes the Living Glow five-in-one portable waist fan (model number CP-WFLED01). The model number is found on the label on the back of the fan. The recalled waist fan features five fan speeds, a three-mode flashlight and could be used as a power bank. The recalled fans were sold in gray, white, aqua, coral, red, and sage green. They feature a metal clip for attaching to a belt and a strap for wearing around the neck. The fans measure about 3.6 inches wide by 4 inches tall.",
      "timestamp": "2025-10-09T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Living Glow portable waist fan"
    },
    {
      "id": 10428,
      "text": "Mom Genius Recalls Retractable Safety Gates Due to Risk of Serious Injury or Death from Entrapment; Violates Mandatory Standard for Gates and Enclosures — This recall involves Mom Genius Retractable Safety Gates. The safety gate comes in black and gray and has a retractable mesh screen in between metal frames. The gates measure about 33 inches high, with a retractable width up to 118 inches. \"Retractable Safety Gate\" and model number \"SH.20.006B02\" are printed on a white label located on the side of the gate.",
      "timestamp": "2025-10-09T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Mom Genius Retractable Safety Gates"
    },
    {
      "id": 10422,
      "text": "Tempo USA Recalls Ambiano Electric Pressure Cookers Due to Serious Burn Hazard, Multiple Burn Injuries Reported; Sold at ALDI — This recall involves all Ambiano electric pressure cookers with model numbers 93550 (KY-318B), 96775 (KY-318A), and 98527 (6L-PC). The electric pressure cookers and inner cooker pots are either six-quart or eight-quart capacity. The brand name Ambiano appears on the front of each unit and on its permanent on-product label. The model number of the recalled pressure cookers is also printed on the permanent product label on the bottom of the cooker.",
      "timestamp": "2025-10-09T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Ambiano Electric Pressure Cookers"
    },
    {
      "id": 10429,
      "text": "YGJT Baby Loungers Recalled Due to Risk of Serious Injury or Death from Entrapment and Fall; Violates Mandatory Standard for Infant Sleep Products; Sold on SHEIN by YGJT Local Warehouse — This recall involves YGJT baby loungers. The recalled baby loungers are made of a foam sleeping pad and padded bumpers with a cloth cover. The baby loungers are white and light blue with rainbows and bears on the cover. \"YGJT\" is printed on an attached label on the outside of the baby lounger's cover.",
      "timestamp": "2025-10-09T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "YGJT Baby Loungers"
    },
    {
      "id": 10418,
      "text": "Blossom Recalls Children's Loungewear Due to Serious Risk of Injury or Death from Burns; Violates Mandatory Standard for Children's Sleepwear — This recall involves Blossom-branded children's two-piece loungewear sets. The recalled loungewear sets consist of a short-sleeved or long-sleeved, button-up shirt with a front pocket and matching shorts or pants. The short-sleeved sets were sold in white, navy, light blue, light pink and lilac; and in four designs: fireworks, multi-stripes, tulips, and sailboats. The long-sleeved sets come in two designs, letter to Santa and Santa paws. The loungewear sets were sold in children's sizes 12M through 12Y. \"Blossom\" and the size are printed on the sewn-in neck label.",
      "timestamp": "2025-10-02T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Blossom Children's Loungewear sets"
    },
    {
      "id": 10420,
      "text": "Dissolved Oxygen Test Kits Recalled Due to Risk of Serious Injury or Death from Poisoning to Young Children; Violates Mandatory Standard for Child-Resistant Packaging; Sold on Amazon by Almpal — This recall involves Almpal dissolved oxygen test kits. The test kits come in a cream-colored box bearing a white label with \"Dissolved Oxygen Test Kit\" and the manufacture date, batch number, and expiration date printed on it.",
      "timestamp": "2025-10-02T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Dissolved Oxygen Test Kits"
    },
    {
      "id": 10419,
      "text": "Gunaito 10-Drawer Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment Hazards; Violates Mandatory Standard for Clothing Storage Units; Sold on Walmart.com by Gunaito — This recall involves Gunaito 10-drawer dressers in brown and white. The recalled dressers have a metal frame, a wooden top, 10 collapsing fabric drawers of different sizes with pull knobs, and four side-pockets. The dressers measure about 39 inches by 39 inches by 12 inches and weigh about 30 pounds. \"HD006BN-SLCD\" or \"HD006WH-SLCD\" is printed on the product packaging.",
      "timestamp": "2025-10-02T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Gunaito 10-Drawer Dressers"
    },
    {
      "id": 10416,
      "text": "In Motion Design Recalls Evermore Surprise Eggs Due to Risk of Serious Injury; Violates Federal Lead Content Ban — This recall involves Evermore Surprise Eggs with yellow, pink or green wrap. The Surprise Eggs are gold and contain seven different toys including a toy airplane.",
      "timestamp": "2025-10-02T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Evermore Surprise Eggs"
    },
    {
      "id": 10417,
      "text": "Zyntony Recalls Kogalla Power Banks Due to Fire and Burn Hazards; Sold on Kogalla.com — This recall involves Kogalla-branded power banks, models BP125, BatPak 2F and BatPak 3F. The recalled rechargeable USB power banks have 6,700mAh, 13,400mAh or 20,100mAh lithium-ion batteries and were sold separately and included with Kogalla trail lights. The Kogalla logo is printed on the front of the power banks. The model number appears on the back of the power banks. Power banks model BP125 have a black USB-A jack and models BatPak 2F and 3F have orange USB-A jacks. Note: Do not throw this recalled lithium-ion battery or device in the trash, the general recycling stream (e.g., street-level or curbside recycling bins), or used battery recycling boxes found at various retail and home improvement stores. Recalled lithium-ion batteries must be disposed of differently than other batteries, because they present a greater risk of fire. Your municipal household hazardous waste (HHW) collection center may accept this recalled lithium-ion battery or device for disposal. Before taking your battery or device to a HHW collection center, contact them ahead of time and ask whether it accepts recalled lithium-ion batteries. If they don’t, contact your municipality for further guidance.",
      "timestamp": "2025-10-02T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "BP125, BatPak 2F and BatPak 3F Power Banks"
    },
    {
      "id": 10412,
      "text": "AMTRADING Recalls Hoovy Cooling Gel Insert Pads for Car Seats and Strollers Due to Burn Hazard — This recall involves black Cooling Gel Insert Pads for strollers or car seats and contain an inner cooling layer that is activated by a child's weight. The Hoovy logo appears in white on the bottom right corner of the product. The recalled cooling pads are approximately 16.5 inches long by 14.25 inches wide.",
      "timestamp": "2025-09-25T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Hoovy Cooling Gel Insert Pads for Car Seats and Strollers"
    },
    {
      "id": 10414,
      "text": "Autoez Brand Bamboo Shades Recalled Due to Strangulation and Entanglement Hazards and Risk of Serious Injury or Death; Violates Federal Rule for Window Coverings; Sold on Walmart.com — This recall involves Autoez-branded bamboo shades. The recalled bamboo shades were sold in brown, with sizes ranging from 24 to 72 inches wide and 64 to 72 inches high. \"Autoez\" is printed on the sticker label on the top rail of the shade.",
      "timestamp": "2025-09-25T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Autoez Bamboo Shades"
    },
    {
      "id": 10413,
      "text": "Mad Rabbit Recalls \"RELIEVE\" Lidocaine Numbing Cream Due to Risk of Serious Injury or Death from Poisoning to Young Children; Violates Mandatory Standard for Child-Resistant Packaging — This recall involves \"RELIEVE\" numbing cream. The cream comes in a short wide-mouthed white container. A label is located on the front with black lettering and \"RELIEVE\" in large type and the company's logo and \"Mad Rabbit\", \"Numbing Cream\" and \"Menthol\" in smaller type.",
      "timestamp": "2025-09-25T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "RELIEVE Numbing Cream"
    },
    {
      "id": 10415,
      "text": "Persilux Brand Zebra Blinds Recalled Due to Strangulation and Entanglement Hazards and Risk of Serious Injury or Death; Violates Federal Rule for Window Coverings; Sold on Amazon — This recall involves Persilux-branded zebra blinds. The recalled stock blinds were sold in beige, black, dark gray, light gray and white, with sizes ranging from 22 to 73 inches wide and 64 to 72 inches high. \"Persilux and \"Zebra Blinds\" is printed on the product packaging. \"X003FFPT63\" is printed on the barcode label.",
      "timestamp": "2025-09-25T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Persilux Zebra Blinds"
    },
    {
      "id": 10411,
      "text": "Sunbeam Products Recalls More than One Million Oster French Door Countertop Ovens Due to Burn Hazard — This recall involves Oster French Door Countertop Ovens with model numbers TSSTTVFDXL, TSSTTVFDDG, TSSTTVFDMAF and TSSTTVFDDAF. The recalled ovens have a spring-loaded bilateral door made of glass with metal handles. A label on the backside of the oven identifies the model number. In addition, the original packaging has information identifying the model number. The four models differ in cooking options (e.g., air fryer) and control types (analog dials or digital push-button controls). \"Oster\" is engraved on the front bottom right of the oven.",
      "timestamp": "2025-09-25T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Oster French Door Countertop Ovens"
    }
  ]
}