{
  "source": "cpsc",
  "topic_id": "hydration-bottles-problems",
  "fetched_at": "2026-02-09T07:14:54.000Z",
  "items": [
    {
      "id": 10607,
      "text": "Andy & Evan Recalls Children's Pajama Sets Due to Risk of Serious Injury or Death from Burn Hazard; Violate Mandatory Standard for Children's Sleepwear — This recall involves Andy & Evan-branded children's pajama sets. The recalled woven pajamas consist of a long-sleeved shirt with buttons, a front pocket and matching flared pants. The pajamas were sold in pink with white stripes and purple and pink hearts with trim in children's sizes 2T, 3T, 4T, 5, 6 and 6X. \"Andy & Evan\" and the size are printed on the sewn-in neck label. \"RN# 136762\" and \"YC05\" are printed on the sewn-in side seam label.",
      "timestamp": "2026-02-05T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Andy & Evan Children's Pajama Sets"
    },
    {
      "id": 10601,
      "text": "Aterian Recalls PurSteam Elite Travel Steamers and Mighty Lil Steamers Due to Risk of Serious Burn Injury — This recall involves PurSteam Elite Travel Steamers and PurSteam Mighty Lil Steamers purchased after December 2020 or with one of the following date codes: 2310, 2308, 2305, 2304, 2303, 2212, 2211, 2210, 2203, 2112, 2111, 2110, 0221, 1019, and 4619. The PurSteam Elite Travel Steamer is white with a triangular-shaped opening for the steam vents. The \"PurSteam\" logo is printed below a wave-shaped water reservoir window, and \"Model: PS-510\" is printed on a label on the bottom of the product. The PurSteam Mighty Lil Steamer is white with an oblong-shaped opening for the steam vents. The \"PurSteam\" logo is printed below the water reservoir window, and \"Model: PS 550\" is printed on a label on the bottom of the product. On both steamer models, the manufacture date (date code) is located on a label on the bottom of the product in YYMM format.",
      "timestamp": "2026-02-05T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "PurSteam Mighty Lil Steamers and PurSteam Elite Travel Steamers"
    },
    {
      "id": 10604,
      "text": "Clark Associates Recalls Lancaster Table & Seating Powder-Coated Aluminum Outdoor Restaurant Chairs and Barstools Due to Fall Hazard — This recall involves three models of Lancaster Table & Seating Powder-Coated Aluminum Outdoor Chairs and Barstools in arm chair, side chair (no arms) and barstool configurations sold under 180 item numbers. The chairs and barstools were sold in blue, brown, dark gray, light gray/silver, red, white, aqua, black, green, sangria/burgundy, yellow and orange. The chairs were sold with and without accompanying outdoor tables, which are not subject to the recall. The item numbers can be found on order confirmation emails, shipping confirmation emails and invoices. A full list of affected item numbers and examples of colors are available at www.webstaurantstore.com/uploads/Clark_Associates/2026/1/lts-recall-list-of-affected-products-1.pdf.",
      "timestamp": "2026-02-05T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Lancaster Table & Seating Powder-Coated Aluminum Outdoor Chairs and Barstools"
    },
    {
      "id": 10605,
      "text": "Cobelae Busy Books Recalled Due to Risk of Serious Injury or Death from Choking Hazard; Violates Small Parts Ban; Sold on Amazon by Flyindream — This recall involves Cobelae Busy Book, model: 2025-Q3-0702. The Busy Book has a yellow and brown giraffe on the front cover. The apple on page eight of the books includes a string of beads. There are no markings on the book.",
      "timestamp": "2026-02-05T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Cobelae Busy Book for Toddlers"
    },
    {
      "id": 10600,
      "text": "Dresbe LED Christmas Headbands Recalled Due to Risk of Serious Injury or Death from Battery Ingestion; Violate Mandatory Standard for Consumer Products with Button Cell Batteries — This recall involves Dresbe LED Christmas Headbands. The headbands were sold as a two-pack of novelty headbands, one red headband with candy cane attachments and a green headband with a Christmas tree attachment, each containing three button cell batteries to power LED lights. The headbands have \"HB-052\" and \"DRESBE LED Christmas Headband (2pc)\" printed on labels located on the package.",
      "timestamp": "2026-02-05T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Dresbe LED Christmas Headbands"
    },
    {
      "id": 10606,
      "text": "EnHomee 10-Drawer Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment Hazards; Violates Mandatory Standard for Clothing Storage Units — This recall involves EnHomee 10-Drawer Dressers. The recalled dressers were sold in the following colors: black, white, grey, and brown. They have a metal frame, wooden top, 10 collapsable fabric drawers, and two metal drawers. The dressers are 38 inches long by 11.8 inches wide by 48.1 inches tall. Model number \"55SCWMSCXLBR\" can be found on the order information within your Amazon account.",
      "timestamp": "2026-02-05T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "EnHomee 10-Drawer Dressers"
    },
    {
      "id": 10599,
      "text": "Fixwal 7-Drawer Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment Hazards; Violates Mandatory Standard for Clothing Storage Units — This recall involves the Fixwal 7-Drawer Dressers. The recalled dressers were sold in black and white and have a metal frame, wooden top, and seven collapsable fabric drawers. The dressers are 55.1 inches long by 11.8 inches wide by 31.5 inches tall.",
      "timestamp": "2026-02-05T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Fixwal 7-Drawer Dressers"
    },
    {
      "id": 10598,
      "text": "Furnulem 5-Drawer Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment; Violates Mandatory Standard for Clothing Storage Units — This recall involves Furnulem five-drawer dressers. The wooden, white dressers measure about 31.5 inches tall, 15.75 inches long and 50.2 inches wide. They have a top with recessed power outlets, and each drawer has two round pull knobs. Only dressers that did not come with feet extensions are included in this recall. Model \"HK-DS-017-CL-5D-1-W\" is printed on the packaging.",
      "timestamp": "2026-02-05T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Furnulem 5-Drawer Dressers"
    },
    {
      "id": 10596,
      "text": "GM Gumili Wintergreen Essential Oil Bottles Recalled Due to Risk of Serious Injury or Death from Child Poisoning; Violates Mandatory Standard for Child-Resistant Packaging; Sold on Amazon by Gumili Beauty — This recall involves GM Gumili Wintergreen Essential Oil. The essential oil was sold in an amber glass bottle with a black screw-on cap and a white label with the \"GM\" logo, \"gumili,\" \"wintergreen essential oil\" and an image of a wintergreen plant. The packaging box is white with blue text with the \"GM\" logo, \"gumili,\" \"essential oil\" and \"100% pure & natural\" on the front. The back of the box has directions, safety instructions and the manufacturer's information. A black dropper cap was included with the oil.",
      "timestamp": "2026-02-05T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "GM Gumili Wintergreen Essential Oil Bottles"
    },
    {
      "id": 10597,
      "text": "Kitosun Submersible LED Lights Recalled Due to Risk of Serious Injury or Death from Battery Ingestion; Violates Mandatory Standard for Consumer Products with Coin Batteries — This recall involves Kitosun Submersible LED Lights. The LED lights include 10 color-changing LED lights, two remote controls, 20 preinstalled CR2450 lithium batteries in the lights and four preinstalled CR2032 lithium batteries in the remote controls. Each light is about 3.5 cm in diameter. Note: Button cell and coin batteries are hazardous. Batteries should be disposed of or recycled by following local hazardous waste procedures.",
      "timestamp": "2026-02-05T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Kitosun Submersible LED Lights"
    },
    {
      "id": 10594,
      "text": "Little Cow Company Recalls 9 oz Candles in Glass Jars Due to Fire, Burn and Laceration Hazards — This recall involves \"Little Cow Co.\" candles in glass jars with screw top lids. The recalled candles were sold in 9 oz glass jars with a sticker with the brand name \"Little Cow Co.\" located on the center of the front of the glass jar. The sticker also says \"100% natural soy wax candle, laced with organic butter.\"",
      "timestamp": "2026-02-05T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Little Cow Co. 9 oz candles in glass jars"
    },
    {
      "id": 10593,
      "text": "Lola Plus The Boys Recalls Youth Clothing with Drawstrings Due to Risk of Serious Injury or Death from Strangulation Hazard; Violates Federal Rule for Children's Upper Outerwear — This recall involves five styles of Lola + The Boys hooded clothing with drawstrings: -The Candy Heart Tie Dye set consists of pink and white pants and a sweatshirt. Both have a yellow drawstring with beads, and the sweatshirt has a heart on the front. -The Hoodie Unicorn Tutu set consist of a rainbow organza skirt and a purple hoodie sweatshirt with a unicorn on the front. -The Justice League Hero hoodie is gray and has a front pocket and superhero decals along the right sleeve. -The Emoji Love hoodie sweatshirt is white and has a pocket and three smiley emojis on the front. -The Crystal Rainbow Rain hoodie is gray and has a front pocket and rainbow-colored beads at both ends of the drawstrings. The clothing was sold in youth sizes 1 through 12. \"Lola + The Boys\" and the size are printed on the neck label.",
      "timestamp": "2026-02-05T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Lola + The Boys Youth Clothing with Drawstrings"
    },
    {
      "id": 10595,
      "text": "Organic Zing Birch Essential Oil Bottles Recalled Due to Risk of Serious Injury or Death from Child Poisoning; Violates Mandatory Standard for Child-Resistant Packaging; Sold on Amazon by Linkers — This recall involves Organic Zing Birch Oil bottles. The recalled essential oil's amber bottles have black continuous thread caps and a beige and green label with white and black labeling. The Organic Zing logo, \"Birch Oil\" and \"Pure & Natural\" are printed on the front of the bottle. The Organic Zing logo and \"Pure & Natural\" are printed on the front of the bottles' beige and green box packaging and \"Made in India\" on the back.",
      "timestamp": "2026-02-05T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Organic Zing Birch Oil Bottles"
    },
    {
      "id": 10592,
      "text": "Semfri Children's Helmets Recalled Due to Risk of Serious Injury or Death from Head Injury; Violates Mandatory Standard for Bicycle Helmets — This recall involves Semfri-branded children's multi-purpose helmets. The recalled helmets were sold in size medium (M), fitting a head circumference of about 20.5 to 22.8 inches; and in the following colors: orange, black, blue, navy blue, pink, red and white. All helmets have black padding, black straps and a black buckle. The helmets have a black plastic knob at the back of the helmet for adjusting the fitting. The size is printed on a black circular label located inside of the helmet.",
      "timestamp": "2026-02-05T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Semfri Children's Helmets"
    },
    {
      "id": 10591,
      "text": "Shintenchi 6-Drawer Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment Hazards; Violate Mandatory Standard for Clothing Storage Units — This recall involves Shintenchi-branded dressers. The recalled, white dressers have six wooden drawers and golden metal feet and measure about 15.7 inches deep by 47.2 inches wide by 30.5 inches high. \"SHX12077-WH\" is embossed on the underside of the dresser at the top of one metal foot and on the product packaging.",
      "timestamp": "2026-02-05T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Shintenchi 6-Drawer Dressers"
    },
    {
      "id": 10602,
      "text": "YITA Recalls Multiple Brands of Dressers Due to Risk of Serious Injury or Death from Tip-Over and Entrapment Hazards; Violates Mandatory Standard for Clothing Storage Units — This recall involves the five different brands of YITA dressers: Dextrus, ModFusion, Uforic, Yintatech and Yitahome. The 16-drawer dressers were sold in gray, black, white, pink and brown. They have a black or white metal frame, a wooden top and collapsable fabric drawers; and measure about 37.4 inches long, 11.8 inches wide and 57.1 inches tall. SKU numbers FTBFSD-0161, FTBFSD-0162, FTBFSD-0212, FTBFSD-0246 or SKU FTBFSD-0465 is printed on labels located on the dresser's top panel and on the product packaging. The brand name can be found on the product online listing.",
      "timestamp": "2026-02-05T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Yitahome, Uforic, Dextrus, Yintatech and ModFusion-branded Dressers"
    },
    {
      "id": 10590,
      "text": "Zan International Trading Recalls Lotus Joy Sweet Birch Essential Oil Bottles Due to Risk of Serious Injury or Death from Child Poisoning; Violates Mandatory Standard for Child-Resistant Packaging — This recall involves Lotus Joy Organic Sweet Birch Essential Oil bottles. The essential oil comes in 0.34 fluid ounce amber bottles with a black cap and a separate glass dropper with a black cap. The white label on the bottle has orange and black text with \"LotusJoy\", \"organic\", \"sweet birch\", \"essential oil and \"betula lenta\" printed on the front and ingredients and directions on the back. The packaging box is blue and has the same information as the front of the bottle in orange and black lettering and has directions and the distributor's information on the back.",
      "timestamp": "2026-02-05T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Lotus Joy Organic Sweet Birch Essential Oil Bottles"
    },
    {
      "id": 10603,
      "text": "Scepter Fuel Containers Recalled Due to Risk of Serious Injury or Death from Flash Fire, Burn and Child Poisoning; Violates Mandatory Standards for Portable Fuel Containers; Imported by Mameix Retail — This recall involves Scepter B62 gas and oil fuel containers. The recalled combination fuel containers are red with black caps and yellow spouts on each end. They have dual chambers with a 6-liter gas capacity on one side and 2.5-liter oil capacity on the other. \"Scepter\" and \"Essence Danger\" are embossed on the side of the container.",
      "timestamp": "2026-02-04T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Scepter Gas and Oil Combination Fuel Containers"
    },
    {
      "id": 10579,
      "text": "AiTuiTui Pull String Teething Toys Recalled Due to Risk of Serious Injury or Death from Choking; Violate Mandatory Standard for Toys; Sold on Amazon by Vanfun — This recall involves the AiTuiTui Pull String Teething Toy. The teething toy is an off-white disc shape with either a red ball or blue ball in the middle and six long pull string \"tentacles\" of various colors running through the ball. There are also three free-spinning rings on one side and soft push buttons on the disc. \"Model: 688-59\" is printed on the product packaging.",
      "timestamp": "2026-01-29T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "AiTuiTui Pull String Teething Toys"
    },
    {
      "id": 10588,
      "text": "Bazic Products Recalls Bazic Silicone Glue Due to Risk of Serious Injury or Death from Child Poisoning; Violates Mandatory Standard for Child Resistant Packaging and FHSA Labeling Requirements — This recall involves Bazic Silicone Glue, Model 2030. The glue comes in a transparent plastic bottle with a blue nozzle top and a blue and black wraparound label bearing instructions and warning statements. The glue's label reads \"Bazic\", \"Silicone Glue\", and \"Clear Adhesive Sealant\" on the front, with cautionary statements and \"2030\" above the barcode on its side. Only Bazic Silicone Glue with batch code \"V01233-031725-70004523\" printed on the side of the bottles are included in the recall.",
      "timestamp": "2026-01-29T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Bazic Silicone Glue"
    },
    {
      "id": 10589,
      "text": "Gazelle USA Recalls Urban Arrow FamilyNext Pro Cargo E-Bikes Due to Injury Hazard — This recall involves Urban Arrow FamilyNext Pro Cargo E-Bikes with Fidlock buckles. The recalled bicycle comes in one size and comes in green and black. The frame of the bicycle is made of aluminum with a reinforced foam (EPP) cargo box. The bicycle is 105\" in length and 28\" wide. \"Urban Arrow\" is imprinted on the bottom of the cargo box.",
      "timestamp": "2026-01-29T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Urban Arrow FamilyNext Pro Cargo E-Bikes"
    },
    {
      "id": 10584,
      "text": "Hobby Lobby Recalls Giraffe and Llama Plush Toys with Clips Due to Choking Hazard — This recall involves a Giraffe Plush Toy with clip and a Llama Plush Toy with clip. The Giraffe with clip has a yellow body with a yellow claw clip. The legs of the giraffe are orange and blue with various colored paws. The ears are black and white animal print. The Giraffe measures about nine inches long. The Giraffe has \"HL699436 or HL731481\" printed on the white sewn-in label. The hang tag on the Giraffe has \"2553675\" printed on the front left corner. The Llama with clip has a white body with a green claw clip. The body has a mirror and orange triangle teether attached to the body. The legs of the Llama are orange and yellow with various colored paws. The Llama measures about 12 inches long. \"HL699436\" is printed on the white sewn-in label attached to the body. The hang tag on the plush has \"2553634\" printed on the front left corner.",
      "timestamp": "2026-01-29T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Giraffe Plush Toy with clip, Llama Plush Toy with clip"
    },
    {
      "id": 10585,
      "text": "Hobby Lobby Recalls Giraffe and Llama Plush Toys with Clips Due to Drowning Hazard; Manufactured by Starmatrix Group Drowning Hazard; Manufactured by Starmatrix Group — This recall involves all Sunneday and Blue Bay brand above-ground pools 48 inches and taller. Model information and the Sunneday or Blue Bay logo are printed on the liner on the outside of the pool. Pool models subject to this recall include: Model Description UPC Code 70018 Sunneday Oasis Cottage 18'x52\" 850022858529 70024 Sunneday Oasis Cottage 24'x52\" 850022858536 358015W Blue Bay Softsided Pool 15'x48\" 191127003583 359015G Blue Bay Softsided Pool 15'x48\" 191127003590 360018W Blue Bay Softsided Pool 18'x52\" 191127003606 361018G Blue Bay Softsided Pool 18'x52\" 191127003613 380018T Blue Bay Softsided Pool 18'x52\" 191127003804 The recalled above-ground pools contain a compression strap (also referred to as a reinforcing belt) that wraps around the pool on the outside of the vertical support poles, and may create a foothold, allowing a child to access the pool and drown. Children can still gain access to the pools using these footholds even if the ladder is removed. CPSC's website www.PoolSafely.gov has free, downloadable educational materials available to the public on pool safety including information on barriers, covers, alarms and other safety information.",
      "timestamp": "2026-01-29T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Sunneday and Blue Bay brand 48-inch and taller above-ground pools"
    },
    {
      "id": 10582,
      "text": "LuxJet Submersible LED Lights Recalled Due to Risk of Serious Injury or Death from Battery Ingestion; Violates Mandatory Standard for Consumer Products with Coin Batteries — This recall involves LuxJet Submersible LED Lights. The LED lights were sold in sets of 10 LED color changing lights, two remote controls, 20 preinstalled CR2450 lithium batteries in the lights and four preinstalled CR2032 lithium batteries in the remote controls. Each light is about 3.5 cm in diameter.",
      "timestamp": "2026-01-29T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "LuxJet Submersible LED Lights"
    },
    {
      "id": 10581,
      "text": "Mindbodygreen Recalls Ultimate Multivitamin+ Dietary Supplement Bottles Due to Risk of Serious Injury or Death from Child Poisoning; Violates Mandatory Standard for Child-Resistant Packaging — This recall involves Mindbodygreen Ultimate Multivitamin+ dietary supplement bottles with the following UPC, lot numbers and manufacturing dates (Month/Year format). The dietary supplements come in eight-ounce amber glass bottles with black caps, each containing 60 capsules. The UPC, lot numbers and manufacturing dates are printed on the bottle. UPC Lot Number Manufacturing Date 850027975177 0515I1 09/2021 0130B2 01/2022 0187I2 08/2022 0324J2 10/2022 0309A3 12/2022 0368L2 12/2022 0272B3 02/2023 850027975429 0408H3 06/2023 0143A4 12/2023 0179C4 02/2024 4021131 05/2024 4033211 07/2024 4080841 10/2024 A010611 03/2025 A021211 03/2025",
      "timestamp": "2026-01-29T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Ultimate Multivitamin+ Dietary Supplement Bottles"
    },
    {
      "id": 10583,
      "text": "Northern Tool + Equipment Recalls Hot Water Pressure Washers Due to Fire Hazard — This recall involves three models of NorthStar pressure washers: NorthStar Gas Wet Steam and Hot Water Pressure Washers with item number 157310, NorthStar Gas Hot Water Commercial Pressure Washers with item number 157594, and NorthStar Trailer-Mounted Hot Water Commercial Pressure Washers with item number 157595. The item number and the serial number are printed on a label located on the engine. Only pressure washers with a MONTHYEAR code in the product serial number between 0125 (January 2025) and 0825 (August 2025), and a WEEKYEAR burner date code between 0125 and 2625 (weeks 01 to 26 of 2025) are included in this recall. The burner date code is printed on a separate label. The location varies per product. Product Name Item Number Item Number and Serial Number location Burner Date Code location NorthStar Gas Wet Steam and Hot Water Pressure Washer 157310 Label on engine Label under battery box NorthStar Gas Hot Water Commercial Pressure Washer 157594 Label on engine Label under ball valve assembly NorthStar Trailer-Mounted Hot Water Commercial Pressure Washer 157595 Label on engine Label under NorthStar logo",
      "timestamp": "2026-01-29T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "NorthStar Hot Water Pressure Washers"
    },
    {
      "id": 10586,
      "text": "Primark Recalls The Nightmare Before Christmas Glow-in-the-Dark Coloring Sets Due to Ingestion Hazard — This recall involves Primark The Nightmare Before Christmas Glow-in-the-Dark Coloring Set, which included five coloring sheets and five glow-in-the-dark crayons in purple, yellow, pink, blue, and orange. The crayons are wrapped in black paper that read \"GLOW IN THE DARK\" with images of the head of Jack Skellington and snowflakes. The product code \"0309401\" is printed on the price tag located on the back of the packaging. \"Primark\" is printed on the top left corner on the front of the packaging and above the Mickey Mouse logo on the back of the packaging. The book measures about 11.5 x 8 inches.",
      "timestamp": "2026-01-29T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Primark The Nightmare Before Christmas Glow-in-the-Dark Coloring Set"
    },
    {
      "id": 10580,
      "text": "Rear Bolts on Trek and Electra Electric Bicycles Recalled Due to Fall Hazard; Manufactured by Hyena — This recall involves the rear wheel bolts on model year 2026 Trek-branded FX+ 1 Midstep, FX+ 1S Midstep, FX+ 1 Stepover, and FX+ 1S Stepover, and Electra-branded Townie Go! Step Thru and Townie Go! S Step Thru electric bicycles sold before October 28, 2025. The bicycles come in various colors and sizes. The Trek bicycles have the word \"TREK\" printed on the downtube of the frame and \"FX+\" is printed on the top tube. The Electra bicycles have the word \"townie\" printed on the downtube, \"electra\" on the seat stay, and \"go!\" on the chain guard. The original rear wheel bolts are black and connect the motor to the rear frame of the bicycles.",
      "timestamp": "2026-01-29T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Rear wheel bolts installed on model year 2026 Trek FX+ 1 and Electra Townie Go! electric bicycles"
    },
    {
      "id": 10578,
      "text": "Sefudun 5% Minoxidil Hair Growth Serum Kits Recalled Due to Risk of Serious Injury or Death from Child Poisoning; Violates Mandatory Standard for Child-Resistant Packaging; Sold on Amazon by Nengmiaokeji — This recall involves Sefudun 5% Minoxidil Hair Growth Serum Kit . The hair serum comes in a black glass bottle with a black and golden dropper cap and a black and white label. The kit included a black plastic applicator. The hair serum has \"SEFUDUN HAIR GROWTH SERUM\" and \"BIOTIN 5% MINOXIDIL\" printed on labels located on the front of the bottle.",
      "timestamp": "2026-01-29T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Sefudun Hair Growth Serum Kits"
    },
    {
      "id": 10587,
      "text": "Viofairy Hair Growth Serum Bottles Recalled Due to Risk of Serious Injury or Death from Child Poisoning; Violates Mandatory Standard for Child-Resistant Packaging; Sold on Amazon by FDA — This recall involves Viofairy Hair Growth Serum. The hair serum comes in black and gold packaging and a black bottle with gold and white label and a black cap. The hair serum has \"VIOFAIRY HAIR GROWTH SERUM\" and \"5% MINOXIDIL With BIOTIN\" printed on labels located the front of the bottle.",
      "timestamp": "2026-01-29T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Viofairy Hair Growth Serum"
    },
    {
      "id": 10575,
      "text": "Aborder Products Recalls Cumbor Retractable Safety Gates Due to Risk of Serious Injury or Death to Children from Entrapment; Violates Mandatory Standard for Gates and Enclosures — This recall involves Cumbor-branded retractable safety gates. The recalled gates have a metal frame and a mesh screen that measures about 34 inches high with an adjustable width up to 55 inches. The gates were sold in black, gray, and white and came with one or more suction cups. \"Model Name: Retractable Safety Gate,\" \"Model Number: S5V2\" and \"Cohort Information: A202504S5V2A001\" are printed on a label sewn to the mesh screen.",
      "timestamp": "2026-01-22T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Cumbor Retractable Safety Gates"
    },
    {
      "id": 10568,
      "text": "Academy Sports + Outdoors Recalls Magellan Odyssey Rocker Chairs Due to Injury and Fall Hazards — This recall involves Academy Sports + Outdoors' Magellan-branded Odyssey Rocker Chairs with date codes 07/2025 or 08/2025 sold from September 2025 to October 2025. The recalled folding chairs were sold in charcoal, navy, olive green and teal and measure about 25.2\" long by 5.5\" deep by 37.4\" high when folded or 25.4\" long by 25.2\" deep by 37.4\" high when opened. They have a metal frame with a mesh backrest, a carrying handle and a drink holder on the side. The Magellan Outdoors logo is printed on the front of the backrest. Only chairs manufactured between July 2025 through August 2025 are included in this recall. \"ACADEMY, LTD,\" \"177296\" and the manufacture date in MM/YYYY format are printed on the tracking label sewn onto the seat of the chair.",
      "timestamp": "2026-01-22T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Magellan Odyssey Rocker Chairs"
    },
    {
      "id": 10573,
      "text": "Based Online Fidget Magnet Ball Toys Recalled Due to Risk of Serious Injury or Death from Magnet Ingestion; Violate Mandatory Standard for Toys — This recall involves Based Online Fidget Magnet Ball Toy Sets. Each set includes four textured, silicone-covered magnet balls in white, yellow, blue and purple. Each ball is about 1.24 inches in diameter. The magnet toys come in a black fabric zippered case. There are no identifying marks on the magnet toys.",
      "timestamp": "2026-01-22T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Based Online Fidget Magnet Ball Toys"
    },
    {
      "id": 10571,
      "text": "Gagaku Children's Ice Cream Toy Playsets Recalled Due to Risk of Serious Injury or Death from Magnet Ingestion Hazard; Violate Mandatory Standard for Toys; Sold on Amazon by Brandworl.USA — This recall involves Gagaku-branded ice cream shop toy playsets. The recalled toy set includes 16 wooden pieces: a cash register, three ice cream cones, six scoops of ice cream, four popsicles, and two cupcakes in varying colors or \"flavors.\" It also comes with one plastic credit card, five plastic dollar bills, one plastic menu and a two-level pink display box labeled \"ICE-CREAM\" on the front, with a black sign on the side. \"GAGAKU\" and \"Model: KABI-0176 G062401IC\" are printed on a label on the underside of the toy.",
      "timestamp": "2026-01-22T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Gagaku Wooden Ice Cream Shop Toy Playsets"
    },
    {
      "id": 10576,
      "text": "Iristar Minoxidil Spray Bottles for Hair and Beard Growth Recalled Due to Risk of Serious Injury or Death from Child Poisoning; Violates Mandatory Standard for Child-Resistant Packaging; Sold on Amazon by Moralowen — This recall involves Iristar Minoxidil Spray Bottles, 5% minoxidil with biotin for hair and beard growth. The sprays come in black plastic bottles with navy blue labels and white highlights with a spray cap. The bottles and outer packaging are labeled \"Iristar\" and \"Minoxidil Spray\" on the front and ingredients and directions for use are found on the back.",
      "timestamp": "2026-01-22T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Iristar Minoxidil Spray Bottles"
    },
    {
      "id": 10569,
      "text": "Johnson Health Tech Expands Recall to Include Matrix Retail and Vision Treadmills Due to Fire Hazard — This recall involves Matrix Retail models T30, TF30, T50, TF50, and T75 treadmills, and Vision models T9800, TF20, T40, and T80 treadmills with certain serial numbers. The treadmills have a running platform that measures 60 inches long by 20 inches wide, a 33-inch-wide console, and were sold with a straight power cord with no power cord bracket. \"Matrix\" or \"Vision\" is printed on the treadmill and treadmill belt. The model number and frame serial number are located on the lower front crossbar near the power switch. The serial number includes the letters TM, a three-digit model number, and the manufacture date in YY/MM format followed by a five-digit serial. The recalled treadmills were manufactured from June 2007 through January 2024 and do not come with a power cord bracket. This recall is an expansion of the prior recall of Matrix T1 and T3 Series Commercial Treadmills, which were also recalled because the power cord can become loose from the treadmill's power socket. The remedy in the prior recall of commercial treadmills is a power cord bracket that requires tools for installation. For this recall expansion, the remedy for consumers is a power cord with an automatic locking-style plug that does not require any tools for installation. Model Name/ Number Recalled Serial Number(s) or Range Matrix Retail T30 (TM729) TM7291709CA00001 - TM7292104C00380 TF30 (TM693, TM693B) TM6931606CA00001 - TM6931705CA00178 TM693B1707CA00001 - TM693B2201C00601 T50 (TM695, TM767) TM6951607CA00001 - TM6952009C00840 TM7672009C00001 - TM76722011C00051 TF50 (TM694, TM694B, TM768) TM6941607CA00001 - TM69482009C00514 TM694B1605C00008 - TM694B2009K03263 TM7682009C00001 - TM7682104C00580 T75 (TM703, TM703B, TM703C, TM703E) TM7031607CA00001 - TM70381903C00088 TM70382311C00229 TM703B1609CA00015 - TM703B1908C00050 TM703B2309C00164, TM703B2311C00282 TM703C1810C00001 - TM703C2212C00127 TM703C2305C00049, TM703C2308C00409 TM703E2304C00002 - TM703E2401C00087 Vision T9800 (TM87) TM87D070600070, TM87D080600128, TM87D0940059, TM87D120100125, and TM87D1206000127 TF20 (TM432, TM432C) TM4321108BD00255 - TM4321610CA00033 TM432C1210CA00002 - TM432C1606CA00200 T40 (TM433, TM433C) TM4331201BD00466 - TM4331510BD00004 TM433C1408CJ00001 - TM433C1602CA00631 T80 (TM445) TM4451210BC00001 - TM4451505BC00150 TM4451212BD00002 - TM4451406BD00125",
      "timestamp": "2026-01-22T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Matrix Retail T30, TF30, T50, TF50, and T75 treadmills, Vision T9800, TF20, T40, and T80 treadmills"
    },
    {
      "id": 10577,
      "text": "Mikario Trading Convertible Baby Gyms Recalled Due to Risk of Serious Injury or Death from Suffocation; Violate Mandatory Standard for Infant Support Cushions; Sold on TikTok Shop — This recall involves Mikario Trading's 5-in-1 baby gyms. The recalled baby gyms convert from an activity center to a tummy-time pillow mat. They were sold in pink and have a toy bar, six detachable plush toys and a set of milestone cards. \"Baby Gym\" and \"Item No.: CBPBG-PIN\" are printed on a label stitched to the product on the edge of the mat at the bottom.",
      "timestamp": "2026-01-22T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Mikario Trading 5-in-1 Convertible Baby Gyms"
    },
    {
      "id": 10567,
      "text": "Thrasio Recalls Angry Orange Enzyme Stain Removers Due to Risk of Exposure to Bacteria — This recall involves Angry Orange Enzyme Stain Removers in Fresh Clean Scent and Orange Twist Scent sold in 24-oz, 32-oz and 1-gallon sizes. The bottles are orange and white and have \"Angry Orange\" and \"Stain & Odor Remover\" written on the front. Some units were sold as a bundle with a UV light that attaches to the spray bottle.",
      "timestamp": "2026-01-22T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Angry Orange Enzyme Stain Removers"
    },
    {
      "id": 10572,
      "text": "Topkay Lighters Recalled Due to Risk of Serious Injury or Death from Fire and Burn Hazards; Violates Mandatory Standard for Multipurpose Lighters; Sold on Amazon by Xiyude — This recall involves Topkay Torch Lighters. The metal lighters are black and come in a two-pack. \"Honest\" is printed on the front of lighter.",
      "timestamp": "2026-01-22T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Topkay Torch Lighters"
    },
    {
      "id": 10574,
      "text": "Vndueey Magnetic Men Toy Sets Recalled Due to Risk of Serious Injury or Death from Magnet Ingestion; Violates Mandatory Standard for Toys — This recall involves Vndueey Magnetic Men toy sets. The toy sets consist of 10 flexible, stick figures in red, orange, pink, yellow, blue, bright red, bright green and transparent. Each stick figure has four small magnets, one in each hand and foot.",
      "timestamp": "2026-01-22T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Vndueey Magnetic Men Toy Sets"
    },
    {
      "id": 10570,
      "text": "Yetonamr Pull String Teething Toys Recalled Due to Risk of Serious Injury or Death from Choking; Violate Mandatory Standard for Toys; Sold on Amazon by Longyanguiheng — This recall involves the Yetonamr Pull String Teething Toy. The teething toy is an off-white disc shape with either a red ball or blue ball in the middle and six long, silicone pull string \"tentacles\" of various colors running through the ball. There are also three free-spinning rings and soft push buttons on the disc. \"Model no. 688-59\" is printed on the product packaging.",
      "timestamp": "2026-01-22T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Yetonamr Pull String Teething Toys"
    },
    {
      "id": 10561,
      "text": "Adams Manufacturing Recalls Adirondack Patio Chairs Due to Injury and Fall Hazards — This recall involves Adirondack-style patio chairs sold under two different brands: Adams RealComfort and StyleWell. The resin chairs with slat backs and seats were sold in blue, dark gray, navy blue, taupe, light blue, lime green and teal. \"ML837-15\" and the manufacture date of August 2025 are molded on the underside of the recalled chairs. The manufacture date is indicated by a dot on a grid, located at the intersection of column \"A\" and row \"25\".",
      "timestamp": "2026-01-15T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Adams RealComfort and StyleWell Adirondack Patio Chairs"
    },
    {
      "id": 10558,
      "text": "BBWOO Baby Loungers Recalled Due to Risk of Serious Injury or Death from Head Injury; Violates Mandatory Standard for Bicycle Helmets — This recall involves BBWOO baby loungers. The recalled baby loungers are made of a foam sleeping pad and padded bumpers with a cloth cover and have a ribbon tie at one end. The model number is located on a tracking label stitched on the outside cover. The baby loungers were sold in the following styles and models: Style Model Number Gray Dinosaur BLG26BE Blue Car BLG23BD Green Line BLG04BD Gray Feather BLG01BE Pink Deer BLG17BI Pink Elephant BLG32BI Gray Line BLG04BE Blue CZC44 Gray CZC41 Khaki-Cotton & Velvet CZC43 Red CZC42",
      "timestamp": "2026-01-15T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "BBWOO Baby Loungers"
    },
    {
      "id": 10566,
      "text": "Curtis International Expands Recall of Frigidaire-brand Minifridges Due to Fire and Burn Hazards — This recall expansion involves Curtis International 6-can minifridge model EFMIS121. This is in addition to certain minifridges with model numbers EFMIS129, EFMIS137, EFMIS149 and EFMIS175 that were previously recalled. \"Frigidaire\" is printed on the front of the units. The model and serial numbers are on a label on the back of the minifridge. This recall includes only the serial numbers identified below. The minifridges were sold in red at Target stores. Model Number Serial Number EFMIS121 Between A2001 and A2310",
      "timestamp": "2026-01-15T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Frigidaire-brand Minifridges, model EFMIS121, with limited serial numbers"
    },
    {
      "id": 10557,
      "text": "Energizer Recalls Rechargeable Lanterns Due to Overheating — This recall involves the Energizer® Large Power Indicator Lantern. The lantern is a cone-shaped portable light with an opaque lens and \"Energizer\" displayed on the side. The top portion of the lantern is gray with a large power button on top and a red handle. The model number of the lantern is BGAAL9 and the SKU number is 039800143341 or 039800143334. The model is located on the bottom of the light, on the removable cover that provides access to the charging cord storage area. The SKU is located on the packaging. Only lanterns with a date code of June 2024 located on the base of the unit, are part of this recall. The date code is shown using two circles, one circle has an arrow pointing to the year (\"24\"), and the other has an arrow pointing to the month (\"6\").",
      "timestamp": "2026-01-15T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Energizer® Large Power Indicator Lanterns"
    },
    {
      "id": 10564,
      "text": "Greatale Recalls Self-Feeding Pillows Due to Risk of Serious Injury or Death from Aspiration and Suffocation — This recall involves Greatale self-feeding pillows. The recalled self-feeding pillows are made of stuffed fabric and have an elastic sleeve to hold a bottle in front of an infant's face. They were sold in white with angel wing shaped decorations. \"Greatale\" is on a label sewn into the seam of the pillow.",
      "timestamp": "2026-01-15T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Self-Feeding Pillows"
    },
    {
      "id": 10563,
      "text": "HEZI Brand Power Strips Recalled Due to Risk of Serious Injury or Death from Electrocution; Sold by HEZI HOME — This recall involves HEZI brand power strips. The HEZI power strip has either a gray or yellow metal enclosure with eight receptacles made of black plastic. There are a power and a circuit breaker switch located at the end of the metal enclosure closest to the power cord.",
      "timestamp": "2026-01-15T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "HEZI Branded Power Strips"
    },
    {
      "id": 10562,
      "text": "Morgan Lane Recalls Children's Pajama Sets Due to Risk of Serious Injury or Death from Burn Hazard; Violate Mandatory Flammability Standards for Children's Sleepwear — This recall involves Morgan Lane Asher Pajama Sets, Style 816TR in Petal. The recalled children's pajama sets are printed with tiny roses and have blue cotton piping and imitation mother-of-pearl buttons. The pajamas were sold in sizes 2T to 14. \"MORGAN LANE\" and \"PURE COTTON\" are printed on labels located in the neck and waistband, and \"100% Cotton Made in India\" is printed on the side seam label.",
      "timestamp": "2026-01-15T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Asher Pajama Sets"
    },
    {
      "id": 10559,
      "text": "R.X.Y Bicycle Helmets Recalled Due to Risk of Serious Injury or Death from Head Injury; Violates Mandatory Standard for Bicycle Helmets — This recall involves R.X.Y-branded adult bike helmets. The recalled helmets were sold in one size fitting a head circumference of about 22.44 to 24.41 inches. The helmets are blue with black and have gray padding, black straps with a silver reflective pattern in the center and a black and red buckle with a gray chin strap. The helmets have a black plastic knob at the back of the helmet for adjusting the fitting. Item number \"Kx012\" is printed on the helmet's instruction manual.",
      "timestamp": "2026-01-15T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "R.X.Y Bicycle Helmets"
    },
    {
      "id": 10565,
      "text": "RootStim Recalls Beard Growth Serum Spray Bottles Due to Risk of Serious Injury or Death from Child Poisoning; Violate Mandatory Standard for Child-Resistant Packaging — This recall involves RootStim Beard Growth Serums spray bottles. The serums come in black boxes with orange and white lettering and have an orange mustache icon on its front panel. The boxes have \"Beard Growth Treatment\" and \"5% Minoxidil - Biotin & Rice Water\" printed on its front, directions and warnings printed on its sides, and \"Distributed By RootStim LLC\" on the bottom. The bottles are black with black spray cap, transparent top cap, and an orange and black wraparound label bearing the same information as the box.",
      "timestamp": "2026-01-15T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "RootStim Beard Growth Serum, 5% Minoxidil"
    },
    {
      "id": 10556,
      "text": "Ruahouine Hair Growth Serum Bottles Recalled Due to Risk of Serious Injury or Death from Child Poisoning; Violates Mandatory Standard for Child-Resistant Packaging; Sold on Amazon by Ruahouine — This recall involves Ruahouine Hair Growth Serum. The serum comes in 60ml (2.11 fl. oz.) transparent amber dropper bottles. \"Ruahouine\", \"Minoxidil Hair Growth Serum\", and \"5% Minoxidil With Biotin\" are printed on labels wrapped around the bottles.",
      "timestamp": "2026-01-15T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Ruahouine Hair Growth Serum Bottles"
    },
    {
      "id": 10560,
      "text": "Yixing Trading Recalls KEAWIS Crib Mattresses Due to Risk of Serious Injury or Death from Entrapment and Suffocation; Violates Mandatory Standard for Crib Mattresses — This recall involves KEAWIS crib mattresses. KEAWIS crib mattresses were sold in white and measure about 38 inches by 24 inches. Model number \"XX-BM-01\" is printed on a label sewn on the side of the mattress.",
      "timestamp": "2026-01-15T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "KEAWIS Crib Mattress"
    }
  ]
}