{
  "source": "cpsc",
  "topic_id": "hydration-bottles-problems",
  "fetched_at": "2025-12-15T18:41:16.624Z",
  "items": [
    {
      "id": 10524,
      "text": "Luyuan Recalls Youth ATVs Due to Risk of Serious Injury or Death from Crash Hazard; Violate Mandatory Standard for All-Terrain Vehicles — This recall involves the X-Pro Eagle 40cc Youth ATV, Model CARTOONS and the FRP Sahara 40cc Youth ATV, Model SHR 40-RED-M. The ATVs come in various colors. Look for \"X PRO\" labels on the sides of the plastic body or \"FRP\" labels on the front small plastic cover as well as the sides of the plastic body.",
      "timestamp": "2025-12-11T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "X-Pro Eagle 40cc Youth ATVs and FRP Sahara 40cc Youth ATVs"
    },
    {
      "id": 10518,
      "text": "Primark Recalls Little Bear 2-Pack Soother Clips Due to Choking and Laceration Hazards — This recall involves the Primark 2-pack Soother Clip - Little Bear. It is a cloth strap with small bears on it and a wooden button to clip on to a child's clothing, designed to hold a pacifier. The product code, 991139699, is printed on the price tag located on the back of the product packaging.",
      "timestamp": "2025-12-11T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Little Bear 2-pack Soother Clip"
    },
    {
      "id": 10523,
      "text": "Sanven Technology Recalls Vevor Ice Crushers Due to Fire Hazard — This recall involves Vevor's ice crushing machines designed for consumer use. The ice crusher has a handle that consumers press down to feed ice into a shoot; the handle activates a cutter within the feed shoot. The products were advertised as Ice Shavers, Ice Crushers, and Snow Cone Makers. The ice crushing machines were all sold under model number BY-300 and BY-300 FS and came in yellow, red, silver and blue. \"Vevor\" and the model number are printed on a label on the top of the product.",
      "timestamp": "2025-12-11T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Vevor Ice Crushers"
    },
    {
      "id": 10521,
      "text": "Sanven Technology Recalls VEVOR Steamers Due to Risk of Serious Injury from Burn Hazard — This recall involves VEVOR Garment Steamers used to remove wrinkles from clothing and textiles. The recalled steamer has an oval-shaped opening for the steam vents and the steamer body is white with \"VEVOR\" and \"TOUGH TOOLS, HALF PRICE\" printed in orange lettering on the side of the product beneath the water reservoir window. There is a red toggle power switch on the handle. \"VEVOR,\" \"Garment Steamer,\" \"FCL-H09,\" and \"Manufacturer: Guangdong ESINO Technology Group Co., Ltd\" are printed on a label on the bottom of the product. The recalled steamer was sold with a silver-colored glove.",
      "timestamp": "2025-12-11T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "VEVOR Garment Steamers"
    },
    {
      "id": 10519,
      "text": "SKCAIHT Children's Costumes Recalled Due to Risk of Injury from Phthalate Exposure; Violates Federal Phthalates Ban; Sold on Amazon by SKCAIHT Direct — This recall involves SKCAIHT-branded Mermaid costumes. The children's recalled costumes consist of a dress and a matching headband. The glittery dress has a blue, purple and pink fabric skirt and a knit purple strapless top with a white starfish and other sea-themed embellishments. The headband has white ears with blue seashells, pink starfish and a mermaid tail. The costumes were sold in children's size XL.",
      "timestamp": "2025-12-11T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "SKCAIHT Children's Little Mermaid Costumes"
    },
    {
      "id": 10517,
      "text": "TREK Recalls Electric Bicycles Due to Fall or Crash Hazard — This recall involves Model Year 2026 Trek-branded Domane+ ALR 5, Domane+ ALR 6 AXS, Checkpoint+ SL 6 and Checkpoint+ SL 7 electric bicycles. The bicycles come in various colors and sizes. The word \"TREK\" is located on the downtube of the frame on the bicycle, and the model's name is printed on the top tube.",
      "timestamp": "2025-12-11T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Model Year 2026 Trek-branded Domane+ ALR 5, Domane+ ALR 6 AXS, Checkpoint+ SL 6 and Checkpoint+ SL 7 Electric Bicycles"
    },
    {
      "id": 10520,
      "text": "Uuoeebb Infant Walkers Recalled Due to Risk of Serious Injury or Death from Fall and Entrapment Hazards; Violate Mandatory Standard for Infant Walkers; Sold on Amazon by BaoD — This recall involves Uuoeebb Infant Walkers. The infant walkers are collapsible with a round base, eight wheels, and seven adjustable height settings. They were sold in gray, black and pink. \"Production Batch: 7654\" is printed on a tracking label located under the seat.",
      "timestamp": "2025-12-11T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Uuoeebb Infant Walkers"
    },
    {
      "id": 10522,
      "text": "YCXXKJ Baby Bath Seats Recalled Due to Risk of Serious Injury or Death to Children from Drowning; Violate Mandatory Standard for Infant Bath Seats; Sold on Amazon by BenTalk — This recall involves YCXXKJ-branded baby bath seats sold in blue, gray, pink, and yellow. The bath seats have two detachable arms that serve as a restraint, four suction cups on the bottom, and three toys; a duck, a turtle, and a whale. \"Model: YD-1958\" is printed on a tracking label located on the back of the bath seat.",
      "timestamp": "2025-12-11T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "YCXXKJ Baby Bath Seats"
    },
    {
      "id": 10516,
      "text": "INIU Recalls Power Banks Due to Fire and Burn Hazards; Sold on Amazon — This recall involves INIU 10,000mAh portable power banks, model BI-B41. The recalled power banks have a black or blue case and the INIU logo and a paw-print LED light are on the front. The model and serial number are printed on the back of the power bank at the bottom. Only portable power banks with serial numbers 000G21, 000H21, 000I21 and 000L21 are included in this recall. Note: Do not throw this recalled lithium-ion battery or device in the trash, in the general recycling stream (e.g., street-level or curbside recycling bins), or in used battery recycling boxes found at various retail and home improvement stores. Recalled lithium-ion batteries must be disposed of differently than other batteries, because they present a greater risk of fire. Your municipal household hazardous waste (HHW) collection center may accept this recalled lithium-ion battery or device for disposal. Before taking your battery or device to a HHW collection center, contact that office ahead of time and ask whether it accepts recalled lithium-ion batteries. If it does not, contact your municipality for further guidance.",
      "timestamp": "2025-12-05T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "INIU BI-B41 Power Banks"
    },
    {
      "id": 10509,
      "text": "Casaottima 13-Drawer Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment Hazards; Violates Mandatory Standard for Clothing Storage Units; Sold on Amazon by Casaottima — This recall involves the recalled Casaottima 13-Drawer Dressers. The recalled dressers were sold in the following colors: black, black and vintage, gray and pink. They have a metal frame, wooden top, 13 collapsable fabric drawers, and an outlet on the top of the dresser. The dressers measure approximately 55 inches (width) x 11.8 inches (depth) x 39.8 inches (height). The recalled product packages are marked with one of the following identifiers: B0D62S9H39, B0D62TCKD7, B0D62SQC6Q, B0D62VBGZG.",
      "timestamp": "2025-12-04T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Casaottima 13-Drawer Dressers"
    },
    {
      "id": 10510,
      "text": "CreateOn Recalls Pip-Cubes Due to Risk of Serious Injury or Death from Magnet Ingestion Hazard — This recall involves CreateOn Crayola-branded pip-Cubes, which are magnetic building cubes sold in Bold Colors and Glitter in sets of 24 or 27 cubes. The Bold Colors cubes are red, green, blue and yellow. The Glitter cubes are purple, pink, blue and green and have glitter on them. \"Crayola\" is imprinted on the left side of each cube. The model/UPC numbers of the recalled cubes are located can be found on the bottom of the product packaging. Cube Sets Model UPC Bold Colors, 24 Cubes 1000199 850067300199 Bold Colors, 27 Cubes 1000243 850067300205 Glitter Cubes, 24 Cubes 1000205 850067300205 Glitter Cubes, 27 Cubes 1000250 850067300250",
      "timestamp": "2025-12-04T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "CreateOn Crayola-branded pip-Cubes"
    },
    {
      "id": 10514,
      "text": "Cubimana Building Toy Sets Recalled Due to Risk of Serious Injury or Death from Battery Ingestion; Violates Mandatory Standard for Toys; Sold on Shein by Vatos Toys — This recall involves Cubimana-branded treehouse building toy sets. The recalled sets consist of 618 multi-colored pieces to build a three-tier treehouse that lights up. A clear piece containing a LED light is attached with a wire to a brown piece that has a preinstalled button cell battery. The Cubimana logo and \"Tree House\" appear on the front and back of the product packaging. \"NO. HG1015\" along with the number of pieces appear on the front.",
      "timestamp": "2025-12-04T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Cubimana Treehouse Building Toy Sets"
    },
    {
      "id": 10515,
      "text": "Grizzly Industrial Recalls Heavy-Duty Planers Due to Impact and Laceration Hazards — This recall involves all Grizzly Industrial 15\" 3HP heavy-duty planers with model number G0815. The G0815 15\" Planer is used to smooth and flatten boards and to ensure consistent thickness across their entire surface. The planer measures 32 inches wide, 28 inches deep and 23.5 inches high. The Grizzly Industrial planers have \"grizzly.com\" and the model number \"G0815\" printed on the front of the planer.",
      "timestamp": "2025-12-04T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "G0815 15\" 3HP Heavy-Duty Planers"
    },
    {
      "id": 10511,
      "text": "HydroJug Recalls 14-Ounce Children's Sport Tumblers Due to Choking Hazard — This recall involves the 14-ounce sport tumbler with serial number 235010 or no serial number on the bottom of the tumbler under the rubber boot. The handle with the rivets is attached to the lid of the tumbler. The recalled tumbler was sold in five patterns: Cowgirl, Daisy Checkers, Dinosaur, Sport and Bows.",
      "timestamp": "2025-12-04T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "14-ounce Children's Sport Tumbler"
    },
    {
      "id": 10512,
      "text": "KTEBO Writing Tablet Toys Recalled Due to Risk of Serious Injury or Death from Battery Ingestion; Violates Mandatory Standard for Toys; Sold on Amazon by KTEBO — This recall involves KTEBO-branded Writing Tablet Toys. The products were sold in sets of two and came in four color variations (pink/blue, green/yellow, orange/blue, purple/red) and two sizes (8.5 inches and 10 inches) with a matching-colored stylus.",
      "timestamp": "2025-12-04T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "KTEBO Writing Tablet Toy"
    },
    {
      "id": 10513,
      "text": "Little Pea Shop Crib Bumpers Recalled Due to Risk of Serious Injury or Death from Suffocation; Violates Federal Crib Bumper Ban; Sold by Little Pea Shop — This recall involves two styles of Little Pea Shop-branded padded crib bumpers. The \"Waffle Bedding Accessory\" style was sold as bumper pads in gray, pink, blue and white and in four different lengths: 23.5 inches, 47 inches, 78.5 inches and 94.5 inches. The \"Plush Crib Bumper\" style was sold as vertical crib slat covers with Velcro in beige and ivory in the shape of bears and rabbits or a star pattern.",
      "timestamp": "2025-12-04T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Little Pea Shop Crib Bumpers"
    },
    {
      "id": 10508,
      "text": "Ningbo Tianqi Electronic Recalls FUFU&GAGA Murphy Wall Beds Due to Impact and Laceration Hazards — This recall involves FUFU&GAGA white wood frame queen size Murphy wall beds. The beds are designed to be wall-mounted and can fold into a cabinet. The wall beds measure about 86 inches high and 65 inches wide. The model number is KF210284US-01MH-A001 and can be found on the instruction booklet and packaging.",
      "timestamp": "2025-12-04T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "FUFU&GAGA White Wood Frame Queen Size Murphy Wall Beds"
    },
    {
      "id": 10507,
      "text": "Primark US Recalls Primark Water Balloon Pumps Due to Injury Hazard — This recall involves Primark Water Balloon Pumps, which were sold in blue and pink. The pumps are shaped like a water bottle with a spray head. The product code 5252801 is printed on the price tag located on the back of the water balloon pump bottle.",
      "timestamp": "2025-12-04T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Primark Water Balloon Pump"
    },
    {
      "id": 10498,
      "text": "Alinux Baby Loungers Recalled Due to Risk of Serious Injury or Death from Entrapment and Fall Hazards; Violates Mandatory Standard for Infant Sleep Products; Sold on Amazon by Winkids — This recall involves Alinux baby loungers. The recalled baby loungers are made of a foam sleeping pad and padded bumpers with a cloth cover and a ribbon tie at one end. They were sold in the following colors: pink, grey and purple. Model number \"BP25001\" and batch number \"ZZ-FBA25052305-1\" are printed on an attached label on the outside of the baby lounger's cover.",
      "timestamp": "2025-11-26T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Alinux Baby Loungers"
    },
    {
      "id": 10504,
      "text": "Convertible High Chairs Recalled Due to Risk of Serious Injury or Death from Fall and Entrapment Hazards; Violate Mandatory Standard for High Chairs; Sold on Amazon by Rotinyard — This recall involves baby high chairs sold in beige or pink with a matching removable seat cushion, detachable tray, and footrest. The high chairs convert into an infant swing and are reclinable and collapsible. \"Product No.: HA-028\" is printed on a tracking label on the seatback.",
      "timestamp": "2025-11-26T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Baby High Chairs (convertible)"
    },
    {
      "id": 10496,
      "text": "Ebern Designs Ojaswi 12-Drawer Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment; Violates Mandatory Standard for Clothing Storage Units; Manufactured and Sold by Ebern Designs — This recall involves Ebern Designs Ojaswi 12-Drawer Dressers. The recalled dressers were sold in gray and white. They have a metal frame, wooden top, and 12 collapsable fabric drawers. The dressers measure about 39 inches by 43 inches by 12 inches and weigh about 31.7 pounds. \"HD011BL-SL\" or \"HD011WH-SL\" is printed on the product packaging.",
      "timestamp": "2025-11-26T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Ebern Designs Ojaswi 12-Drawer Dressers"
    },
    {
      "id": 10500,
      "text": "Ikuso Safety Gates Recalled Due to Risk of Serious Injury or Death to Children from Entrapment; Violates Mandatory Standard for Gates and Enclosures; Sold on Amazon by Ikuso — This recall involves Ikuso-branded safety pressure-mounted safety gates. The white steel safety gates were sold in two adjustable size ranges: between 30 inches and 48 inches (model Door-Gen1-123) and between 30 inches and 63 inches (model Door-Gen1-159). \"Ikuso\" is printed on the latch on the top of the gates, and the model numbers are on labels located on the side-post under the latch of the gate.",
      "timestamp": "2025-11-26T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Ikuso Safety Gates"
    },
    {
      "id": 10497,
      "text": "KingPavonini Adult Portable Bed Rails Recalled Due to Risk of Serious Injury or Death from Entrapment and Asphyxiation; Violate Mandatory Standard for Adult Portable Bed Rails; Sold on Amazon by KingPavonini — This recall involves six KingPavonini-branded adult portable bed rails with model numbers: BC-CBJ-X, BC-CBJ, BC-LDFS-X, LDFS-SSK, 04-BC-LDFS, BC-LDFS. The model numbers can be found in the owner's manual. The recalled bed rails have white or black tubing with rounded black foam rubber handle grips with a black fabric pouch. Some models have support legs and motion-sensor lights. The recalled bed rails have \"KingPavonini\" written on the fabric cover. Model Description Size BC-CBJ-X White tubing with rounded black foam rubber handle grips and black fabric pouch About 32 inches wide and 21 inches in height BC-CBJ White tubing with rounded black foam rubber handle grips and black fabric pouch About 35 inches wide and 21 inches in height BC-LDFS-X White tubing with rounded black foam rubber handle grips, black fabric pouch, and support legs About 36 inches wide and 41 inches in height LDFS-SSK Black tubing with rounded black foam rubber handle grips, black fabric pouch, and support legs 04-BC-LDFS White tubing with rounded black foam rubber handle grips, black fabric pouch, and support legs BC-LDFS White tubing with rounded black foam rubber handle grips, black fabric pouch with motion light, and support legs About 45 inches wide and 44 inches in height",
      "timestamp": "2025-11-26T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "KingPavonini Adult Portable Bed Rails"
    },
    {
      "id": 10499,
      "text": "Macardac Baby Loungers Recalled Due to Risk of Serious Injury or Death from Entrapment and Fall Hazards; Violates Mandatory Standard for Infant Sleep Products; Sold on Amazon by Macardac Products — This recall involves Macardac baby loungers. The recalled baby loungers are made of a foam sleeping pad and padded bumpers with a cloth cover and have a buckle at one end. They were sold in the following colors and prints: blue, brown, brown leaves and pink flower. \"Macardac\" is printed on an attached tag on the outside of the baby lounger's cover.",
      "timestamp": "2025-11-26T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Macardac Baby Loungers"
    },
    {
      "id": 10506,
      "text": "McLee Creations Recalls MyOnlyStyler Root Booster Hair Dryers Due to Risk of Serious Injury or Death from Electrocution and Shock Hazards — This recall involves MyOnlyStyler Root Booster Hair Dryers. The hair dryer was sold in white with black bristles and has \"MY ONLY STYLER\" printed on the handle. Model number \"MOS-22\" is printed on the back of the handle. The hair dryer measures 12 inches long by 1.75 inches wide.",
      "timestamp": "2025-11-26T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "MyOnlyStyler Root Booster Hair Dryers"
    },
    {
      "id": 10505,
      "text": "Outdoor Master Children's and Youth Helmets Recalled Due to Risk of Serious Injury or Death from Head Injury; Violates Mandatory Standard for Bicycle Helmets; Sold and Imported by Outdoor Master — This recall involves two models of Outdoor Master-branded children's and youth bicycle/multi-purpose helmets. Helmet model OM-TD BIKE is blue with a dinosaur print, has black padding, black straps, a black buckle and a black plastic knob at the back of the helmet for adjusting the fitting; and was sold in children's size small (S), fitting a head circumference from 48 to 52 cm (18.9 to 20.5 inches). \"OM-TD BIKE\" and \"05/2024\" (the manufacture date) is printed on a label inside the helmet, and the brand is printed on the back of the helmet. Helmet model OM-KSKB is deep green with black padding, yellow straps, a black buckle and a black plastic knob at the back of the helmet for adjusting the fitting; and was sold in youth size small (S), fitting a head circumference from 46 to 52 cm (18.1 to 20.5 inches). \"OM-KSKB\" and \"11/2022\" (the manufacture date) is printed on a label inside the helmet and the brand is printed on the front and back of the helmet.",
      "timestamp": "2025-11-26T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Outdoor Master Children's and Youth Helmets"
    },
    {
      "id": 10503,
      "text": "Ozark Trail Tabletop 1-Burner Butane Camping Stoves Recalled Due to Serious Burn and Fire Hazards; Imported and Sold by Walmart; Manufactured by China Window Industry Co. — This recall involves Ozark Trail Tabletop 1-Burner Butane Camping Stoves with model number BG2247A1. The model number is printed on a gray label on the inside of the fuel compartment. The camping stoves are dark green with an orange \"Ozark Trail\" logo printed on the front.",
      "timestamp": "2025-11-26T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Ozark Trail Tabletop 1-Burner Butane Camping Stoves"
    },
    {
      "id": 10502,
      "text": "Sofoliana and Glotika Baby Loungers Recalled Due to Risk of Serious Injury or Death from Entrapment and Fall Hazards; Violates Mandatory Standard for Infant Sleep Products; Sold on Amazon by Bosen US — This recall involves Sofoliana and Glotika baby loungers. The recalled baby loungers are rectangular in shape and are made of a foam sleeping pad and padded bumpers with a cloth cover. The Sofoliana baby loungers are dark gray with a ribbon tie at the bottom of the lounger. The Glotika baby loungers zip up into a bag with an adjustable strap and came in the following colors: gray-rocket, pink-heart and white-elephant, with the printed design on the inside of the lounger. Neither baby loungers have any markings or labeling.",
      "timestamp": "2025-11-26T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Sofoliana and Glotika Baby Loungers"
    },
    {
      "id": 10501,
      "text": "Vivohome Adult Portable Bed Rails Recalled Due to Risk of Serious Injury or Death from Entrapment and Asphyxiation Hazards; Violates Mandatory Standard for Adult Portable Bed Rails; Imported by Vivohome — This recall involves Vivohome-branded adult portable bed rails sold for use on adult beds. The recalled bed rails measure about 36.6 inches long, 16.1 inches wide and 15.7 inches in height and have four metallic stand bars with padding, a wooden (model VH1316-WC) or metallic (model VH1316-WH) top bar with a red release button that collapses the bed rail. The model number is printed on the product packaging and the product registration card.",
      "timestamp": "2025-11-26T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Vivohome Adult Portable Bed Rails"
    },
    {
      "id": 10487,
      "text": "AliExpress Recalls Convertible Strollers Due to Risk of Serious Injury or Death from Fall Hazard; Violates Mandatory Standard for Strollers — This recall involves a stroller that converts into a hand-held infant carrier. The product was sold in pink, light pink, blue, dark blue, green, red, teal, gray and black and comes with a gray or black infant insert. The two larger wheels feature yellow accents. There are no markings on the product.",
      "timestamp": "2025-11-20T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "4-in-1 Baby Safety Cart Carriage"
    },
    {
      "id": 10488,
      "text": "Bearlala Baby Loungers Recalled Due to Risk of Serious Injury or Death from Entrapment and Fall Hazards; Violates Mandatory Standard for Infant Sleep Products; Sold on Walmart.com by Nuoxuann — This recall involves Bearlala baby loungers, advertised under the brand \"Granlass.\" The recalled baby loungers are made of a foam sleeping pad and padded bumpers with a cloth cover. The cloth covers are light gray with a leaf pattern. \"Bearlala\" is printed on a label stitched to the outside of the baby lounger's cover.",
      "timestamp": "2025-11-20T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Bearlala Baby Loungers"
    },
    {
      "id": 10492,
      "text": "Demlar Recalls MoonSoll and Magic Chems Fuel Bottles Due to Risk of Serious Injury or Death from Flash Fire; Violates Mandatory Standard for Portable Fuel Containers and FHSA Labeling Requirements; Imported by Demlar Online Store — This recall involves Demlar's bottles of MoonSoll-branded ethanol and Magic Chems-branded bioethanol fuel, used for tabletop fire pits, fireplaces, stoves and burners. The clear fuel bottles have a red or green cap. They were sold individually or as a pack of three and in 500mL and 1000mL capacities. The brand name and capacity are printed on the front of the bottle's label.",
      "timestamp": "2025-11-20T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "MoonSoll and Magic Chems Fuel Bottles"
    },
    {
      "id": 10489,
      "text": "Little Partners Recalls Children's Grow 'N Stow Folding Learning Towers Due to Fall Hazard — This recall involves children's Grow 'N Stow Folding Learning Tower with model number LP01711 and date codes, in YYYYMM format, from 202409 to 202501. The model number and date code are located on a label on the underside of the platform. The product is made of wood with a natural finish. \"Learning Tower\" is printed on the top rail of the tower.",
      "timestamp": "2025-11-20T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Grow 'N Stow Folding Learning Tower"
    },
    {
      "id": 10494,
      "text": "Magnet Fidget Spinner Sets Recalled Due to Risk of Serious Injury or Death from Magnet Ingestion; Violates Mandatory Standard for Toys; Sold on Amazon by Anzmtosn — This recall involves Anzmtosn Magnet Fidget Spinner Sets. Each set contains 15 pieces and comes with four iridescent oval-shaped magnets, eight iridescent cuboidal-shaped magnetic stones, one red and yellow disk-shaped metal fidget spinner, one winged metal fidget spinner, and one multicolored infinity fidget cube. The set comes with a black fabric-lined storage case. The batch number, CCA06582, is printed on the back label of the packaging.",
      "timestamp": "2025-11-20T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Anzmtosn Magnet Fidget Spinner Sets"
    },
    {
      "id": 10491,
      "text": "Mallimoda Children's Pajama Sets Recalled Due to Risk of Serious Injury or Death from Burn Hazard; Violates Mandatory Standards for Children's Sleepwear; Sold on Amazon by Mallimoda — This recall involves Mallimoda-branded children's pajama sets. The recalled pajama sets consist of a long-sleeved, button-up shirt with a front pocket and matching pants. The pajamas are trimmed with black piping and have black buttons. The pajama sets were sold in gray/pink, blue, gray/purple, and light green in sizes 3/4T through 13/14 years. \"Cotton 100%\" and care instructions are printed on the sewn-in side-seam label.",
      "timestamp": "2025-11-20T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Mallimoda Children's Pajama Sets"
    },
    {
      "id": 10490,
      "text": "Play Yards Recalled Due to Risk of Serious Injury or Death from Suffocation and Entrapment Hazards; Violate Mandatory Standard for Play Yards; Sold on Amazon by Anna Queen — This recall involves play yards that have black fabric sides and mesh panels bordered in gray. The top rails are covered with white fabric with a multi-colored print with bear faces, paws and the word \"bear\". The play yards include a mattress with the same bear print. \"Model: P700\" and \"Production Date: 202503\" are printed on the packaging and on a removeable tag included with the play yard.",
      "timestamp": "2025-11-20T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Play Yards"
    },
    {
      "id": 10495,
      "text": "Romorgniz Fabric 12- and 13-Drawer Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment; Violates Mandatory Standard for Clothing Storage Units; Sold on Amazon by Romorgniz — This recall involves Romorgniz Fabric 12- and 13-Drawer Dressers. The dressers come in rustic brown, black, pink and white and have a metal frame and wooden top. The 12-drawer dresser has 12 collapsable fabric drawers, and the 13-drawer dresser has 13 collapsable fabric drawers. The 12-drawer dressers measure about 52 inches by 12 inches by 35 inches. The 13-drawer dressers measure about 35 inches by 11 inches by 55 inches. The 12-drawer dressers have \"Model No.: R99MWM12CHMW\" printed on the back and the 13-drawer dressers have \"Model No.: R99M9C4CLHW\" printed on the back.",
      "timestamp": "2025-11-20T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Romorgniz Fabric 12- and 13-Drawer Dressers"
    },
    {
      "id": 10493,
      "text": "Spartan Mowers and UTVs Recalls Riding Mowers Due to Crash Hazard — This recall involves certain Model Year 2025 Spartan SRT-XD and KGZ-XD zero radius turn (\"ZRT\") riding lawn mowers (model numbers RSKXD161994VO, RSKXD172994VO, RSSXD161994VO, RSSXD161999KE, RSSXD172994VO and RSSXD172999KE) within a limited serial range. The mower is gray, black and orange, and has \"Spartan\" printed on the front of it. The model number and serial number are located on a metal serial plate affixed to the frame of the mower immediately in front of, and at the feet of, the seated operator.",
      "timestamp": "2025-11-20T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Model Year 2025 Spartan SRT-XD and KGZ-XD riding lawn mowers"
    }
  ]
}