{
  "source": "cpsc",
  "topic_id": "hydration-bottles-problems",
  "fetched_at": "2025-11-20T20:30:46.769Z",
  "items": [
    {
      "id": 10484,
      "text": "Belkin Recalls Portable Power Banks and Wireless Charging Stands Due to Fire and Burn Hazards — This recall involves charging stands with model number MMA008 and power banks with model numbers BPB002 and PB0003. Model number \"MMA008\" is printed on the bottom of the charging stand. Serial numbers (14 digits) starting with \"57X\" are included in this recall and are also printed on the bottom of the charging stand. Model number \"BPB002\" is printed on the back top of the power bank. Serial numbers (14 digits) starting with \"35S\" are included in this recall and are also printed on the back of the power bank. Model number \"PB0003\" is printed on the back of the power bank. All serial numbers are included in this recall. Both the charging stands and BPB002 power banks were sold in black. The PB0003 power banks were sold in black or white.",
      "timestamp": "2025-11-13T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Portable Power Banks and Wireless Charging Stands"
    },
    {
      "id": 10480,
      "text": "Bettina Doll Sets Recalled Due to Risk of Serious Injury or Death from Battery Ingestion; Violates Mandatory Standard for Toys; Sold on Amazon by Shantou Chenghai Xingzigu Toy Industry — This recall involves Bettina Doll Set with Magic Light Unicorn. The Magic Light Unicorn is white with multi-colored hair and a pink saddle, and the doll has a pink dress. The unicorn is 10 inches long and 9.5 inches tall, and the doll is 12 inches tall. There is a pink toy hairbrush included with the set.",
      "timestamp": "2025-11-13T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Bettina Doll Set with Magic Light Unicorn"
    },
    {
      "id": 10483,
      "text": "Great Lakes Wholesale International Recalls Select Battery Packs Due to Battery Ingestion; Violates Federal Statute for Child-Resistant Packaging of Button Cell and Coin Batteries — This recall involves Great Lakes Select Battery Packs, each of which displays the name \"Great Lakes Select\" on the back of the packaging, and the item number on the front of the packaging Item Number Description Battery Type Item Price Range 263 Pack of six (6) CR2032 $0.65 to $1.10 264 Pack of nine (9) CR2016/ CR2032/ CR2025 $1.10 to $1.50 265 Pack of nine (9) CR2032 $0.89 to $1.50 271 Pack of thirty (30) Mixed $0.96 to $1.50 272 Pack of forty (40) Mixed Super Alkaline $1.65 to $2.25 276 Pack of twenty-four (24) LR44/357 Super Alkaline $1.10 to $1.50",
      "timestamp": "2025-11-13T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Great Lakes Select Button Cell and Coin Batteries"
    },
    {
      "id": 10486,
      "text": "Tesla Recalls Powerwall 2 AC Battery Power Systems Due to Fire and Burn Hazards; Risk of Serious Injury or Death — This recall involves certain Tesla Powerwall 2 units, fully-integrated AC battery systems used for energy storage for self-consumption, time-based control, and backup power. Model number \"Powerwall 2\" is printed on the nameplate label on the side of the unit.",
      "timestamp": "2025-11-13T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Certain Tesla Powerwall 2 AC Battery Power System"
    },
    {
      "id": 10482,
      "text": "Trek Recalls Bicycles with Coaster Brakes and Replacement Rear Wheels Due to Crash Hazard — This recall involves certain Trek and Electra-branded bicycle models with coaster brakes and replacement rear wheels. The bikes were sold in a variety of colors, including red, flamingo pink, dark aquatic, Mulsanne blue, volt yellow, pink frosting, Miami green, lithium gray, viper red, purple abyss, buttercup, pixie blue and blue. To determine if your bicycle or replacement rear wheel is included in this recall, enter your bicycle's serial number in the look-up tool at https://www.trekbikes.com/us/en_US/coasterbrake-recall-inquiry/. The serial number is printed under the bottom bracket between the pedals and starts with the letters, \"WTU.\" Recalled Trek and Electra-Branded Bicycles and Replacement Wheels: Brand Name Model Name Model Year Electra Townie Rental 1 Step Thru 2026 Trek Precaliber 12 2026 Trek Precaliber 16 2024 and 2026 Trek Precaliber 20 2024 and 2026 Electra Sprocket 1 16 2026 Trek Precaliber 12 CB replacement wheel 2026 Trek Precaliber 16 CB replacement wheel 2026 Trek Precaliber 20 CB replacement wheel 2026",
      "timestamp": "2025-11-13T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Trek and Electra-branded Bicycles with Coaster Brakes and Replacement Rear Wheels with Coaster Brakes"
    },
    {
      "id": 10485,
      "text": "Zigjoy Sleep Sacks with Feet Recalled Due to Risk of Serious Injury or Death from Burn Hazard; Violates Mandatory Standard for Children's Sleepwear; Sold by Zigjoy-US — This recall involves Zigjoy-branded children's one-piece sleep sacks with feet, in blue with an excavator print or pink with a bunny print. The sleep sacks were sold in sizes S, M, and L. \"100% cotton\" and the garment size are printed on a sewn-in side seam label.",
      "timestamp": "2025-11-13T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Zigjoy Toddler Sleep Sacks with Feet"
    },
    {
      "id": 10481,
      "text": "Zippee Silicone Activity Toys Recalled Due to Risk of Serious Injury or Death from Choking; Violates Mandatory Standard for Toys; Imported by Mobi Games — This recall involves the Zippee children's activity silicone toy. The body of the toy is a teal flexible silicone cylinder with holes where six different color silicone strings can be pulled. Five of the six silicone strings contain a spherical ball attached to the end of the string. The recalled toy may have the date codes in MMDDYY format ranging from 030620 to 110823 marked inside the toy's silicone cylinder body.",
      "timestamp": "2025-11-13T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Zippee Activity Toys"
    },
    {
      "id": 10476,
      "text": "Adult Portable Bed Rails Recalled Due to Risk of Serious Injury or Death from Entrapment and Asphyxiation; Violate Mandatory Standard for Adult Portable Bed R Adult Portable Bed Rails Recalled Due to Risk of Serious Injury or Death from ails; Sold on Amazon by Neaude — This recall involves Neaude-branded adult portable bed rails model BR0221SL001, sold for use on adult beds. The recalled bed rails were sold in a silver top rail with silver support columns, blue accents, red handle button and a faux wood top rail with silver support columns in a wave design, white accents and a red handle button. The bed rails measure about 37 inches wide and about 14 inches high and can fold or unfold by pressing the red handle button.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Neaude Adult Portable Bed Rails"
    },
    {
      "id": 10478,
      "text": "Astemrey Recalls Y'all Can DIY Liquid Bioethanol Fireplace Fuel Containers Due to Risk of Serious Injury or Death from Flash Fire; Violates Mandatory Standard for Portable Fuel Containers — This recall involves Y'all Can DIY bioethanol fireplace liquid fuel containers. The fireplace fuel comes in a clear bottle with a black top and a white and black label with orange and white lettering. The fireplace fuels have the brand name and product name in white and orange along with \"No Soot\", \"No Ash\", and \"Clean Burning\" printed on a label on the front and hazard warnings printed on the side.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Y'all Can DIY Liquid Bioethanol Fireplace Fuel Containers"
    },
    {
      "id": 10468,
      "text": "F&F Fine Wines Recalls Kirkland Signature Valdobbiadene Prosecco DOCG Bottles sold by Costco Due to Laceration Hazard — This recall involves certain glass bottles of Kirkland Signature Valdobbiadene Prosecco DOCG. The UPC is 196633883742 and the Costco Item Number is 1879870. The product was sold in a green bottle with purple foil on the top and a purple label with the words \"Kirkland Signature Valdobbiadene Prosecco Superiore DOCG\".",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Kirkland Signature Valdobbiadene Prosecco DOCG bottles"
    },
    {
      "id": 10469,
      "text": "F&F Fine Wines Recalls Kirkland Signature Valdobbiadene Prosecco Entrapment or Suffocation; Violates Mandatory Standards for Mattresses; Sold on Amazon by Mengna Criblike Mattresses Recalled Due to Risk of Serious Injury or Death from Entrapment — This recall involves Criblike aftermarket play yard and non-full sized crib mattresses. The Criblike Pack and Play mattresses, models XCD-001 and XCD-002, come in white and are approximately 38 inches by 26 inches. The Criblike Mini-crib mattresses, model MNCL-001, come in white and are approximately 38 inches by 24 inches. \"Criblike\" and the model number are printed on labels located on the end of the product.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Criblike aftermarket play yard and non-full sized crib mattresses"
    },
    {
      "id": 10475,
      "text": "Inkari Plush Alpaca Toys Recalled Due to Risk of Serious Injury or Death from Choking Hazard; Violate Small Parts Ban; Imported by Inkari — This recall involves five collections of Inkari's plush alpaca toys: naturals, baristas, rainbow, monsterfluffs, and limited edition. The recalled wool stuffed toys were sold in white, ivory, light brown, dark brown, black, pink, purple, light blue, and mixed colors, and in four different sizes: mini (about 6 inches tall), small (about 9 inches tall), medium (about 12 inches tall) and large (about 19 inches tall). \"INKARI\" is printed on a label attached to the underside of the toy.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Inkari Plush Alpaca Toys"
    },
    {
      "id": 10477,
      "text": "Lezyne USA Recalls Bicycle Floor Pumps Due to Serious Injury Hazard — This recall involves two models of Lezyne bicycle floor pumps; the Pressure Over Drive (with analog gauge) and the Digital Pressure Over Drive (with digital gauge). The black tubeless floor pumps are made of steel and aluminum with a natural wood-colored handle and have a nylon-reinforced braided hose. The Lezyne logo is printed on the pump's side. Only floor pumps with a bleed valve on the front of the base are included in this recall.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Lezyne Pressure Over Drive Bicycle Floor Pumps"
    },
    {
      "id": 10471,
      "text": "Napei Infant Bath Tubs Recalled Due to Risk of Serious Injury or Death from Ingestion Hazard; Violates Mandatory Standard for Consumer Products with Button Cell Batteries; Sold on Amazon by Sefon Store — This recall involves Napei collapsible infant bath tubs made of plastic with two detachable legs. The infant bath tubs were sold in a white/gray color combination, with a removable star print cushion insert, a built-in thermometer, and a blue rubber star-shaped drain plug. \"Model No: Baby Bathtub - 0823\" can be found on a label on the bottom of the bath tub.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Napei Collapsible Infant Bath Tubs"
    },
    {
      "id": 10467,
      "text": "Peloton Recalls Original Series Bike+ Exercise Bikes Due to Fall and Injury Hazards — This recall involves Peloton Original Series Bike+ units, with model number PL02 and serial numbers beginning with the letter \"T\". The bike measures 4 ft. long by 2 ft. wide and has an adjustable seat and handlebar. The bike's serial number is located inside the front fork, behind the front fork, or behind the flywheel. Additional information to help locate your Bike+ serial number is available at https://www.onepeloton.com/history-summary.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Peloton Original Series Bike+ Model PL02"
    },
    {
      "id": 10474,
      "text": "Sanven Technology Recalls Vevor Baby Swings Due to Risk of Serious Injury from Suffocation Hazard; Violates Mandatory Standard for Infant Sleep Products and Inclined Sleepers Ban — This recall involves Vevor Baby Swings. The recalled swings are white/gray and black/gray and the base structure includes the \"VEVOR\" trademark. The swings are labeled on the bottom or the back of the base with \"Multi-Function Electric Swing\" and the model number. The white/gray swings with a white base have model number BB501K; the white/gray swings with the gray base have model number BB702A; and the black/gray swings with a black base have model number BB005.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Vevor Baby Swings"
    },
    {
      "id": 10472,
      "text": "STIHL Recalls BR 800 Backpack Blowers Due to Laceration Hazard — This recall involves the fan wheel of the STIHL BR 800 Magnum, models X and C-E, a backpack blower powered by a combustion engine. The backpack blower is gray and orange. \"STIHL,\" \"BR 800,\" and \"X\" or \"C-E\" are printed on the rear of the blower. The recalled blower's serial number is located on a label on the blower tube. Only backpack blowers with serial numbers ranging from 546515117 to 547916107 are included in the recall.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "STIHL BR 800 Backpack Blower"
    },
    {
      "id": 10470,
      "text": "Three-Wheeled Children's Scooters Recalled Due to Fall Hazard; Imported by Konges Sløjd — This recall involves a three-wheeled child's scooter with a foot brake. It is beige and has a T-shaped handle. The aluminum frame scooters were sold as two models. Model number KS101544-P00005 features a cherry print and model number KS101544-P00038 features a lemon print. Both models have batch number 062024, which can be found on the information sticker located on the bottom of the scooter.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Three-Wheeled Children's Scooter with Foot Brake"
    },
    {
      "id": 10473,
      "text": "Umeyda Nightgowns Recalled Due to Risk of Serious Injury or Death from Burns; Violate Mandatory Standards for Children's Sleepwear; Sold on Amazon by Umeyda Company — This recall involves Umeyda children's 100% cotton short-sleeve nightgowns. The nightgowns were sold in black, purple, mint green, baby pink, red, baby pink stripe, hot pink, dark pink, dark green and blue grey in children's sizes 4-5T, 5-6 years, 7-8 years, 9-10 years, 11-12 years, and 13-14 years. The recalled nightgowns have a pocket and buttons down the dress front. The batch number, \"Distributor: StreamBytes LLC\" and \"Made in Xing Tai He Bei China\" are printed on a sewn-in side-seam label.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Umeyda Nightgowns"
    },
    {
      "id": 10479,
      "text": "WYBITNY Bed Rails Recalled Due to Risk of Serious Injury or Death from Entrapment; Violates Mandatory Standard for Children's Portable Bed Rails; Sold on Amazon by WYBITNY — This recall involves WYBITNY-branded children's bed rails. The portable bed rails have a white metal frame and dark gray fabric cushions with foam filling. The brand and \"BGRT003\" are printed on a label located on the fabric cushions.",
      "timestamp": "2025-11-06T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Children's WYBITNY Bed Rails"
    },
    {
      "id": 10461,
      "text": "5-in-1 Convertible High Chairs Recalled Due to Risk of Serious Injury or Death from Fall and Entrapment Hazards; Violates Mandatory Standard for High Chairs; Imported by Harppa — This recall involves Harppa branded 5-in-1 convertible high chairs (Model BHC001). Only high chairs with \"Model Number BHC001\" and \"Production Batch Number 202408\" printed on a label on the back of the chair are included in the recall. The high chairs have a plastic seat frame, metal legs, a tray, cushioned seat insert and a footrest. The high chair converts into a toddler arm chair, baby dining chair, and baby rocking chair. They were sold in green, pink and gray.",
      "timestamp": "2025-10-30T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Harppa 5-in-1 Convertible High Chairs for Babies and Toddlers"
    },
    {
      "id": 10462,
      "text": "Avenco and Novilla Mattresses Recalled Due to Risk of Serious Injury or Death from Fire; Violates Mandatory Flammability Standard for Mattresses; Manufactured by PT Champion — This recall involves mattresses marketed by the Avenco and Novilla brands. The recalled mattresses were sold in various thicknesses, including 6, 10, 12, and 14 inches, and were sold in various sizes including twin, full, queen and king. The mattresses are white and have an accent color around the side of the mattress of light gray, dark gray, or navy depending on the model. The name \"PT Champion\", the manufacture date, the model, the prototype IDs, thickness and size of each mattress are printed in black letters on a sewn-in white label located on one side of the mattress. The manufacture date is in the format: YYYYMMDD-GJ and the models are: A-M02822-10-Q-2, A-M02822-12-K-2, B-M02901-14-Q-1, B-M02905-6-T, or N-M02043-12-F-2. Some of the Avenco mattresses have a navy tag sewn into the side of the mattress. Some of the Novilla mattresses have a green tag sewn into the side of the mattress. Brand Affected Model Thickness (in inches) Width Recalled Manufacturing Dates Avenco A-M02822-10-Q-2 10 Queen 20241119-GJ 20241121-GJ 20241123-GJ Avenco A-M02822-12-K-2 12 King 20241204-GJ 20241216-GJ Avenco/Novilla B-M02901-14-Q-1 14 Queen 20241207-GJ 20241208-GJ 20241217-GJ 20241218-GJ 20241220-GJ Avenco/Novilla B-M02905-6-T 6 Twin 20241217-GJ 20241224-GJ 20250108-GJ 20250109-GJ Novilla N-M02043-12-F-2 12 Full 20241203-GJ 20241204-GJ 20241207-GJ",
      "timestamp": "2025-10-30T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Avenco and Novilla Mattresses"
    },
    {
      "id": 10459,
      "text": "Crate & Barrel Recalls Ana Dining Chairs Due to Fall Hazard — This recall involves Crate & Barrel Ana Dining Chairs with SKU numbers: 108-976, 109-100, 109-117, 109-123, 121-287, 436-035, 436-074, 436-096, 436-123, 686-763, 686-774, 387-127, 387-135, 387-141 and 387-166. The SKU is located on the underside of the chair seat. The recall does not apply to chair models sold after January 23, 2025. The recalled chairs were sold in charcoal, gray, ivory, navy, gray velvet, camel velvet, and olive-green velvet.",
      "timestamp": "2025-10-30T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Ana Dining Chair"
    },
    {
      "id": 10463,
      "text": "DINBooonLUX 12-Inch Full Size Mattresses Recalled Due to Risk of Serious Injury or Death from Fire; Violates Mandatory Standard for Mattress Flammability; Sold on Amazon by DINBooonLUX — This recall involves DINBooonLUX 12-Inch Full Size Hybrid Mattresses. The mattresses are 12 inches thick and were sold in full size. They have a white top and blue sides. \"DINBooonLUX\" is printed on a blue label on one side of the mattress. \"Factory#2023KZF\", Date of Manufacture in MMYYYY format, and \"Model: ZC-A-12F\" are printed on a white label on the mattress.",
      "timestamp": "2025-10-30T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "DINBooonLUX 12-Inch Full Size Hybrid Mattresses"
    },
    {
      "id": 10454,
      "text": "Grundens Recalls Youth Jackets with Drawstrings Due to Strangulation Hazard; Risk of Serious Injury or Death — This recall involves the Youth Clipper 282 Jacket and Youth Zenith 282 Jacket sold in youth sizes 8 - 12. Both jackets have a drawstring in the hood and \"Grundens\" printed on the left chest. Inside the jacket there is a black label with \"Grundens\" and the country of origin in white lettering. The youth Clipper jacket was sold in an orange color and the youth Zenith jacket was sold in orange, navy, and camouflage colors.",
      "timestamp": "2025-10-30T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Grundens Youth Clipper 282 and Zenith 282 Jacket"
    },
    {
      "id": 10457,
      "text": "H-E-B Recalls 12-Pack Destination Holiday Glow Light Stick Bracelets Due to Skin Irritation Hazard — This recall involves Destination Holiday Glow Light Stick bracelets sold in a 12-pack container with UPC 9787014483. The bracelets were sold in green, red, pink, orange, yellow and blue colors. \"Destination Holiday Bracelets\" is printed on the product packaging.",
      "timestamp": "2025-10-30T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Destination Holiday Glow Light Stick Bracelets"
    },
    {
      "id": 10460,
      "text": "HOMEAL Bed Rails Recalled Due to Risk of Serious Injury or Death from Entrapment; Violates Mandatory Standard for Children's Portable Bed Rails; Sold on Amazon by HOMEAL — This recall involves HOMEAL-branded children's bed rails. The portable bed rails have a white steel frame and gray oxford cloth. \"HOMEAL\" is printed on the gray cloth and \"Model No.: 338\" is printed on a label stitched to the product.",
      "timestamp": "2025-10-30T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Children's HOMEAL Bed Rails"
    },
    {
      "id": 10452,
      "text": "Knog Recalls Bicycle Lights Due to Fire and Burn Hazards — This recall involves the Knog Blinder 900 and Blinder 1300 Front Bicycle Lights with the following batch codes: 0124AA, 0423AA, 0723AA, 0923AA, 1023AA, 1123AA and 11A23AA. The batch codes are printed on the underside of the light. They have a black exterior and are marked with the brand \"knog\". The word \"Blinder\" is imprinted on the light's handle. They were sold individually, and in a set, and came with a mount. Note: Do not throw this recalled lithium-ion battery or device in the trash, the general recycling stream (e.g., street-level or curbside recycling bins), or used battery recycling boxes found at various retail and home improvement stores. Recalled lithium-ion batteries must be disposed of differently than other batteries, because they present a greater risk of fire. Your municipal household hazardous waste (HHW) collection center may accept this recalled lithium-ion battery or device for disposal. Before taking your battery or device to a HHW collection center, contact that office ahead of time and ask whether it accepts recalled lithium-ion batteries. If it does not, contact your municipality for further guidance.",
      "timestamp": "2025-10-30T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Knog Blinder 900 and Blinder 1300 Front Bicycle Lights"
    },
    {
      "id": 10464,
      "text": "Milwaukee Tool Recalls M18 FUEL 14\" and 12\" Top Handle Chainsaws Due to Laceration Hazard — This recall involves the M18 FUEL Top Handle Chainsaw, catalog number 2826-20 with a serial break identified with \"A\" in the product's serial number. The catalog number can be found on the upper right portion of the product's nameplate. The serial number can be found on upper left portion of the nameplate, and the serial break level is the 4th digit of the serial number. The product is a battery-operated chainsaw that comes with either a 12\" or 14\" bar, which is intended for use with Milwaukee's M18 batteries. The product is sold either individually as a bare tool that includes a chain and bar cover and blade wrench, or as a kit that includes two (2)M18 batteries, an M18 battery charger, a chain and bar cover and a blade wrench.",
      "timestamp": "2025-10-30T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Milwaukee Tool M18 FUELTM Top Handle Chainsaw with either a 12\" or 14\" bar"
    },
    {
      "id": 10453,
      "text": "Modera Recalls Modera Pack N Play Mattresses Due to Risk of Serious Injury or Death from Entrapment; Violates Mandatory Standard for Crib Mattresses — This recall involves Modera \"Pack N Play\" Play Yard Mattress. The mattresses were sold in white, pink, blue, and gray, and have \"Modera baby\" printed on labels attached to the mattress. The mattresses are dual-sided, with one side labeled \"infant\" and the other side labeled \"toddler.\" The dimensions of the mattress are 38 inches long, 26 inches wide and 1.5 inches thick.",
      "timestamp": "2025-10-30T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Organic Cotton Pack N Play Mattress Dual-Sided Portable Baby Crib Pad"
    },
    {
      "id": 10455,
      "text": "Polaris Industries Recalls Model Year 2025-2026 Ranger XP 1000 NorthStar and Ranger Crew XP 1000 NorthStar Recreational Off-Road Vehicles (ROVs) Due to Risk of Serious Injury from Fire Hazard — This recall involves certain VINs of Polaris Model Year 2025-2026 Ranger XP 1000 NorthStar and Ranger Crew XP 1000 NorthStar ROVs. The recalled vehicles were sold in black, blue, bronze, brown, camouflage, gray, orange, red and white. The vehicles were sold in three and six-seat configurations and have \"POLARIS\" stamped on the front grille. The VIN is printed on the left rear frame (on the driver's side of the vehicle) under the cargo box.",
      "timestamp": "2025-10-30T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Model Year 2025-2026 Ranger XP 1000 NorthStar and Ranger Crew XP 1000 NorthStar Recreational Off-Road Vehicles (ROVs)"
    },
    {
      "id": 10465,
      "text": "The Kroger Co. Recalls Halloween-Themed Skeleton Wax Candles Due to Fire Hazard — This recall involves a Halloween-themed Skeleton Wax Candle, which is a white candle in a black plastic bowl that includes skeleton and pumpkin ornaments and a duck candle. The plastic container bears a misspelled warning label that reads: \"WANING: PLASTIC CONTAINER AND ONAMENTS ARE FLAMMABLE\". Other labeling on the container includes a red $7 price sticker and a warning label that reads \"This product not intended for use by or accessible to children 12 years of age or younger. MADE IN CHINA\" with model number D310800CN01.",
      "timestamp": "2025-10-30T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Halloween-themed Skeleton Wax Candle"
    },
    {
      "id": 10458,
      "text": "Werner Paddles Recalls Kayak Paddles Bracelets Due to Drowning Hazard — This recall involves models Stealth and Covert kayak paddles. The brand name Werner appears on decals on both blades and the model name is printed on the right paddle blade. The paddles are made of black carbon fiber.",
      "timestamp": "2025-10-30T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Stealth and Covert Kayak Paddles"
    },
    {
      "id": 10466,
      "text": "WLIVE Fabric Drawer Dressers Recall Expanded to Include 16-Drawer Dressers Due to Risk of Serious Injury or Death from Tip-Over and Entrapment; Violates Mandatory Standard for Clothing Storage Units; Sold on Amazon by WLIVE — This recall expansion involves WLIVE Fabric 16-drawer dressers. The recalled dressers were sold in charcoal black, charcoal black wood grain, black rustic brown, dark gray, light gray, rustic brown wood grain print, and white and have a metal frame, wooden top, and 16 collapsable fabric drawers. The 16-drawer dressers have \"ASNG093\" printed on labels located on the product packaging.",
      "timestamp": "2025-10-30T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "WLIVE Fabric 16-Drawer Dressers"
    },
    {
      "id": 10456,
      "text": "YaFiti Fabric 12-Drawer Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment; Violates Mandatory Standard for Clothing Storage Units; Sold on Amazon by YaFiti — This recall involves YaFiti Fabric 12-Drawer Dressers. The recalled dressers were sold in the following colors: black, black wood veins, grey, oak grey, pink and rustic brown. They have a metal frame, wooden top and 12 collapsable fabric drawers. \"HI1381_13\", \"DD-02-BP\", \"HI1381_09\", \"DD-02-O\", \"DD-02-P\", \"DD-02-B\" are printed on labels located on the outer packaging box of the product.",
      "timestamp": "2025-10-30T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "YaFiti Fabric 12-Drawer Dressers"
    },
    {
      "id": 10451,
      "text": "3M Company Recalls Thermal Laminators Due to Overheating — This recall involves the Scotch™ Thermal Laminator, model TL909-50. The laminator is light gray/white with gray accents, and the word \"Scotch\" is printed in gray on the front. The laminating slot is approximately 9 inches wide. The model number and serial number are located on a sticker on the bottom of the laminator. Only units with serial numbers between 2406000001 and 2501001920 are included in this recall.",
      "timestamp": "2025-10-23T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Scotch™ brand TL909-50 thermal laminator"
    },
    {
      "id": 10450,
      "text": "Bealife 5-Drawer Dressers Recalled Due to Risk of Serious Injury or Death from Tip-Over and Entrapment Hazards; Violates Mandatory Standard for Clothing Storage Units; Imported by Bealife — This recall involves Bealife 5-Drawer Dressers. The recalled dressers are white and measure about 32 inches high by 28 inches wide by 16 inches deep. Model number AP23-W is printed on the product packaging. The model number does not appear on the product itself.",
      "timestamp": "2025-10-23T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Bealife 5-Drawer Dressers"
    },
    {
      "id": 10444,
      "text": "Cranach Hardware Recalls Tip Restraint Kits Due to Tip-Over Hazard; Manufactured by Cranach Hardware — This recall involves defective plastic tip restraint kits (also referred to as furniture straps) manufactured by Cranach Hardware. The recalled tip restraint kits contain two white plastic brackets/mounts (one for connection to furniture and the other for connection to the wall), a white plastic cable zip tie, two different pairs of screws (one longer than the other), and two drywall anchors. The plastic in the brackets/mounts and the cable zip tie can break or degrade over time, which could lead to furniture tipping over if a consumer interacts with furniture that was secured by the recalled product. CPSC testing revealed that the recalled plastic tip restraints failed to meet the requirements of ASTM F3096-23, the industry standard for tip restraints. Young children or elderly adults could be severely injured if interacting with furniture that is secured to the wall with these defective plastic tip restraints.",
      "timestamp": "2025-10-23T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Cranach Hardware Plastic Tip Restraint Kits"
    },
    {
      "id": 10447,
      "text": "J & D Brush Recalls Bio Ionic Hair Curling Irons Due to Burn Hazard — This recall involves the Bio Ionic One-Inch-Long Barrel Curling Iron model number LXT-CL-1.0 with a date code between 0722 and 1223. The curling iron has a black handle and black barrel. The product measures about 15.8 inches long by 2.87 inches high by 1.65 inches wide and weighs about 15 ounces. The curling iron handle has a blue BIOIONIC logo and a black label that provides operating instructions. The model number can be found on the rating label located on the handle of the curling iron. The date code is engraved on the prongs of the plug in the format MMYY representing the month and year.",
      "timestamp": "2025-10-23T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Bio Ionic One-Inch-Long Barrel Curling Iron"
    },
    {
      "id": 10443,
      "text": "LEACHOI Adult Portable Bed Rails Recalled Due to Risk of Serious Injury or Death from Entrapment and Asphyxiation; Violates Mandatory Standard for Adult Portable Bed Rails; Sold on Amazon by LEACHOI — This recall involves LEACHOI Bed Rails, ASIN B0BZVCG2R5. The bed rail comes in black/silver and weighs 7.72 pounds. The product measures 15.6 inches by 25.4 inches by 24 inches.",
      "timestamp": "2025-10-23T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "LEACHOI Bed Rail"
    },
    {
      "id": 10442,
      "text": "Lifepro Fitness Recalls Bioremedy Infrared Sauna Blankets Due to Risk of Burn Injuries — This recall involves all Lifepro Bioremedy Infrared Sauna Blankets with model numbers LP-BRMDYL-BLK, LP-BRMDYL-GRY, LP-BRMDYR-BLK, LP-BRMDYR-GRY, LP-BRMDYR-BLU, LP-BRMDYR-PNK, and LP-BRMDYR-PRPL. Only blankets with a control pad that has a gray face are included in this recall. The recalled sauna blankets were sold in two sizes, 31 inches by 71 inches (regular) and 36 inches by 76 inches (large). The sauna blankets come in black, gray, pink and purple. \"Lifepro\" and the model number are printed on the front of the blanket and the controller.",
      "timestamp": "2025-10-23T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Bioremedy Infrared Sauna Blankets"
    },
    {
      "id": 10446,
      "text": "Olympia Tools International Recalls Pack-N-Stroll Utility Wagons Due to Risk of Serious Injury or Death from Entrapment and Falls; Violates Mandatory Standard for Strollers — This recall involves the Pack-N-Stroll Premium Folding Utility Wagon. The product was sold in black with blue accents on the handle, wagon, and wheel spokes. The product was also sold with a removable organizational tray and two cup holders attached to the push/pull handle. The utility wagon can fold for storage. \"Pack-N-Stroll\" is in blue lettering on a black label attached to the utility wagon.",
      "timestamp": "2025-10-23T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Pack-N-Stroll Premium Folding Utility Wagon"
    },
    {
      "id": 10445,
      "text": "Sauna360 Recalls Tylö Halmstad and Kiruna Hybrid Saunas Due to Fall Hazard — This recall involves bench seating in Sauna360's Tylö branded Halmstad and Kiruna Hybrid sauna rooms. The serial number for each room can be found on both the packaging and the sauna rooms. The Halmstad 2, 3, and 4 sauna rooms have the serial number label located beneath the upper bench on the left side, directly above the electrical contactor box. The Kiruna Hybrid 2 and 3 rooms have the serial number label applied to the right wall, located beneath the right side of the upper bench. The model number is printed in the manual. The following models and serial numbers are included in this recall: Recalled Model Numbers Range of Recalled Serial Numbers TRAD, Tylö Halmstad™ 2, W/BLISS, 15A, 120V, CB21-1, V1 CSFxxABTRxx-V1-4933 through CSFxxABTRxx-V1-6970 TRAD, Tylö Halmstad™ 2, W/BLISS, 20A, 120V, CB21-1, V1 TRAD, Tylö Halmstad™ 3, W/BLISS, 240V, CB23-1, V1 TRAD, Tylö Halmstad™ 4, W/BLISS, 240V, CB23-1, V1 IS, Tylö Kiruna Hybrid™ 2, W/BLISS, 15A, 120V, LOW EMR, CB20-1, V1 CSFxxABISxxTL-V1-4964 through CSFxxABISxxTL-V1-7224 IS, Tylö Kiruna Hybrid™ 2, W/BLISS, 20A, 120V, LOW EMR, CB20-1, V1 IS, Tylö Kiruna Hybrid™ 3, W/BLISS, 240V, LOW EMR, CB22-1, V1",
      "timestamp": "2025-10-23T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Tylö Halmstad and Kiruna Hybrid Saunas"
    },
    {
      "id": 10449,
      "text": "Scepter Fuel Containers Recalled Due to Risk of Serious Injury or Death from Flash Fire, Burn and Child Poisoning; Violates Mandatory Standards for Portable Fuel Containers; Imported by Canada Prep and Ship — This recall involves Scepter B62 gas and oil fuel containers. The recalled combination fuel containers are red with black caps and yellow spouts on each end. They have dual chambers with a 6-liter gas capacity on one side and 2.5-liter oil capacity on the other. \"Scepter\" and \"Gasoline Danger\" are embossed on the side of the container and a Fire Marshall stamp is on the front-left-side of the gas tank, near the fuel spout.",
      "timestamp": "2025-10-23T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Scepter Gas and Oil Combination Fuel Containers"
    },
    {
      "id": 10448,
      "text": "Scepter Fuel Containers Recalled Due to Risk of Serious Injury or Death from Flash Fire, Burn and Child Poisoning; Violates Mandatory Standards for Portable Fuel Containers; Imported by Pro Recycle — This recall involves Scepter B62 gas and oil fuel containers. The recalled combination fuel containers are red with black caps and yellow spouts on each end. They have dual chambers with a 6-liter gas capacity on one side and 2.5-liter oil capacity on the other. \"Scepter\" and \"Essence Danger\" are embossed on the side of the container.",
      "timestamp": "2025-10-23T00:00:00",
      "lang": "en",
      "hazard": null,
      "remedy": null,
      "product": "Scepter Gas and Oil Combination Fuel Containers"
    }
  ]
}