{
  "source": "youtube",
  "topic_id": "hydration-bottles-problems",
  "fetched_at": "2025-11-11T02:00:15.676Z",
  "items": [
    {
      "id": "n-HLB4cGyOE:UgxfCos3mZDxwBLlv6h4AaABAg",
      "text": "All of these bots in the comments hyping middle eastern fragrances lmao a dupe is a dupe and they all smell synthetic. Better save up and buy a good fragrance. I was baited as well into going for dupes and they were all so weird. just my experience tho.",
      "likes": 0,
      "timestamp": "2025-11-07T19:08:54Z",
      "lang": "en"
    },
    {
      "id": "n-HLB4cGyOE:Ugz9L83647XOjNrnPJN4AaABAg",
      "text": "I love cassili, but now I buy a clone for like 20 us dollars... smells the same and lasts longer.",
      "likes": 0,
      "timestamp": "2025-10-30T07:00:38Z",
      "lang": "en"
    },
    {
      "id": "n-HLB4cGyOE:UgyjdSdgwTTIOo-SzXx4AaABAg",
      "text": "I am kind of like this with Bleu de Chanel EDP, I’ve continued to buy it time and time again every couple of years but cannot get anything cheaper that is “exactly” a 1 to 1 of BDC.Davidoff, Lacoste, Diesel and so on are probably as cheap as you’ll find any sort of designer fragrance today.Middle Eastern brands I don’t mind but it entirely depends on the scent profile as a lot of Middle Eastern produced fragrances are not going to appeal to the mass European markets taste unless of course there replicating mainstream designer fragrances, case in point I got on the Tiktok hype about Nocturno by Rayhaan, thats me decided I’ll never go near a Dior Sauvage again, aside from the Elixir, subsequently I purchased Valhalla by Rayhaan and immediately liked how unique it was therefore their is really no need for me to consider anything else.I will say that I think Middle Eastern brands are slaying it just now and ultimately if price meets the consumers expectations of how much it should cost not what firm simply want you to pay, they’ll get increased sales, I’m guessing it’s also a similar thing to the way Chinese cars are all over Europe now.",
      "likes": 0,
      "timestamp": "2025-10-29T22:21:00Z",
      "lang": "en"
    },
    {
      "id": "n-HLB4cGyOE:UgzN_wDNM7zgtHfzyA14AaABAg",
      "text": "I mean shit as long as I’ve always known that stuff is expensive. I used to not even buy cologne at all because of how high it is . I get I came to do research on dupes and budget friendly gems I found a lot more success and now I have a small beginners collection. But it’s one that I think it’s pretty good . I’ve got just about every scent you can think of . And it took me 100 dollars less to get about 20 different bottles. To me that sounds like a way better deal than spending almost 300 dollars for 1 bottle . Idc how much money you make in life . Me personally I’ll never pay 300 dollars just to have a nice smell as I walk around 🤷🏾‍♂️. I mean maybe a nice bottle or two in your collection is nice . But man you guys must be rich . To have a full collection of these expensive ass bottles of cologne is truly remarkable 😂😅",
      "likes": 0,
      "timestamp": "2025-10-29T05:13:14Z",
      "lang": "en"
    },
    {
      "id": "n-HLB4cGyOE:Ugyls2wiX8zy5PaTSZ54AaABAg",
      "text": "Thank u for saying this I&#39;ve recently bitten into fragrance n my normal is 200 but hubby says he used to buy these from macy under 100. N i feel robbed now. I got deal on a pdm but I still regret buying it coz y its less for women n more expensive than the mens? I cant return it coz I bought it in air 😂",
      "likes": 0,
      "timestamp": "2025-10-28T19:02:40Z",
      "lang": "en"
    },
    {
      "id": "n-HLB4cGyOE:UgyNE_zXnRhxyVVHfBF4AaABAg",
      "text": "Yep. This is it. It also makes it really hard to differentiate between brands who are selling high quality / creativity vs those selling clout.",
      "likes": 0,
      "timestamp": "2025-10-28T02:39:46Z",
      "lang": "en"
    },
    {
      "id": "n-HLB4cGyOE:UgyvNAAXJaeOFnHAQWl4AaABAg",
      "text": "Rich people won’t ever stop buying at those inflated prices so these Prices will never come down.",
      "likes": 2,
      "timestamp": "2025-10-27T21:51:34Z",
      "lang": "en"
    },
    {
      "id": "n-HLB4cGyOE:UgzLPEJY22TBlfo7iDx4AaABAg",
      "text": "My dad (who is sensitive to fragrances), told me after wear LV Imagination “Ooh you smell nice!” Later, like months — later that year, I thought and wore Amber Oud Aqua Dubai (an imagination clone), and you know what he said? “Ooh you smell nice!”",
      "likes": 0,
      "timestamp": "2025-10-27T16:42:49Z",
      "lang": "en"
    },
    {
      "id": "n-HLB4cGyOE:UgwaIy8WC1rzNfcv85Z4AaABAg",
      "text": "the most expensive fragrance that i bought is around $150, i forgot which one between Mancera Soleil d&#39; Italie or Dior Sauvage EDP. and from ±30 fragrances that i have, probably around 70% dominated by Middle Eastern Fragrance. the presentation is great, and it smells really good for a fraction of the price. that&#39;s the reason i&#39;m not gonna spend over than $100 for fragrance, except if i need it the most, either because of the presentation, or the scent profile.",
      "likes": 0,
      "timestamp": "2025-10-26T23:49:51Z",
      "lang": "en"
    },
    {
      "id": "n-HLB4cGyOE:Ugyrztulk-f4UgjSvqR4AaABAg",
      "text": "I&#39;ve decided that they can all go to hell! I now invest in CLONES, UNBOXED and USED bottles! They can all f***king smell phenomenal after all! 😅",
      "likes": 0,
      "timestamp": "2025-10-26T22:40:38Z",
      "lang": "en"
    },
    {
      "id": "n-HLB4cGyOE:Ugwuuxrp6DKEaV8_JSJ4AaABAg",
      "text": "And that’s why I shop the discount websites. I got a Mind Games fragrance from Jomashop for 40% off, I paid $238. From the few middle eastern fragrances I’ve tried I do notice a big difference in the dupes, for some reason a get a large amount of alcohol smell. I let them sit for 2-3 months in a dark cabinet in a cool room and spray 15-20 times to try and clear the atomizer, but I can’t seem to get rid of the cheap hairspray smell.",
      "likes": 0,
      "timestamp": "2025-10-26T19:36:21Z",
      "lang": "en"
    },
    {
      "id": "n-HLB4cGyOE:UgwnLxVHgLHZy7RDndN4AaABAg",
      "text": "Simple. Don’t buy the inflated prices.",
      "likes": 5,
      "timestamp": "2025-10-26T03:30:34Z",
      "lang": "en"
    },
    {
      "id": "t6P7G54a9JM:Ugza-TzTEIDAr0Hqzmp4AaABAg",
      "text": "DUDE STOP YAPPING, THE BOTTLE CAP IS CHEAP PLASTIC THAT WILL MELT",
      "likes": 1,
      "timestamp": "2025-11-01T19:46:21Z",
      "lang": "en"
    }
  ]
}